<?php
/**
 * @author Fm453(方少)
 * @DACMS https://api.hiluker.com
 * @site https://www.hiluker.com
 * @url http://s.we7.cc/index.php?c=home&a=author&do=index&uid=662
 * @email fm453@lukegzs.com
 * @QQ 393213759
 * @wechat 393213759
*/

/*
 * @remark 地区与区域定义
 */
defined('IN_IA') or exit('Access Denied');
global $_GPC;
global $_W;
global $_FM;
$LIB_areas = [
	[
		'code' => '110000',
		'en' => 'beijing',
		'cn' => '北京市',
		'children' => [
			[
				'code' => "110101",
				'en' => 'beijing',
				'cn' => "北京市",
				'children' => [
					[
						'code' => "110101",
						'en' => 'dongcheng',
						'cn' => "东城区"
					],
					[
						'code' => "110102",
						'en' => 'xicheng',
						'cn' => "西城区"
					],
					[
						'code' => "110103",
						'en' => 'chongwen',
						'cn' => "崇文区"
					],
					[
						'code' => "110104",
						'en' => 'xuanwu',
						'cn' => "宣武区"
					],
					[
						'code' => "110105",
						'en' => 'chaoyang',
						'cn' => "朝阳区"
					],
					[
						'code' => "110106",
						'en' => 'fengtai',
						'cn' => "丰台区"
					],
					[
						'code' => "110107",
						'en' => 'shijingshan',
						'cn' => "石景山区"
					],
					[
						'code' => "110108",
						'en' => 'haidian',
						'cn' => "海淀区"
					],
					[
						'code' => "110109",
						'en' => 'mentougou',
						'cn' => "门头沟区"
					],
					[
						'code' => "110111",
						'en' => 'fangshan',
						'cn' => "房山区"
					],
					[
						'code' => "110112",
						'en' => 'tongzhou',
						'cn' => "通州区"
					],
					[
						'code' => "110113",
						'en' => 'shunyi',
						'cn' => "顺义区"
					],
					[
						'code' => "110114",
						'en' => 'changping',
						'cn' => "昌平区"
					],
					[
						'code' => "110115",
						'en' => 'daxing',
						'cn' => "大兴区"
					],
					[
						'code' => "110116",
						'en' => 'huairou',
						'cn' => "怀柔区"
					],
					[
						'code' => "110117",
						'en' => 'pinggu',
						'cn' => "平谷区"
					],
					[
						'code' => "110228",
						'en' => 'miyun',
						'cn' => "密云县"
					],
					[
						'code' => "110229",
						'en' => 'yanqing',
						'cn' => "延庆县"
					],
					[
						'code' => "110230",
						'en' => 'other',
						'cn' => "其它区"
					]
				]
			]
		]
	],

	[
		'code' => '120000',
		'en' => 'tianjin',
		'cn' => '天津市',
		'children' => [
			[
				'code' => "120100",
				'en' => 'tianjin',
				'cn' => "天津市",
				'children' => [
					[
						'code' => "120101",
						'en' => 'heping',
						'cn' => "和平区"
					],
					[
						'code' => "120102",
						'en' => 'hedong',
						'cn' => "河东区"
					],
					[
						'code' => "120103",
						'en' => 'hexi',
						'cn' => "河西区"
					],
					[
						'code' => "120104",
						'en' => 'nankai',
						'cn' => "南开区"
					],
					[
						'code' => "120105",
						'en' => 'hebei',
						'cn' => "河北区"
					],
					[
						'code' => "120106",
						'en' => 'hongqiao',
						'cn' => "红桥区"
					],
					[
						'code' => "120107",
						'cn' => "塘沽区"
					],
					[
						'code' => "120108",
						'en' => 'hangu',
						'cn' => "汉沽区"
					],
					[
						'code' => "120109",
						'en' => 'dagang',
						'cn' => "大港区"
					],
					[
						'code' => "120110",
						'en' => 'dongli',
						'cn' => "东丽区"
					],
					[
						'code' => "120111",
						'en' => 'xiqing',
						'cn' => "西青区"
					],
					[
						'code' => "120112",
						'en' => 'jinnan',
						'cn' => "津南区"
					],
					[
						'code' => "120113",
						'en' => 'beichen',
						'cn' => "北辰区"
					],
					[
						'code' => "120114",
						'en' => 'wuqing',
						'cn' => "武清区"
					],
					[
						'code' => "120115",
						'en' => 'baochi',
						'cn' => "宝坻区"
					],
					[
						'code' => "120116",
						'en' => 'binhaixin',
						'cn' => "滨海新区"
					],
					[
						'code' => "120221",
						'en' => 'ninghe',
						'cn' => "宁河县"
					],
					[
						'code' => "120223",
						'en' => 'jinghai',
						'cn' => "静海县"
					],
					[
						'code' => "120225",
						'en' => 'ji',
						'cn' => "蓟县"
					],
					[
						'code' => "120226",
						'en' => 'other',
						'cn' => "其它区"
					]
				]
			]
		]
	],

	[
		'code' => '130000',
		'en' => 'hebei',
		'cn' => '河北省',
		'children' => [
			[
				'code' => "130100",
				'en' => 'shijiazhuang',
				'cn' => "石家庄市",
				'children' => [
					[
						'code' => "130102",
						'en' => 'changan',
						'cn' => "长安区"
					],
					[
						'code' => "130103",
						'en' => 'qiaodong',
						'cn' => "桥东区"
					],
					[
						'code' => "130104",
						'en' => 'qiaoxi',
						'cn' => "桥西区"
					],
					[
						'code' => "130105",
						'en' => 'xinhua',
						'cn' => "新华区"
					],
					[
						'code' => "130107",
						'en' => 'jingxingkuang',
						'cn' => "井陉矿区"
					],
					[
						'code' => "130108",
						'en' => 'yuhua',
						'cn' => "裕华区"
					],
					[
						'code' => "130121",
						'en' => 'jingxing',
						'cn' => "井陉县"
					],
					[
						'code' => "130123",
						'en' => 'zhengding',
						'cn' => "正定县"
					],
					[
						'code' => "130124",
						'en' => 'luancheng',
						'cn' => "栾城县"
					],
					[
						'code' => "130125",
						'en' => 'xingtang',
						'cn' => "行唐县"
					],
					[
						'code' => "130126",
						'en' => 'lingshou',
						'cn' => "灵寿县"
					],
					[
						'code' => "130127",
						'en' => '',
						'cn' => "高邑县"
					],
					[
						'code' => "130128",
						'en' => '',
						'cn' => "深泽县"
					],
					[
						'code' => "130129",
						'en' => '',
						'cn' => "赞皇县"
					],
					[
						'code' => "130130",
						'en' => '',
						'cn' => "无极县"
					],
					[
						'code' => "130131",
						'en' => '',
						'cn' => "平山县"
					],
					[
						'code' => "130132",
						'en' => '',
						'cn' => "元氏县"
					],
					[
						'code' => "130133",
						'en' => '',
						'cn' => "赵县"
					],
					[
						'code' => "130181",
						'en' => '',
						'cn' => "辛集市"
					],
					[
						'code' => "130182",
						'en' => '',
						'cn' => "藁城市"
					],
					[
						'code' => "130183",
						'en' => '',
						'cn' => "晋州市"
					],
		[
			'code' => "130184",
			'en' => '',
			'cn' => "新乐市"
		],
		[
			'code' => "130185",
			'en' => '',
			'cn' => "鹿泉市"
		],
		[
			'code' => "130186",
			'en' => '',
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130200",
		'en' => '',
		'cn' => "唐山市",
		'children' => [
	[
			'code' => "130202",
			'en' => '',
			'cn' => "路南区"
		],
		[
			'code' => "130203",
			'en' => '',
			'cn' => "路北区"
		],
		[
			'code' => "130204",
			'en' => '',
			'cn' => "古冶区"
		],
		[
			'code' => "130205",
			'en' => '',
			'cn' => "开平区"
		],
		[
			'code' => "130207",
			'en' => '',
			'cn' => "丰南区"
		],
		[
			'code' => "130208",
			'cn' => "丰润区"
		],
		[
			'code' => "130223",
			'en' => '',
			'cn' => "滦县"
		],
		[
			'code' => "130224",
			'en' => '',
			'cn' => "滦南县"
		],
		[
			'code' => "130225",
			'en' => '',
			'cn' => "乐亭县"
		],
		[
			'code' => "130227",
			'en' => '',
			'cn' => "迁西县"
		],
		[
			'code' => "130229",
			'en' => '',
			'cn' => "玉田县"
		],
		[
			'code' => "130230",
			'en' => '',
			'cn' => "唐海县"
		],
		[
			'code' => "130281",
			'en' => '',
			'cn' => "遵化市"
		],
		[
			'code' => "130283",
			'en' => '',
			'cn' => "迁安市"
		],
		[
			'code' => "130284",
			'en' => '',
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130300",
		'en' => '',
		'cn' => "秦皇岛市",
		'children' => [
	[
			'code' => "130302",
			'en' => '',
			'cn' => "海港区"
		],
		[
			'code' => "130303",
			'en' => '',
			'cn' => "山海关区"
		],
		[
			'code' => "130304",
			'en' => '',
			'cn' => "北戴河区"
		],
		[
			'code' => "130321",
			'en' => '',
			'cn' => "青龙满族自治县"
		],
		[
			'code' => "130322",
			'en' => '',
			'cn' => "昌黎县"
		],
		[
			'code' => "130323",
			'en' => '',
			'cn' => "抚宁县"
		],
		[
			'code' => "130324",
			'en' => '',
			'cn' => "卢龙县"
		],
		[
			'code' => "130398",
			'en' => '',
			'cn' => "其它区"
		],
		[
			'code' => "130399",
			'en' => '',
			'cn' => "经济技术开发区"
		]
		]
	],
		[
		'code' => "130400",
		'en' => '',
		'cn' => "邯郸市",
		'children' => [
	[
			'code' => "130402",
			'en' => '',
			'cn' => "邯山区"
		],
		[
			'code' => "130403",
			'en' => '',
			'cn' => "丛台区"
		],
		[
			'code' => "130404",
			'en' => '',
			'cn' => "复兴区"
		],
		[
			'code' => "130406",
			'en' => '',
			'cn' => "峰峰矿区"
		],
		[
			'code' => "130421",
			'en' => '',
			'cn' => "邯郸县"
		],
		[
			'code' => "130423",
			'en' => '',
			'cn' => "临漳县"
		],
		[
			'code' => "130424",
			'en' => '',
			'cn' => "成安县"
		],
		[
			'code' => "130425",
			'en' => '',
			'cn' => "大名县"
		],
		[
			'code' => "130426",
			'en' => '',
			'cn' => "涉县"
		],
		[
			'code' => "130427",
			'en' => '',
			'cn' => "磁县"
		],
		[
			'code' => "130428",
			'en' => '',
			'cn' => "肥乡县"
		],
		[
			'code' => "130429",
			'en' => '',
			'cn' => "永年县"
		],
		[
			'code' => "130430",
			'en' => '',
			'cn' => "邱县"
		],
		[
			'code' => "130431",
			'en' => '',
			'cn' => "鸡泽县"
		],
		[
			'code' => "130432",
			'en' => '',
			'cn' => "广平县"
		],
		[
			'code' => "130433",
			'en' => '',
			'cn' => "馆陶县"
		],
		[
			'code' => "130434",
			'en' => '',
			'cn' => "魏县"
		],
		[
			'code' => "130435",
			'en' => '',
			'cn' => "曲周县"
		],
		[
			'code' => "130481",
			'en' => '',
			'cn' => "武安市"
		],
		[
			'code' => "130482",
			'en' => '',
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130500",
		'cn' => "邢台市",
		'children' => [
	[
			'code' => "130502",
			'cn' => "桥东区"
		],
		[
			'code' => "130503",
			'cn' => "桥西区"
		],
		[
			'code' => "130521",
			'cn' => "邢台县"
		],
		[
			'code' => "130522",
			'cn' => "临城县"
		],
		[
			'code' => "130523",
			'cn' => "内丘县"
		],
		[
			'code' => "130524",
			'cn' => "柏乡县"
		],
		[
			'code' => "130525",
			'cn' => "隆尧县"
		],
		[
			'code' => "130526",
			'cn' => "任县"
		],
		[
			'code' => "130527",
			'cn' => "南和县"
		],
		[
			'code' => "130528",
			'cn' => "宁晋县"
		],
		[
			'code' => "130529",
			'cn' => "巨鹿县"
		],
		[
			'code' => "130530",
			'cn' => "新河县"
		],
		[
			'code' => "130531",
			'cn' => "广宗县"
		],
		[
			'code' => "130532",
			'cn' => "平乡县"
		],
		[
			'code' => "130533",
			'cn' => "威县"
		],
		[
			'code' => "130534",
			'cn' => "清河县"
		],
		[
			'code' => "130535",
			'cn' => "临西县"
		],
		[
			'code' => "130581",
			'cn' => "南宫市"
		],
		[
			'code' => "130582",
			'cn' => "沙河市"
		],
		[
			'code' => "130583",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130600",
		'cn' => "保定市",
		'children' => [
	[
			'code' => "130602",
			'cn' => "新市区"
		],
		[
			'code' => "130603",
			'cn' => "北市区"
		],
		[
			'code' => "130604",
			'cn' => "南市区"
		],
		[
			'code' => "130621",
			'cn' => "满城县"
		],
		[
			'code' => "130622",
			'cn' => "清苑县"
		],
		[
			'code' => "130623",
			'cn' => "涞水县"
		],
		[
			'code' => "130624",
			'cn' => "阜平县"
		],
		[
			'code' => "130625",
			'cn' => "徐水县"
		],
		[
			'code' => "130626",
			'cn' => "定兴县"
		],
		[
			'code' => "130627",
			'cn' => "唐县"
		],
		[
			'code' => "130628",
			'cn' => "高阳县"
		],
		[
			'code' => "130629",
			'cn' => "容城县"
		],
		[
			'code' => "130630",
			'cn' => "涞源县"
		],
		[
			'code' => "130631",
			'cn' => "望都县"
		],
		[
			'code' => "130632",
			'cn' => "安新县"
		],
		[
			'code' => "130633",
			'cn' => "易县"
		],
		[
			'code' => "130634",
			'cn' => "曲阳县"
		],
		[
			'code' => "130635",
			'cn' => "蠡县"
		],
		[
			'code' => "130636",
			'cn' => "顺平县"
		],
		[
			'code' => "130637",
			'cn' => "博野县"
		],
		[
			'code' => "130638",
			'cn' => "雄县"
		],
		[
			'code' => "130681",
			'cn' => "涿州市"
		],
		[
			'code' => "130682",
			'cn' => "定州市"
		],
		[
			'code' => "130683",
			'cn' => "安国市"
		],
		[
			'code' => "130684",
			'cn' => "高碑店市"
		],
		[
			'code' => "130698",
			'cn' => "高开区"
		],
		[
			'code' => "130699",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130700",
		'cn' => "张家口市",
		'children' => [
	[
			'code' => "130702",
			'cn' => "桥东区"
		],
		[
			'code' => "130703",
			'cn' => "桥西区"
		],
		[
			'code' => "130705",
			'cn' => "宣化区"
		],
		[
			'code' => "130706",
			'cn' => "下花园区"
		],
		[
			'code' => "130721",
			'cn' => "宣化县"
		],
		[
			'code' => "130722",
			'cn' => "张北县"
		],
		[
			'code' => "130723",
			'cn' => "康保县"
		],
		[
			'code' => "130724",
			'cn' => "沽源县"
		],
		[
			'code' => "130725",
			'cn' => "尚义县"
		],
		[
			'code' => "130726",
			'cn' => "蔚县"
		],
		[
			'code' => "130727",
			'cn' => "阳原县"
		],
		[
			'code' => "130728",
			'cn' => "怀安县"
		],
		[
			'code' => "130729",
			'cn' => "万全县"
		],
		[
			'code' => "130730",
			'cn' => "怀来县"
		],
		[
			'code' => "130731",
			'cn' => "涿鹿县"
		],
		[
			'code' => "130732",
			'cn' => "赤城县"
		],
		[
			'code' => "130733",
			'cn' => "崇礼县"
		],
		[
			'code' => "130734",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130800",
		'cn' => "承德市",
		'children' => [
	[
			'code' => "130802",
			'cn' => "双桥区"
		],
		[
			'code' => "130803",
			'cn' => "双滦区"
		],
		[
			'code' => "130804",
			'cn' => "鹰手营子矿区"
		],
		[
			'code' => "130821",
			'cn' => "承德县"
		],
		[
			'code' => "130822",
			'cn' => "兴隆县"
		],
		[
			'code' => "130823",
			'cn' => "平泉县"
		],
		[
			'code' => "130824",
			'cn' => "滦平县"
		],
		[
			'code' => "130825",
			'cn' => "隆化县"
		],
		[
			'code' => "130826",
			'cn' => "丰宁满族自治县"
		],
		[
			'code' => "130827",
			'cn' => "宽城满族自治县"
		],
		[
			'code' => "130828",
			'cn' => "围场满族蒙古族自治县"
		],
		[
			'code' => "130829",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "130900",
		'cn' => "沧州市",
		'children' => [
	[
			'code' => "130902",
			'cn' => "新华区"
		],
		[
			'code' => "130903",
			'cn' => "运河区"
		],
		[
			'code' => "130921",
			'cn' => "沧县"
		],
		[
			'code' => "130922",
			'cn' => "青县"
		],
		[
			'code' => "130923",
			'cn' => "东光县"
		],
		[
			'code' => "130924",
			'cn' => "海兴县"
		],
		[
			'code' => "130925",
			'cn' => "盐山县"
		],
		[
			'code' => "130926",
			'cn' => "肃宁县"
		],
		[
			'code' => "130927",
			'cn' => "南皮县"
		],
		[
			'code' => "130928",
			'cn' => "吴桥县"
		],
		[
			'code' => "130929",
			'cn' => "献县"
		],
		[
			'code' => "130930",
			'cn' => "孟村回族自治县"
		],
		[
			'code' => "130981",
			'cn' => "泊头市"
		],
		[
			'code' => "130982",
			'cn' => "任丘市"
		],
		[
			'code' => "130983",
			'cn' => "黄骅市"
		],
		[
			'code' => "130984",
			'cn' => "河间市"
		],
		[
			'code' => "130985",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "131000",
		'cn' => "廊坊市",
		'children' => [
	[
			'code' => "131002",
			'cn' => "安次区"
		],
		[
			'code' => "131003",
			'cn' => "广阳区"
		],
		[
			'code' => "131022",
			'cn' => "固安县"
		],
		[
			'code' => "131023",
			'cn' => "永清县"
		],
		[
			'code' => "131024",
			'cn' => "香河县"
		],
		[
			'code' => "131025",
			'cn' => "大城县"
		],
		[
			'code' => "131026",
			'cn' => "文安县"
		],
		[
			'code' => "131028",
			'cn' => "大厂回族自治县"
		],
		[
			'code' => "131051",
			'cn' => "开发区"
		],
		[
			'code' => "131052",
			'cn' => "燕郊经济技术开发区"
		],
		[
			'code' => "131081",
			'cn' => "霸州市"
		],
		[
			'code' => "131082",
			'cn' => "三河市"
		],
		[
			'code' => "131083",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "131100",
		'cn' => "衡水市",
		'children' => [
	[
			'code' => "131102",
			'cn' => "桃城区"
		],
		[
			'code' => "131121",
			'cn' => "枣强县"
		],
		[
			'code' => "131122",
			'cn' => "武邑县"
		],
		[
			'code' => "131123",
			'cn' => "武强县"
		],
		[
			'code' => "131124",
			'cn' => "饶阳县"
		],
		[
			'code' => "131125",
			'cn' => "安平县"
		],
		[
			'code' => "131126",
			'cn' => "故城县"
		],
		[
			'code' => "131127",
			'cn' => "景县"
		],
		[
			'code' => "131128",
			'cn' => "阜城县"
		],
		[
			'code' => "131181",
			'cn' => "冀州市"
		],
		[
			'code' => "131182",
			'cn' => "深州市"
		],
		[
			'code' => "131183",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '140000',
	'cn' => '山西省',
	'children' => [
	[
		'code' => "140100",
		'cn' => "太原市",
		'children' => [
	[
			'code' => "140105",
			'cn' => "小店区"
		],
		[
			'code' => "140106",
			'cn' => "迎泽区"
		],
		[
			'code' => "140107",
			'cn' => "杏花岭区"
		],
		[
			'code' => "140108",
			'cn' => "尖草坪区"
		],
		[
			'code' => "140109",
			'cn' => "万柏林区"
		],
		[
			'code' => "140110",
			'cn' => "晋源区"
		],
		[
			'code' => "140121",
			'cn' => "清徐县"
		],
		[
			'code' => "140122",
			'cn' => "阳曲县"
		],
		[
			'code' => "140123",
			'cn' => "娄烦县"
		],
		[
			'code' => "140181",
			'cn' => "古交市"
		],
		[
			'code' => "140182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140200",
		'cn' => "大同市",
		'children' => [
	[
			'code' => "140202",
			'cn' => "城区"
		],
		[
			'code' => "140203",
			'cn' => "矿区"
		],
		[
			'code' => "140211",
			'cn' => "南郊区"
		],
		[
			'code' => "140212",
			'cn' => "新荣区"
		],
		[
			'code' => "140221",
			'cn' => "阳高县"
		],
		[
			'code' => "140222",
			'cn' => "天镇县"
		],
		[
			'code' => "140223",
			'cn' => "广灵县"
		],
		[
			'code' => "140224",
			'cn' => "灵丘县"
		],
		[
			'code' => "140225",
			'cn' => "浑源县"
		],
		[
			'code' => "140226",
			'cn' => "左云县"
		],
		[
			'code' => "140227",
			'cn' => "大同县"
		],
		[
			'code' => "140228",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140300",
		'cn' => "阳泉市",
		'children' => [
	[
			'code' => "140302",
			'cn' => "城区"
		],
		[
			'code' => "140303",
			'cn' => "矿区"
		],
		[
			'code' => "140311",
			'cn' => "郊区"
		],
		[
			'code' => "140321",
			'cn' => "平定县"
		],
		[
			'code' => "140322",
			'cn' => "盂县"
		],
		[
			'code' => "140323",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140400",
		'cn' => "长治市",
		'children' => [
	[
			'code' => "140421",
			'cn' => "长治县"
		],
		[
			'code' => "140423",
			'cn' => "襄垣县"
		],
		[
			'code' => "140424",
			'cn' => "屯留县"
		],
		[
			'code' => "140425",
			'cn' => "平顺县"
		],
		[
			'code' => "140426",
			'cn' => "黎城县"
		],
		[
			'code' => "140427",
			'cn' => "壶关县"
		],
		[
			'code' => "140428",
			'cn' => "长子县"
		],
		[
			'code' => "140429",
			'cn' => "武乡县"
		],
		[
			'code' => "140430",
			'cn' => "沁县"
		],
		[
			'code' => "140431",
			'cn' => "沁源县"
		],
		[
			'code' => "140481",
			'cn' => "潞城市"
		],
		[
			'code' => "140482",
			'cn' => "城区"
		],
		[
			'code' => "140483",
			'cn' => "郊区"
		],
		[
			'code' => "140484",
			'cn' => "高新区"
		],
		[
			'code' => "140485",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140500",
		'cn' => "晋城市",
		'children' => [
	[
			'code' => "140502",
			'cn' => "城区"
		],
		[
			'code' => "140521",
			'cn' => "沁水县"
		],
		[
			'code' => "140522",
			'cn' => "阳城县"
		],
		[
			'code' => "140524",
			'cn' => "陵川县"
		],
		[
			'code' => "140525",
			'cn' => "泽州县"
		],
		[
			'code' => "140581",
			'cn' => "高平市"
		],
		[
			'code' => "140582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140600",
		'cn' => "朔州市",
		'children' => [
	[
			'code' => "140602",
			'cn' => "朔城区"
		],
		[
			'code' => "140603",
			'cn' => "平鲁区"
		],
		[
			'code' => "140621",
			'cn' => "山阴县"
		],
		[
			'code' => "140622",
			'cn' => "应县"
		],
		[
			'code' => "140623",
			'cn' => "右玉县"
		],
		[
			'code' => "140624",
			'cn' => "怀仁县"
		],
		[
			'code' => "140625",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140700",
		'cn' => "晋中市",
		'children' => [
	[
			'code' => "140702",
			'cn' => "榆次区"
		],
		[
			'code' => "140721",
			'cn' => "榆社县"
		],
		[
			'code' => "140722",
			'cn' => "左权县"
		],
		[
			'code' => "140723",
			'cn' => "和顺县"
		],
		[
			'code' => "140724",
			'cn' => "昔阳县"
		],
		[
			'code' => "140725",
			'cn' => "寿阳县"
		],
		[
			'code' => "140726",
			'cn' => "太谷县"
		],
		[
			'code' => "140727",
			'cn' => "祁县"
		],
		[
			'code' => "140728",
			'cn' => "平遥县"
		],
		[
			'code' => "140729",
			'cn' => "灵石县"
		],
		[
			'code' => "140781",
			'cn' => "介休市"
		],
		[
			'code' => "140782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140800",
		'cn' => "运城市",
		'children' => [
	[
			'code' => "140802",
			'cn' => "盐湖区"
		],
		[
			'code' => "140821",
			'cn' => "临猗县"
		],
		[
			'code' => "140822",
			'cn' => "万荣县"
		],
		[
			'code' => "140823",
			'cn' => "闻喜县"
		],
		[
			'code' => "140824",
			'cn' => "稷山县"
		],
		[
			'code' => "140825",
			'cn' => "新绛县"
		],
		[
			'code' => "140826",
			'cn' => "绛县"
		],
		[
			'code' => "140827",
			'cn' => "垣曲县"
		],
		[
			'code' => "140828",
			'cn' => "夏县"
		],
		[
			'code' => "140829",
			'cn' => "平陆县"
		],
		[
			'code' => "140830",
			'cn' => "芮城县"
		],
		[
			'code' => "140881",
			'cn' => "永济市"
		],
		[
			'code' => "140882",
			'cn' => "河津市"
		],
		[
			'code' => "140883",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "140900",
		'cn' => "忻州市",
		'children' => [
	[
			'code' => "140902",
			'cn' => "忻府区"
		],
		[
			'code' => "140921",
			'cn' => "定襄县"
		],
		[
			'code' => "140922",
			'cn' => "五台县"
		],
		[
			'code' => "140923",
			'cn' => "代县"
		],
		[
			'code' => "140924",
			'cn' => "繁峙县"
		],
		[
			'code' => "140925",
			'cn' => "宁武县"
		],
		[
			'code' => "140926",
			'cn' => "静乐县"
		],
		[
			'code' => "140927",
			'cn' => "神池县"
		],
		[
			'code' => "140928",
			'cn' => "五寨县"
		],
		[
			'code' => "140929",
			'cn' => "岢岚县"
		],
		[
			'code' => "140930",
			'cn' => "河曲县"
		],
		[
			'code' => "140931",
			'cn' => "保德县"
		],
		[
			'code' => "140932",
			'cn' => "偏关县"
		],
		[
			'code' => "140981",
			'cn' => "原平市"
		],
		[
			'code' => "140982",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "141000",
		'cn' => "临汾市",
		'children' => [
	[
			'code' => "141002",
			'cn' => "尧都区"
		],
		[
			'code' => "141021",
			'cn' => "曲沃县"
		],
		[
			'code' => "141022",
			'cn' => "翼城县"
		],
		[
			'code' => "141023",
			'cn' => "襄汾县"
		],
		[
			'code' => "141024",
			'cn' => "洪洞县"
		],
		[
			'code' => "141025",
			'cn' => "古县"
		],
		[
			'code' => "141026",
			'cn' => "安泽县"
		],
		[
			'code' => "141027",
			'cn' => "浮山县"
		],
		[
			'code' => "141028",
			'cn' => "吉县"
		],
		[
			'code' => "141029",
			'cn' => "乡宁县"
		],
		[
			'code' => "141030",
			'cn' => "大宁县"
		],
		[
			'code' => "141031",
			'cn' => "隰县"
		],
		[
			'code' => "141032",
			'cn' => "永和县"
		],
		[
			'code' => "141033",
			'cn' => "蒲县"
		],
		[
			'code' => "141034",
			'cn' => "汾西县"
		],
		[
			'code' => "141081",
			'cn' => "侯马市"
		],
		[
			'code' => "141082",
			'cn' => "霍州市"
		],
		[
			'code' => "141083",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "141100",
		'cn' => "吕梁市",
		'children' => [
	[
			'code' => "141102",
			'cn' => "离石区"
		],
		[
			'code' => "141121",
			'cn' => "文水县"
		],
		[
			'code' => "141122",
			'cn' => "交城县"
		],
		[
			'code' => "141123",
			'cn' => "兴县"
		],
		[
			'code' => "141124",
			'cn' => "临县"
		],
		[
			'code' => "141125",
			'cn' => "柳林县"
		],
		[
			'code' => "141126",
			'cn' => "石楼县"
		],
		[
			'code' => "141127",
			'cn' => "岚县"
		],
		[
			'code' => "141128",
			'cn' => "方山县"
		],
		[
			'code' => "141129",
			'cn' => "中阳县"
		],
		[
			'code' => "141130",
			'cn' => "交口县"
		],
		[
			'code' => "141181",
			'cn' => "孝义市"
		],
		[
			'code' => "141182",
			'cn' => "汾阳市"
		],
		[
			'code' => "141183",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '150000',
	'cn' => '内蒙古',
	'children' => [
	[
		'code' => "150100",
		'cn' => "呼和浩特市",
		'children' => [
	[
			'code' => "150102",
			'cn' => "新城区"
		],
		[
			'code' => "150103",
			'cn' => "回民区"
		],
		[
			'code' => "150104",
			'cn' => "玉泉区"
		],
		[
			'code' => "150105",
			'cn' => "赛罕区"
		],
		[
			'code' => "150121",
			'cn' => "土默特左旗"
		],
		[
			'code' => "150122",
			'cn' => "托克托县"
		],
		[
			'code' => "150123",
			'cn' => "和林格尔县"
		],
		[
			'code' => "150124",
			'cn' => "清水河县"
		],
		[
			'code' => "150125",
			'cn' => "武川县"
		],
		[
			'code' => "150126",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150200",
		'cn' => "包头市",
		'children' => [
	[
			'code' => "150202",
			'cn' => "东河区"
		],
		[
			'code' => "150203",
			'cn' => "昆都仑区"
		],
		[
			'code' => "150204",
			'cn' => "青山区"
		],
		[
			'code' => "150205",
			'cn' => "石拐区"
		],
		[
			'code' => "150206",
			'cn' => "白云矿区"
		],
		[
			'code' => "150207",
			'cn' => "九原区"
		],
		[
			'code' => "150221",
			'cn' => "土默特右旗"
		],
		[
			'code' => "150222",
			'cn' => "固阳县"
		],
		[
			'code' => "150223",
			'cn' => "达尔罕茂明安联合旗"
		],
		[
			'code' => "150224",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150300",
		'cn' => "乌海市",
		'children' => [
	[
			'code' => "150302",
			'cn' => "海勃湾区"
		],
		[
			'code' => "150303",
			'cn' => "海南区"
		],
		[
			'code' => "150304",
			'cn' => "乌达区"
		],
		[
			'code' => "150305",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150400",
		'cn' => "赤峰市",
		'children' => [
	[
			'code' => "150402",
			'cn' => "红山区"
		],
		[
			'code' => "150403",
			'cn' => "元宝山区"
		],
		[
			'code' => "150404",
			'cn' => "松山区"
		],
		[
			'code' => "150421",
			'cn' => "阿鲁科尔沁旗"
		],
		[
			'code' => "150422",
			'cn' => "巴林左旗"
		],
		[
			'code' => "150423",
			'cn' => "巴林右旗"
		],
		[
			'code' => "150424",
			'cn' => "林西县"
		],
		[
			'code' => "150425",
			'cn' => "克什克腾旗"
		],
		[
			'code' => "150426",
			'cn' => "翁牛特旗"
		],
		[
			'code' => "150428",
			'cn' => "喀喇沁旗"
		],
		[
			'code' => "150429",
			'cn' => "宁城县"
		],
		[
			'code' => "150430",
			'cn' => "敖汉旗"
		],
		[
			'code' => "150431",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150500",
		'cn' => "通辽市",
		'children' => [
	[
			'code' => "150502",
			'cn' => "科尔沁区"
		],
		[
			'code' => "150521",
			'cn' => "科尔沁左翼中旗"
		],
		[
			'code' => "150522",
			'cn' => "科尔沁左翼后旗"
		],
		[
			'code' => "150523",
			'cn' => "开鲁县"
		],
		[
			'code' => "150524",
			'cn' => "库伦旗"
		],
		[
			'code' => "150525",
			'cn' => "奈曼旗"
		],
		[
			'code' => "150526",
			'cn' => "扎鲁特旗"
		],
		[
			'code' => "150581",
			'cn' => "霍林郭勒市"
		],
		[
			'code' => "150582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150600",
		'cn' => "鄂尔多斯市",
		'children' => [
	[
			'code' => "150602",
			'cn' => "东胜区"
		],
		[
			'code' => "150621",
			'cn' => "达拉特旗"
		],
		[
			'code' => "150622",
			'cn' => "准格尔旗"
		],
		[
			'code' => "150623",
			'cn' => "鄂托克前旗"
		],
		[
			'code' => "150624",
			'cn' => "鄂托克旗"
		],
		[
			'code' => "150625",
			'cn' => "杭锦旗"
		],
		[
			'code' => "150626",
			'cn' => "乌审旗"
		],
		[
			'code' => "150627",
			'cn' => "伊金霍洛旗"
		],
		[
			'code' => "150628",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150700",
		'cn' => "呼伦贝尔市",
		'children' => [
	[
			'code' => "150702",
			'cn' => "海拉尔区"
		],
		[
			'code' => "150721",
			'cn' => "阿荣旗"
		],
		[
			'code' => "150722",
			'cn' => "莫力达瓦达斡尔族自治旗"
		],
		[
			'code' => "150723",
			'cn' => "鄂伦春自治旗"
		],
		[
			'code' => "150724",
			'cn' => "鄂温克族自治旗"
		],
		[
			'code' => "150725",
			'cn' => "陈巴尔虎旗"
		],
		[
			'code' => "150726",
			'cn' => "新巴尔虎左旗"
		],
		[
			'code' => "150727",
			'cn' => "新巴尔虎右旗"
		],
		[
			'code' => "150781",
			'cn' => "满洲里市"
		],
		[
			'code' => "150782",
			'cn' => "牙克石市"
		],
		[
			'code' => "150783",
			'cn' => "扎兰屯市"
		],
		[
			'code' => "150784",
			'cn' => "额尔古纳市"
		],
		[
			'code' => "150785",
			'cn' => "根河市"
		],
		[
			'code' => "150786",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150800",
		'cn' => "巴彦淖尔市",
		'children' => [
	[
			'code' => "150802",
			'cn' => "临河区"
		],
		[
			'code' => "150821",
			'cn' => "五原县"
		],
		[
			'code' => "150822",
			'cn' => "磴口县"
		],
		[
			'code' => "150823",
			'cn' => "乌拉特前旗"
		],
		[
			'code' => "150824",
			'cn' => "乌拉特中旗"
		],
		[
			'code' => "150825",
			'cn' => "乌拉特后旗"
		],
		[
			'code' => "150826",
			'cn' => "杭锦后旗"
		],
		[
			'code' => "150827",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "150900",
		'cn' => "乌兰察布市",
		'children' => [
	[
			'code' => "150902",
			'cn' => "集宁区"
		],
		[
			'code' => "150921",
			'cn' => "卓资县"
		],
		[
			'code' => "150922",
			'cn' => "化德县"
		],
		[
			'code' => "150923",
			'cn' => "商都县"
		],
		[
			'code' => "150924",
			'cn' => "兴和县"
		],
		[
			'code' => "150925",
			'cn' => "凉城县"
		],
		[
			'code' => "150926",
			'cn' => "察哈尔右翼前旗"
		],
		[
			'code' => "150927",
			'cn' => "察哈尔右翼中旗"
		],
		[
			'code' => "150928",
			'cn' => "察哈尔右翼后旗"
		],
		[
			'code' => "150929",
			'cn' => "四子王旗"
		],
		[
			'code' => "150981",
			'cn' => "丰镇市"
		],
		[
			'code' => "150982",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "152200",
		'cn' => "兴安盟",
		'children' => [
	[
			'code' => "152201",
			'cn' => "乌兰浩特市"
		],
		[
			'code' => "152202",
			'cn' => "阿尔山市"
		],
		[
			'code' => "152221",
			'cn' => "科尔沁右翼前旗"
		],
		[
			'code' => "152222",
			'cn' => "科尔沁右翼中旗"
		],
		[
			'code' => "152223",
			'cn' => "扎赉特旗"
		],
		[
			'code' => "152224",
			'cn' => "突泉县"
		],
		[
			'code' => "152225",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "152500",
		'cn' => "锡林郭勒盟",
		'children' => [
	[
			'code' => "152501",
			'cn' => "二连浩特市"
		],
		[
			'code' => "152502",
			'cn' => "锡林浩特市"
		],
		[
			'code' => "152522",
			'cn' => "阿巴嘎旗"
		],
		[
			'code' => "152523",
			'cn' => "苏尼特左旗"
		],
		[
			'code' => "152524",
			'cn' => "苏尼特右旗"
		],
		[
			'code' => "152525",
			'cn' => "东乌珠穆沁旗"
		],
		[
			'code' => "152526",
			'cn' => "西乌珠穆沁旗"
		],
		[
			'code' => "152527",
			'cn' => "太仆寺旗"
		],
		[
			'code' => "152528",
			'cn' => "镶黄旗"
		],
		[
			'code' => "152529",
			'cn' => "正镶白旗"
		],
		[
			'code' => "152530",
			'cn' => "正蓝旗"
		],
		[
			'code' => "152531",
			'cn' => "多伦县"
		],
		[
			'code' => "152532",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "152900",
		'cn' => "阿拉善盟",
		'children' => [
	[
			'code' => "152921",
			'cn' => "阿拉善左旗"
		],
		[
			'code' => "152922",
			'cn' => "阿拉善右旗"
		],
		[
			'code' => "152923",
			'cn' => "额济纳旗"
		],
		[
			'code' => "152924",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '210000',
	'cn' => '辽宁省',
	'children' => [
	[
		'code' => "210100",
		'cn' => "沈阳市",
		'children' => [
	[
			'code' => "210102",
			'cn' => "和平区"
		],
		[
			'code' => "210103",
			'cn' => "沈河区"
		],
		[
			'code' => "210104",
			'cn' => "大东区"
		],
		[
			'code' => "210105",
			'cn' => "皇姑区"
		],
		[
			'code' => "210106",
			'cn' => "铁西区"
		],
		[
			'code' => "210111",
			'cn' => "苏家屯区"
		],
		[
			'code' => "210112",
			'cn' => "东陵区"
		],
		[
			'code' => "210113",
			'cn' => "新城子区"
		],
		[
			'code' => "210114",
			'cn' => "于洪区"
		],
		[
			'code' => "210122",
			'cn' => "辽中县"
		],
		[
			'code' => "210123",
			'cn' => "康平县"
		],
		[
			'code' => "210124",
			'cn' => "法库县"
		],
		[
			'code' => "210181",
			'cn' => "新民市"
		],
		[
			'code' => "210182",
			'cn' => "浑南新区"
		],
		[
			'code' => "210183",
			'cn' => "张士开发区"
		],
		[
			'code' => "210184",
			'cn' => "沈北新区"
		],
		[
			'code' => "210185",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210200",
		'cn' => "大连市",
		'children' => [
	[
			'code' => "210202",
			'cn' => "中山区"
		],
		[
			'code' => "210203",
			'cn' => "西岗区"
		],
		[
			'code' => "210204",
			'cn' => "沙河口区"
		],
		[
			'code' => "210211",
			'cn' => "甘井子区"
		],
		[
			'code' => "210212",
			'cn' => "旅顺口区"
		],
		[
			'code' => "210213",
			'cn' => "金州区"
		],
		[
			'code' => "210224",
			'cn' => "长海县"
		],
		[
			'code' => "210251",
			'cn' => "开发区"
		],
		[
			'code' => "210281",
			'cn' => "瓦房店市"
		],
		[
			'code' => "210282",
			'cn' => "普兰店市"
		],
		[
			'code' => "210283",
			'cn' => "庄河市"
		],
		[
			'code' => "210297",
			'cn' => "岭前区"
		],
		[
			'code' => "210298",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210300",
		'cn' => "鞍山市",
		'children' => [
	[
			'code' => "210302",
			'cn' => "铁东区"
		],
		[
			'code' => "210303",
			'cn' => "铁西区"
		],
		[
			'code' => "210304",
			'cn' => "立山区"
		],
		[
			'code' => "210311",
			'cn' => "千山区"
		],
		[
			'code' => "210321",
			'cn' => "台安县"
		],
		[
			'code' => "210323",
			'cn' => "岫岩满族自治县"
		],
		[
			'code' => "210351",
			'cn' => "高新区"
		],
		[
			'code' => "210381",
			'cn' => "海城市"
		],
		[
			'code' => "210382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210400",
		'cn' => "抚顺市",
		'children' => [
	[
			'code' => "210402",
			'cn' => "新抚区"
		],
		[
			'code' => "210403",
			'cn' => "东洲区"
		],
		[
			'code' => "210404",
			'cn' => "望花区"
		],
		[
			'code' => "210411",
			'cn' => "顺城区"
		],
		[
			'code' => "210421",
			'cn' => "抚顺县"
		],
		[
			'code' => "210422",
			'cn' => "新宾满族自治县"
		],
		[
			'code' => "210423",
			'cn' => "清原满族自治县"
		],
		[
			'code' => "210424",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210500",
		'cn' => "本溪市",
		'children' => [
	[
			'code' => "210502",
			'cn' => "平山区"
		],
		[
			'code' => "210503",
			'cn' => "溪湖区"
		],
		[
			'code' => "210504",
			'cn' => "明山区"
		],
		[
			'code' => "210505",
			'cn' => "南芬区"
		],
		[
			'code' => "210521",
			'cn' => "本溪满族自治县"
		],
		[
			'code' => "210522",
			'cn' => "桓仁满族自治县"
		],
		[
			'code' => "210523",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210600",
		'cn' => "丹东市",
		'children' => [
	[
			'code' => "210602",
			'cn' => "元宝区"
		],
		[
			'code' => "210603",
			'cn' => "振兴区"
		],
		[
			'code' => "210604",
			'cn' => "振安区"
		],
		[
			'code' => "210624",
			'cn' => "宽甸满族自治县"
		],
		[
			'code' => "210681",
			'cn' => "东港市"
		],
		[
			'code' => "210682",
			'cn' => "凤城市"
		],
		[
			'code' => "210683",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210700",
		'cn' => "锦州市",
		'children' => [
	[
			'code' => "210702",
			'cn' => "古塔区"
		],
		[
			'code' => "210703",
			'cn' => "凌河区"
		],
		[
			'code' => "210711",
			'cn' => "太和区"
		],
		[
			'code' => "210726",
			'cn' => "黑山县"
		],
		[
			'code' => "210727",
			'cn' => "义县"
		],
		[
			'code' => "210781",
			'cn' => "凌海市"
		],
		[
			'code' => "210782",
			'cn' => "北镇市"
		],
		[
			'code' => "210783",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210800",
		'cn' => "营口市",
		'children' => [
	[
			'code' => "210802",
			'cn' => "站前区"
		],
		[
			'code' => "210803",
			'cn' => "西市区"
		],
		[
			'code' => "210804",
			'cn' => "鲅鱼圈区"
		],
		[
			'code' => "210811",
			'cn' => "老边区"
		],
		[
			'code' => "210881",
			'cn' => "盖州市"
		],
		[
			'code' => "210882",
			'cn' => "大石桥市"
		],
		[
			'code' => "210883",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "210900",
		'cn' => "阜新市",
		'children' => [
	[
			'code' => "210902",
			'cn' => "海州区"
		],
		[
			'code' => "210903",
			'cn' => "新邱区"
		],
		[
			'code' => "210904",
			'cn' => "太平区"
		],
		[
			'code' => "210905",
			'cn' => "清河门区"
		],
		[
			'code' => "210911",
			'cn' => "细河区"
		],
		[
			'code' => "210921",
			'cn' => "阜新蒙古族自治县"
		],
		[
			'code' => "210922",
			'cn' => "彰武县"
		],
		[
			'code' => "210923",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "211000",
		'cn' => "辽阳市",
		'children' => [
	[
			'code' => "211002",
			'cn' => "白塔区"
		],
		[
			'code' => "211003",
			'cn' => "文圣区"
		],
		[
			'code' => "211004",
			'cn' => "宏伟区"
		],
		[
			'code' => "211005",
			'cn' => "弓长岭区"
		],
		[
			'code' => "211011",
			'cn' => "太子河区"
		],
		[
			'code' => "211021",
			'cn' => "辽阳县"
		],
		[
			'code' => "211081",
			'cn' => "灯塔市"
		],
		[
			'code' => "211082",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "211100",
		'cn' => "盘锦市",
		'children' => [
	[
			'code' => "211102",
			'cn' => "双台子区"
		],
		[
			'code' => "211103",
			'cn' => "兴隆台区"
		],
		[
			'code' => "211121",
			'cn' => "大洼县"
		],
		[
			'code' => "211122",
			'cn' => "盘山县"
		],
		[
			'code' => "211123",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "211200",
		'cn' => "铁岭市",
		'children' => [
	[
			'code' => "211202",
			'cn' => "银州区"
		],
		[
			'code' => "211204",
			'cn' => "清河区"
		],
		[
			'code' => "211221",
			'cn' => "铁岭县"
		],
		[
			'code' => "211223",
			'cn' => "西丰县"
		],
		[
			'code' => "211224",
			'cn' => "昌图县"
		],
		[
			'code' => "211281",
			'cn' => "调兵山市"
		],
		[
			'code' => "211282",
			'cn' => "开原市"
		],
		[
			'code' => "211283",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "211300",
		'cn' => "朝阳市",
		'children' => [
	[
			'code' => "211302",
			'cn' => "双塔区"
		],
		[
			'code' => "211303",
			'cn' => "龙城区"
		],
		[
			'code' => "211321",
			'cn' => "朝阳县"
		],
		[
			'code' => "211322",
			'cn' => "建平县"
		],
		[
			'code' => "211324",
			'cn' => "喀喇沁左翼蒙古族自治县"
		],
		[
			'code' => "211381",
			'cn' => "北票市"
		],
		[
			'code' => "211382",
			'cn' => "凌源市"
		],
		[
			'code' => "211383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "211400",
		'cn' => "葫芦岛市",
		'children' => [
	[
			'code' => "211402",
			'cn' => "连山区"
		],
		[
			'code' => "211403",
			'cn' => "龙港区"
		],
		[
			'code' => "211404",
			'cn' => "南票区"
		],
		[
			'code' => "211421",
			'cn' => "绥中县"
		],
		[
			'code' => "211422",
			'cn' => "建昌县"
		],
		[
			'code' => "211481",
			'cn' => "兴城市"
		],
		[
			'code' => "211482",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '220000',
	'cn' => '吉林省',
	'children' => [
	[
		'code' => "220100",
		'cn' => "长春市",
		'children' => [
	[
			'code' => "220102",
			'cn' => "南关区"
		],
		[
			'code' => "220103",
			'cn' => "宽城区"
		],
		[
			'code' => "220104",
			'cn' => "朝阳区"
		],
		[
			'code' => "220105",
			'cn' => "二道区"
		],
		[
			'code' => "220106",
			'cn' => "绿园区"
		],
		[
			'code' => "220112",
			'cn' => "双阳区"
		],
		[
			'code' => "220122",
			'cn' => "农安县"
		],
		[
			'code' => "220181",
			'cn' => "九台市"
		],
		[
			'code' => "220182",
			'cn' => "榆树市"
		],
		[
			'code' => "220183",
			'cn' => "德惠市"
		],
		[
			'code' => "220184",
			'cn' => "高新技术产业开发区"
		],
		[
			'code' => "220185",
			'cn' => "汽车产业开发区"
		],
		[
			'code' => "220186",
			'cn' => "经济技术开发区"
		],
		[
			'code' => "220187",
			'cn' => "净月旅游开发区"
		],
		[
			'code' => "220188",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220200",
		'cn' => "吉林市",
		'children' => [
	[
			'code' => "220202",
			'cn' => "昌邑区"
		],
		[
			'code' => "220203",
			'cn' => "龙潭区"
		],
		[
			'code' => "220204",
			'cn' => "船营区"
		],
		[
			'code' => "220211",
			'cn' => "丰满区"
		],
		[
			'code' => "220221",
			'cn' => "永吉县"
		],
		[
			'code' => "220281",
			'cn' => "蛟河市"
		],
		[
			'code' => "220282",
			'cn' => "桦甸市"
		],
		[
			'code' => "220283",
			'cn' => "舒兰市"
		],
		[
			'code' => "220284",
			'cn' => "磐石市"
		],
		[
			'code' => "220285",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220300",
		'cn' => "四平市",
		'children' => [
	[
			'code' => "220302",
			'cn' => "铁西区"
		],
		[
			'code' => "220303",
			'cn' => "铁东区"
		],
		[
			'code' => "220322",
			'cn' => "梨树县"
		],
		[
			'code' => "220323",
			'cn' => "伊通满族自治县"
		],
		[
			'code' => "220381",
			'cn' => "公主岭市"
		],
		[
			'code' => "220382",
			'cn' => "双辽市"
		],
		[
			'code' => "220383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220400",
		'cn' => "辽源市",
		'children' => [
	[
			'code' => "220402",
			'cn' => "龙山区"
		],
		[
			'code' => "220403",
			'cn' => "西安区"
		],
		[
			'code' => "220421",
			'cn' => "东丰县"
		],
		[
			'code' => "220422",
			'cn' => "东辽县"
		],
		[
			'code' => "220423",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220500",
		'cn' => "通化市",
		'children' => [
	[
			'code' => "220502",
			'cn' => "东昌区"
		],
		[
			'code' => "220503",
			'cn' => "二道江区"
		],
		[
			'code' => "220521",
			'cn' => "通化县"
		],
		[
			'code' => "220523",
			'cn' => "辉南县"
		],
		[
			'code' => "220524",
			'cn' => "柳河县"
		],
		[
			'code' => "220581",
			'cn' => "梅河口市"
		],
		[
			'code' => "220582",
			'cn' => "集安市"
		],
		[
			'code' => "220583",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220600",
		'cn' => "白山市",
		'children' => [
	[
			'code' => "220602",
			'cn' => "八道江区"
		],
		[
			'code' => "220621",
			'cn' => "抚松县"
		],
		[
			'code' => "220622",
			'cn' => "靖宇县"
		],
		[
			'code' => "220623",
			'cn' => "长白朝鲜族自治县"
		],
		[
			'code' => "220625",
			'cn' => "江源市"
		],
		[
			'code' => "220681",
			'cn' => "临江市"
		],
		[
			'code' => "220682",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220700",
		'cn' => "松原市",
		'children' => [
	[
			'code' => "220702",
			'cn' => "宁江区"
		],
		[
			'code' => "220721",
			'cn' => "前郭尔罗斯蒙古族自治县"
		],
		[
			'code' => "220722",
			'cn' => "长岭县"
		],
		[
			'code' => "220723",
			'cn' => "乾安县"
		],
		[
			'code' => "220724",
			'cn' => "扶余县"
		],
		[
			'code' => "220725",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "220800",
		'cn' => "白城市",
		'children' => [
	[
			'code' => "220802",
			'cn' => "洮北区"
		],
		[
			'code' => "220821",
			'cn' => "镇赉县"
		],
		[
			'code' => "220822",
			'cn' => "通榆县"
		],
		[
			'code' => "220881",
			'cn' => "洮南市"
		],
		[
			'code' => "220882",
			'cn' => "大安市"
		],
		[
			'code' => "220883",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "222400",
		'cn' => "延边朝鲜族自治州",
		'children' => [
	[
			'code' => "222401",
			'cn' => "延吉市"
		],
		[
			'code' => "222402",
			'cn' => "图们市"
		],
		[
			'code' => "222403",
			'cn' => "敦化市"
		],
		[
			'code' => "222404",
			'cn' => "珲春市"
		],
		[
			'code' => "222405",
			'cn' => "龙井市"
		],
		[
			'code' => "222406",
			'cn' => "和龙市"
		],
		[
			'code' => "222424",
			'cn' => "汪清县"
		],
		[
			'code' => "222426",
			'cn' => "安图县"
		],
		[
			'code' => "222427",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '230000',
	'cn' => '黑龙江省',
	'children' => [
	[
		'code' => "230100",
		'cn' => "哈尔滨市",
		'children' => [
	[
			'code' => "230102",
			'cn' => "道里区"
		],
		[
			'code' => "230103",
			'cn' => "南岗区"
		],
		[
			'code' => "230104",
			'cn' => "道外区"
		],
		[
			'code' => "230106",
			'cn' => "香坊区"
		],
		[
			'code' => "230107",
			'cn' => "动力区"
		],
		[
			'code' => "230108",
			'cn' => "平房区"
		],
		[
			'code' => "230109",
			'cn' => "松北区"
		],
		[
			'code' => "230111",
			'cn' => "呼兰区"
		],
		[
			'code' => "230123",
			'cn' => "依兰县"
		],
		[
			'code' => "230124",
			'cn' => "方正县"
		],
		[
			'code' => "230125",
			'cn' => "宾县"
		],
		[
			'code' => "230126",
			'cn' => "巴彦县"
		],
		[
			'code' => "230127",
			'cn' => "木兰县"
		],
		[
			'code' => "230128",
			'cn' => "通河县"
		],
		[
			'code' => "230129",
			'cn' => "延寿县"
		],
		[
			'code' => "230181",
			'cn' => "阿城市"
		],
		[
			'code' => "230182",
			'cn' => "双城市"
		],
		[
			'code' => "230183",
			'cn' => "尚志市"
		],
		[
			'code' => "230184",
			'cn' => "五常市"
		],
		[
			'code' => "230185",
			'cn' => "阿城市"
		],
		[
			'code' => "230186",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230200",
		'cn' => "齐齐哈尔市",
		'children' => [
	[
			'code' => "230202",
			'cn' => "龙沙区"
		],
		[
			'code' => "230203",
			'cn' => "建华区"
		],
		[
			'code' => "230204",
			'cn' => "铁锋区"
		],
		[
			'code' => "230205",
			'cn' => "昂昂溪区"
		],
		[
			'code' => "230206",
			'cn' => "富拉尔基区"
		],
		[
			'code' => "230207",
			'cn' => "碾子山区"
		],
		[
			'code' => "230208",
			'cn' => "梅里斯达斡尔族区"
		],
		[
			'code' => "230221",
			'cn' => "龙江县"
		],
		[
			'code' => "230223",
			'cn' => "依安县"
		],
		[
			'code' => "230224",
			'cn' => "泰来县"
		],
		[
			'code' => "230225",
			'cn' => "甘南县"
		],
		[
			'code' => "230227",
			'cn' => "富裕县"
		],
		[
			'code' => "230229",
			'cn' => "克山县"
		],
		[
			'code' => "230230",
			'cn' => "克东县"
		],
		[
			'code' => "230231",
			'cn' => "拜泉县"
		],
		[
			'code' => "230281",
			'cn' => "讷河市"
		],
		[
			'code' => "230282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230300",
		'cn' => "鸡西市",
		'children' => [
	[
			'code' => "230302",
			'cn' => "鸡冠区"
		],
		[
			'code' => "230303",
			'cn' => "恒山区"
		],
		[
			'code' => "230304",
			'cn' => "滴道区"
		],
		[
			'code' => "230305",
			'cn' => "梨树区"
		],
		[
			'code' => "230306",
			'cn' => "城子河区"
		],
		[
			'code' => "230307",
			'cn' => "麻山区"
		],
		[
			'code' => "230321",
			'cn' => "鸡东县"
		],
		[
			'code' => "230381",
			'cn' => "虎林市"
		],
		[
			'code' => "230382",
			'cn' => "密山市"
		],
		[
			'code' => "230383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230400",
		'cn' => "鹤岗市",
		'children' => [
	[
			'code' => "230402",
			'cn' => "向阳区"
		],
		[
			'code' => "230403",
			'cn' => "工农区"
		],
		[
			'code' => "230404",
			'cn' => "南山区"
		],
		[
			'code' => "230405",
			'cn' => "兴安区"
		],
		[
			'code' => "230406",
			'cn' => "东山区"
		],
		[
			'code' => "230407",
			'cn' => "兴山区"
		],
		[
			'code' => "230421",
			'cn' => "萝北县"
		],
		[
			'code' => "230422",
			'cn' => "绥滨县"
		],
		[
			'code' => "230423",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230500",
		'cn' => "双鸭山市",
		'children' => [
	[
			'code' => "230502",
			'cn' => "尖山区"
		],
		[
			'code' => "230503",
			'cn' => "岭东区"
		],
		[
			'code' => "230505",
			'cn' => "四方台区"
		],
		[
			'code' => "230506",
			'cn' => "宝山区"
		],
		[
			'code' => "230521",
			'cn' => "集贤县"
		],
		[
			'code' => "230522",
			'cn' => "友谊县"
		],
		[
			'code' => "230523",
			'cn' => "宝清县"
		],
		[
			'code' => "230524",
			'cn' => "饶河县"
		],
		[
			'code' => "230525",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230600",
		'cn' => "大庆市",
		'children' => [
	[
			'code' => "230602",
			'cn' => "萨尔图区"
		],
		[
			'code' => "230603",
			'cn' => "龙凤区"
		],
		[
			'code' => "230604",
			'cn' => "让胡路区"
		],
		[
			'code' => "230605",
			'cn' => "红岗区"
		],
		[
			'code' => "230606",
			'cn' => "大同区"
		],
		[
			'code' => "230621",
			'cn' => "肇州县"
		],
		[
			'code' => "230622",
			'cn' => "肇源县"
		],
		[
			'code' => "230623",
			'cn' => "林甸县"
		],
		[
			'code' => "230624",
			'cn' => "杜尔伯特蒙古族自治县"
		],
		[
			'code' => "230625",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230700",
		'cn' => "伊春市",
		'children' => [
	[
			'code' => "230702",
			'cn' => "伊春区"
		],
		[
			'code' => "230703",
			'cn' => "南岔区"
		],
		[
			'code' => "230704",
			'cn' => "友好区"
		],
		[
			'code' => "230705",
			'cn' => "西林区"
		],
		[
			'code' => "230706",
			'cn' => "翠峦区"
		],
		[
			'code' => "230707",
			'cn' => "新青区"
		],
		[
			'code' => "230708",
			'cn' => "美溪区"
		],
		[
			'code' => "230709",
			'cn' => "金山屯区"
		],
		[
			'code' => "230710",
			'cn' => "五营区"
		],
		[
			'code' => "230711",
			'cn' => "乌马河区"
		],
		[
			'code' => "230712",
			'cn' => "汤旺河区"
		],
		[
			'code' => "230713",
			'cn' => "带岭区"
		],
		[
			'code' => "230714",
			'cn' => "乌伊岭区"
		],
		[
			'code' => "230715",
			'cn' => "红星区"
		],
		[
			'code' => "230716",
			'cn' => "上甘岭区"
		],
		[
			'code' => "230722",
			'cn' => "嘉荫县"
		],
		[
			'code' => "230781",
			'cn' => "铁力市"
		],
		[
			'code' => "230782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230800",
		'cn' => "佳木斯市",
		'children' => [
	[
			'code' => "230802",
			'cn' => "永红区"
		],
		[
			'code' => "230803",
			'cn' => "向阳区"
		],
		[
			'code' => "230804",
			'cn' => "前进区"
		],
		[
			'code' => "230805",
			'cn' => "东风区"
		],
		[
			'code' => "230811",
			'cn' => "郊区"
		],
		[
			'code' => "230822",
			'cn' => "桦南县"
		],
		[
			'code' => "230826",
			'cn' => "桦川县"
		],
		[
			'code' => "230828",
			'cn' => "汤原县"
		],
		[
			'code' => "230833",
			'cn' => "抚远县"
		],
		[
			'code' => "230881",
			'cn' => "同江市"
		],
		[
			'code' => "230882",
			'cn' => "富锦市"
		],
		[
			'code' => "230883",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "230900",
		'cn' => "七台河市",
		'children' => [
	[
			'code' => "230902",
			'cn' => "新兴区"
		],
		[
			'code' => "230903",
			'cn' => "桃山区"
		],
		[
			'code' => "230904",
			'cn' => "茄子河区"
		],
		[
			'code' => "230921",
			'cn' => "勃利县"
		],
		[
			'code' => "230922",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "231000",
		'cn' => "牡丹江市",
		'children' => [
	[
			'code' => "231002",
			'cn' => "东安区"
		],
		[
			'code' => "231003",
			'cn' => "阳明区"
		],
		[
			'code' => "231004",
			'cn' => "爱民区"
		],
		[
			'code' => "231005",
			'cn' => "西安区"
		],
		[
			'code' => "231024",
			'cn' => "东宁县"
		],
		[
			'code' => "231025",
			'cn' => "林口县"
		],
		[
			'code' => "231081",
			'cn' => "绥芬河市"
		],
		[
			'code' => "231083",
			'cn' => "海林市"
		],
		[
			'code' => "231084",
			'cn' => "宁安市"
		],
		[
			'code' => "231085",
			'cn' => "穆棱市"
		],
		[
			'code' => "231086",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "231100",
		'cn' => "黑河市",
		'children' => [
	[
			'code' => "231102",
			'cn' => "爱辉区"
		],
		[
			'code' => "231121",
			'cn' => "嫩江县"
		],
		[
			'code' => "231123",
			'cn' => "逊克县"
		],
		[
			'code' => "231124",
			'cn' => "孙吴县"
		],
		[
			'code' => "231181",
			'cn' => "北安市"
		],
		[
			'code' => "231182",
			'cn' => "五大连池市"
		],
		[
			'code' => "231183",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "231200",
		'cn' => "绥化市",
		'children' => [
	[
			'code' => "231202",
			'cn' => "北林区"
		],
		[
			'code' => "231221",
			'cn' => "望奎县"
		],
		[
			'code' => "231222",
			'cn' => "兰西县"
		],
		[
			'code' => "231223",
			'cn' => "青冈县"
		],
		[
			'code' => "231224",
			'cn' => "庆安县"
		],
		[
			'code' => "231225",
			'cn' => "明水县"
		],
		[
			'code' => "231226",
			'cn' => "绥棱县"
		],
		[
			'code' => "231281",
			'cn' => "安达市"
		],
		[
			'code' => "231282",
			'cn' => "肇东市"
		],
		[
			'code' => "231283",
			'cn' => "海伦市"
		],
		[
			'code' => "231284",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "232700",
		'cn' => "大兴安岭地区",
		'children' => [
	[
			'code' => "232721",
			'cn' => "呼玛县"
		],
		[
			'code' => "232722",
			'cn' => "塔河县"
		],
		[
			'code' => "232723",
			'cn' => "漠河县"
		],
		[
			'code' => "232724",
			'cn' => "加格达奇区"
		],
		[
			'code' => "232725",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '310000',
	'cn' => '上海市',
	'children' => [
	[
		'code' => '310000',
		'cn' => '上海市',
		'children' => [
	[
			'code' => "310101",
			'cn' => "黄浦区"
		],
		[
			'code' => "310103",
			'cn' => "卢湾区"
		],
		[
			'code' => "310104",
			'cn' => "徐汇区"
		],
		[
			'code' => "310105",
			'cn' => "长宁区"
		],
		[
			'code' => "310106",
			'cn' => "静安区"
		],
		[
			'code' => "310107",
			'cn' => "普陀区"
		],
		[
			'code' => "310108",
			'cn' => "闸北区"
		],
		[
			'code' => "310109",
			'cn' => "虹口区"
		],
		[
			'code' => "310110",
			'cn' => "杨浦区"
		],
		[
			'code' => "310112",
			'cn' => "闵行区"
		],
		[
			'code' => "310113",
			'cn' => "宝山区"
		],
		[
			'code' => "310114",
			'cn' => "嘉定区"
		],
		[
			'code' => "310115",
			'cn' => "浦东新区"
		],
		[
			'code' => "310116",
			'cn' => "金山区"
		],
		[
			'code' => "310117",
			'cn' => "松江区"
		],
		[
			'code' => "310118",
			'cn' => "青浦区"
		],
		[
			'code' => "310119",
			'cn' => "南汇区"
		],
		[
			'code' => "310120",
			'cn' => "奉贤区"
		],
		[
			'code' => "310152",
			'cn' => "川沙区"
		],
		[
			'code' => "310230",
			'cn' => "崇明县"
		],
		[
			'code' => "310231",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '320000',
	'cn' => '江苏省',
	'children' => [
	[
		'code' => "320100",
		'cn' => "南京市",
		'children' => [
	[
			'code' => "320102",
			'cn' => "玄武区"
		],
		[
			'code' => "320103",
			'cn' => "白下区"
		],
		[
			'code' => "320104",
			'cn' => "秦淮区"
		],
		[
			'code' => "320105",
			'cn' => "建邺区"
		],
		[
			'code' => "320106",
			'cn' => "鼓楼区"
		],
		[
			'code' => "320107",
			'cn' => "下关区"
		],
		[
			'code' => "320111",
			'cn' => "浦口区"
		],
		[
			'code' => "320113",
			'cn' => "栖霞区"
		],
		[
			'code' => "320114",
			'cn' => "雨花台区"
		],
		[
			'code' => "320115",
			'cn' => "江宁区"
		],
		[
			'code' => "320116",
			'cn' => "六合区"
		],
		[
			'code' => "320124",
			'cn' => "溧水县"
		],
		[
			'code' => "320125",
			'cn' => "高淳县"
		],
		[
			'code' => "320126",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320200",
		'cn' => "无锡市",
		'children' => [
	[
			'code' => "320202",
			'cn' => "崇安区"
		],
		[
			'code' => "320203",
			'cn' => "南长区"
		],
		[
			'code' => "320204",
			'cn' => "北塘区"
		],
		[
			'code' => "320205",
			'cn' => "锡山区"
		],
		[
			'code' => "320206",
			'cn' => "惠山区"
		],
		[
			'code' => "320211",
			'cn' => "滨湖区"
		],
		[
			'code' => "320281",
			'cn' => "江阴市"
		],
		[
			'code' => "320282",
			'cn' => "宜兴市"
		],
		[
			'code' => "320296",
			'cn' => "新区"
		],
		[
			'code' => "320297",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320300",
		'cn' => "徐州市",
		'children' => [
	[
			'code' => "320302",
			'cn' => "鼓楼区"
		],
		[
			'code' => "320303",
			'cn' => "云龙区"
		],
		[
			'code' => "320304",
			'cn' => "九里区"
		],
		[
			'code' => "320305",
			'cn' => "贾汪区"
		],
		[
			'code' => "320311",
			'cn' => "泉山区"
		],
		[
			'code' => "320321",
			'cn' => "丰县"
		],
		[
			'code' => "320322",
			'cn' => "沛县"
		],
		[
			'code' => "320323",
			'cn' => "铜山县"
		],
		[
			'code' => "320324",
			'cn' => "睢宁县"
		],
		[
			'code' => "320381",
			'cn' => "新沂市"
		],
		[
			'code' => "320382",
			'cn' => "邳州市"
		],
		[
			'code' => "320383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320400",
		'cn' => "常州市",
		'children' => [
	[
			'code' => "320402",
			'cn' => "天宁区"
		],
		[
			'code' => "320404",
			'cn' => "钟楼区"
		],
		[
			'code' => "320405",
			'cn' => "戚墅堰区"
		],
		[
			'code' => "320411",
			'cn' => "新北区"
		],
		[
			'code' => "320412",
			'cn' => "武进区"
		],
		[
			'code' => "320481",
			'cn' => "溧阳市"
		],
		[
			'code' => "320482",
			'cn' => "金坛市"
		],
		[
			'code' => "320483",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320500",
		'cn' => "苏州市",
		'children' => [
	[
			'code' => "320502",
			'cn' => "沧浪区"
		],
		[
			'code' => "320503",
			'cn' => "平江区"
		],
		[
			'code' => "320504",
			'cn' => "金阊区"
		],
		[
			'code' => "320505",
			'cn' => "虎丘区"
		],
		[
			'code' => "320506",
			'cn' => "吴中区"
		],
		[
			'code' => "320507",
			'cn' => "相城区"
		],
		[
			'code' => "320581",
			'cn' => "常熟市"
		],
		[
			'code' => "320582",
			'cn' => "张家港市"
		],
		[
			'code' => "320583",
			'cn' => "昆山市"
		],
		[
			'code' => "320584",
			'cn' => "吴江市"
		],
		[
			'code' => "320585",
			'cn' => "太仓市"
		],
		[
			'code' => "320594",
			'cn' => "新区"
		],
		[
			'code' => "320595",
			'cn' => "园区"
		],
		[
			'code' => "320596",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320600",
		'cn' => "南通市",
		'children' => [
	[
			'code' => "320602",
			'cn' => "崇川区"
		],
		[
			'code' => "320611",
			'cn' => "港闸区"
		],
		[
			'code' => "320612",
			'cn' => "通州区"
		],
		[
			'code' => "320621",
			'cn' => "海安县"
		],
		[
			'code' => "320623",
			'cn' => "如东县"
		],
		[
			'code' => "320681",
			'cn' => "启东市"
		],
		[
			'code' => "320682",
			'cn' => "如皋市"
		],
		[
			'code' => "320683",
			'cn' => "通州市"
		],
		[
			'code' => "320684",
			'cn' => "海门市"
		],
		[
			'code' => "320693",
			'cn' => "开发区"
		],
		[
			'code' => "320694",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320700",
		'cn' => "连云港市",
		'children' => [
	[
			'code' => "320703",
			'cn' => "连云区"
		],
		[
			'code' => "320705",
			'cn' => "新浦区"
		],
		[
			'code' => "320706",
			'cn' => "海州区"
		],
		[
			'code' => "320721",
			'cn' => "赣榆县"
		],
		[
			'code' => "320722",
			'cn' => "东海县"
		],
		[
			'code' => "320723",
			'cn' => "灌云县"
		],
		[
			'code' => "320724",
			'cn' => "灌南县"
		],
		[
			'code' => "320725",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320800",
		'cn' => "淮安市",
		'children' => [
	[
			'code' => "320802",
			'cn' => "清河区"
		],
		[
			'code' => "320803",
			'cn' => "楚州区"
		],
		[
			'code' => "320804",
			'cn' => "淮阴区"
		],
		[
			'code' => "320811",
			'cn' => "清浦区"
		],
		[
			'code' => "320826",
			'cn' => "涟水县"
		],
		[
			'code' => "320829",
			'cn' => "洪泽县"
		],
		[
			'code' => "320830",
			'cn' => "盱眙县"
		],
		[
			'code' => "320831",
			'cn' => "金湖县"
		],
		[
			'code' => "320832",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "320900",
		'cn' => "盐城市",
		'children' => [
	[
			'code' => "320902",
			'cn' => "亭湖区"
		],
		[
			'code' => "320903",
			'cn' => "盐都区"
		],
		[
			'code' => "320921",
			'cn' => "响水县"
		],
		[
			'code' => "320922",
			'cn' => "滨海县"
		],
		[
			'code' => "320923",
			'cn' => "阜宁县"
		],
		[
			'code' => "320924",
			'cn' => "射阳县"
		],
		[
			'code' => "320925",
			'cn' => "建湖县"
		],
		[
			'code' => "320981",
			'cn' => "东台市"
		],
		[
			'code' => "320982",
			'cn' => "大丰市"
		],
		[
			'code' => "320983",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "321000",
		'cn' => "扬州市",
		'children' => [
	[
			'code' => "321002",
			'cn' => "广陵区"
		],
		[
			'code' => "321003",
			'cn' => "邗江区"
		],
		[
			'code' => "321011",
			'cn' => "维扬区"
		],
		[
			'code' => "321023",
			'cn' => "宝应县"
		],
		[
			'code' => "321081",
			'cn' => "仪征市"
		],
		[
			'code' => "321084",
			'cn' => "高邮市"
		],
		[
			'code' => "321088",
			'cn' => "江都市"
		],
		[
			'code' => "321092",
			'cn' => "经济开发区"
		],
		[
			'code' => "321093",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "321100",
		'cn' => "镇江市",
		'children' => [
	[
			'code' => "321102",
			'cn' => "京口区"
		],
		[
			'code' => "321111",
			'cn' => "润州区"
		],
		[
			'code' => "321112",
			'cn' => "丹徒区"
		],
		[
			'code' => "321181",
			'cn' => "丹阳市"
		],
		[
			'code' => "321182",
			'cn' => "扬中市"
		],
		[
			'code' => "321183",
			'cn' => "句容市"
		],
		[
			'code' => "321184",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "321200",
		'cn' => "泰州市",
		'children' => [
	[
			'code' => "321202",
			'cn' => "海陵区"
		],
		[
			'code' => "321203",
			'cn' => "高港区"
		],
		[
			'code' => "321281",
			'cn' => "兴化市"
		],
		[
			'code' => "321282",
			'cn' => "靖江市"
		],
		[
			'code' => "321283",
			'cn' => "泰兴市"
		],
		[
			'code' => "321284",
			'cn' => "姜堰市"
		],
		[
			'code' => "321285",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "321300",
		'cn' => "宿迁市",
		'children' => [
	[
			'code' => "321302",
			'cn' => "宿城区"
		],
		[
			'code' => "321311",
			'cn' => "宿豫区"
		],
		[
			'code' => "321322",
			'cn' => "沭阳县"
		],
		[
			'code' => "321323",
			'cn' => "泗阳县"
		],
		[
			'code' => "321324",
			'cn' => "泗洪县"
		],
		[
			'code' => "321325",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '330000',
	'cn' => '浙江省',
	'children' => [
	[
		'code' => "330100",
		'cn' => "杭州市",
		'children' => [
	[
			'code' => "330102",
			'cn' => "上城区"
		],
		[
			'code' => "330103",
			'cn' => "下城区"
		],
		[
			'code' => "330104",
			'cn' => "江干区"
		],
		[
			'code' => "330105",
			'cn' => "拱墅区"
		],
		[
			'code' => "330106",
			'cn' => "西湖区"
		],
		[
			'code' => "330108",
			'cn' => "滨江区"
		],
		[
			'code' => "330109",
			'cn' => "萧山区"
		],
		[
			'code' => "330110",
			'cn' => "余杭区"
		],
		[
			'code' => "330122",
			'cn' => "桐庐县"
		],
		[
			'code' => "330127",
			'cn' => "淳安县"
		],
		[
			'code' => "330182",
			'cn' => "建德市"
		],
		[
			'code' => "330183",
			'cn' => "富阳市"
		],
		[
			'code' => "330185",
			'cn' => "临安市"
		],
		[
			'code' => "330186",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330200",
		'cn' => "宁波市",
		'children' => [
	[
			'code' => "330203",
			'cn' => "海曙区"
		],
		[
			'code' => "330204",
			'cn' => "江东区"
		],
		[
			'code' => "330205",
			'cn' => "江北区"
		],
		[
			'code' => "330206",
			'cn' => "北仑区"
		],
		[
			'code' => "330211",
			'cn' => "镇海区"
		],
		[
			'code' => "330212",
			'cn' => "鄞州区"
		],
		[
			'code' => "330225",
			'cn' => "象山县"
		],
		[
			'code' => "330226",
			'cn' => "宁海县"
		],
		[
			'code' => "330281",
			'cn' => "余姚市"
		],
		[
			'code' => "330282",
			'cn' => "慈溪市"
		],
		[
			'code' => "330283",
			'cn' => "奉化市"
		],
		[
			'code' => "330284",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330300",
		'cn' => "温州市",
		'children' => [
	[
			'code' => "330302",
			'cn' => "鹿城区"
		],
		[
			'code' => "330303",
			'cn' => "龙湾区"
		],
		[
			'code' => "330304",
			'cn' => "瓯海区"
		],
		[
			'code' => "330322",
			'cn' => "洞头县"
		],
		[
			'code' => "330324",
			'cn' => "永嘉县"
		],
		[
			'code' => "330326",
			'cn' => "平阳县"
		],
		[
			'code' => "330327",
			'cn' => "苍南县"
		],
		[
			'code' => "330328",
			'cn' => "文成县"
		],
		[
			'code' => "330329",
			'cn' => "泰顺县"
		],
		[
			'code' => "330381",
			'cn' => "瑞安市"
		],
		[
			'code' => "330382",
			'cn' => "乐清市"
		],
		[
			'code' => "330383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330400",
		'cn' => "嘉兴市",
		'children' => [
	[
			'code' => "330402",
			'cn' => "南湖区"
		],
		[
			'code' => "330411",
			'cn' => "秀洲区"
		],
		[
			'code' => "330421",
			'cn' => "嘉善县"
		],
		[
			'code' => "330424",
			'cn' => "海盐县"
		],
		[
			'code' => "330481",
			'cn' => "海宁市"
		],
		[
			'code' => "330482",
			'cn' => "平湖市"
		],
		[
			'code' => "330483",
			'cn' => "桐乡市"
		],
		[
			'code' => "330484",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330500",
		'cn' => "湖州市",
		'children' => [
	[
			'code' => "330502",
			'cn' => "吴兴区"
		],
		[
			'code' => "330503",
			'cn' => "南浔区"
		],
		[
			'code' => "330521",
			'cn' => "德清县"
		],
		[
			'code' => "330522",
			'cn' => "长兴县"
		],
		[
			'code' => "330523",
			'cn' => "安吉县"
		],
		[
			'code' => "330524",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330600",
		'cn' => "绍兴市",
		'children' => [
	[
			'code' => "330602",
			'cn' => "越城区"
		],
		[
			'code' => "330621",
			'cn' => "柯桥区"
		],
		[
			'code' => "330624",
			'cn' => "新昌县"
		],
		[
			'code' => "330681",
			'cn' => "诸暨市"
		],
		[
			'code' => "330682",
			'cn' => "上虞区"
		],
		[
			'code' => "330683",
			'cn' => "嵊州市"
		],
		[
			'code' => "330684",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330700",
		'cn' => "金华市",
		'children' => [
	[
			'code' => "330702",
			'cn' => "婺城区"
		],
		[
			'code' => "330703",
			'cn' => "金东区"
		],
		[
			'code' => "330723",
			'cn' => "武义县"
		],
		[
			'code' => "330726",
			'cn' => "浦江县"
		],
		[
			'code' => "330727",
			'cn' => "磐安县"
		],
		[
			'code' => "330781",
			'cn' => "兰溪市"
		],
		[
			'code' => "330782",
			'cn' => "义乌市"
		],
		[
			'code' => "330783",
			'cn' => "东阳市"
		],
		[
			'code' => "330784",
			'cn' => "永康市"
		],
		[
			'code' => "330785",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330800",
		'cn' => "衢州市",
		'children' => [
	[
			'code' => "330802",
			'cn' => "柯城区"
		],
		[
			'code' => "330803",
			'cn' => "衢江区"
		],
		[
			'code' => "330822",
			'cn' => "常山县"
		],
		[
			'code' => "330824",
			'cn' => "开化县"
		],
		[
			'code' => "330825",
			'cn' => "龙游县"
		],
		[
			'code' => "330881",
			'cn' => "江山市"
		],
		[
			'code' => "330882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "330900",
		'cn' => "舟山市",
		'children' => [
	[
			'code' => "330902",
			'cn' => "定海区"
		],
		[
			'code' => "330903",
			'cn' => "普陀区"
		],
		[
			'code' => "330921",
			'cn' => "岱山县"
		],
		[
			'code' => "330922",
			'cn' => "嵊泗县"
		],
		[
			'code' => "330923",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "331000",
		'cn' => "台州市",
		'children' => [
	[
			'code' => "331002",
			'cn' => "椒江区"
		],
		[
			'code' => "331003",
			'cn' => "黄岩区"
		],
		[
			'code' => "331004",
			'cn' => "路桥区"
		],
		[
			'code' => "331021",
			'cn' => "玉环县"
		],
		[
			'code' => "331022",
			'cn' => "三门县"
		],
		[
			'code' => "331023",
			'cn' => "天台县"
		],
		[
			'code' => "331024",
			'cn' => "仙居县"
		],
		[
			'code' => "331081",
			'cn' => "温岭市"
		],
		[
			'code' => "331082",
			'cn' => "临海市"
		],
		[
			'code' => "331083",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "331100",
		'cn' => "丽水市",
		'children' => [
	[
			'code' => "331102",
			'cn' => "莲都区"
		],
		[
			'code' => "331121",
			'cn' => "青田县"
		],
		[
			'code' => "331122",
			'cn' => "缙云县"
		],
		[
			'code' => "331123",
			'cn' => "遂昌县"
		],
		[
			'code' => "331124",
			'cn' => "松阳县"
		],
		[
			'code' => "331125",
			'cn' => "云和县"
		],
		[
			'code' => "331126",
			'cn' => "庆元县"
		],
		[
			'code' => "331127",
			'cn' => "景宁畲族自治县"
		],
		[
			'code' => "331181",
			'cn' => "龙泉市"
		],
		[
			'code' => "331182",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '340000',
	'cn' => '安徽省',
	'children' => [
	[
		'code' => "340100",
		'cn' => "合肥市",
		'children' => [
	[
			'code' => "340102",
			'cn' => "瑶海区"
		],
		[
			'code' => "340103",
			'cn' => "庐阳区"
		],
		[
			'code' => "340104",
			'cn' => "蜀山区"
		],
		[
			'code' => "340111",
			'cn' => "包河区"
		],
		[
			'code' => "340121",
			'cn' => "长丰县"
		],
		[
			'code' => "340122",
			'cn' => "肥东县"
		],
		[
			'code' => "340123",
			'cn' => "肥西县"
		],
		[
			'code' => "340151",
			'cn' => "高新区"
		],
		[
			'code' => "340191",
			'cn' => "中区"
		],
		[
			'code' => "340192",
			'cn' => "其它区"
		],
		[
			'code' => "341400",
			'cn' => "巢湖市"
		],
		[
			'code' => "341402",
			'cn' => "居巢区"
		],
		[
			'code' => "341421",
			'cn' => "庐江县"
		]
		]
	],
		[
		'code' => "340200",
		'cn' => "芜湖市",
		'children' => [
	[
			'code' => "340202",
			'cn' => "镜湖区"
		],
		[
			'code' => "340203",
			'cn' => "弋江区"
		],
		[
			'code' => "340207",
			'cn' => "鸠江区"
		],
		[
			'code' => "340208",
			'cn' => "三山区"
		],
		[
			'code' => "340221",
			'cn' => "芜湖县"
		],
		[
			'code' => "340222",
			'cn' => "繁昌县"
		],
		[
			'code' => "340223",
			'cn' => "南陵县"
		],
		[
			'code' => "340224",
			'cn' => "其它区"
		],
		[
			'code' => "341422",
			'cn' => "无为县"
		]
		]
	],
		[
		'code' => "340300",
		'cn' => "蚌埠市",
		'children' => [
	[
			'code' => "340302",
			'cn' => "龙子湖区"
		],
		[
			'code' => "340303",
			'cn' => "蚌山区"
		],
		[
			'code' => "340304",
			'cn' => "禹会区"
		],
		[
			'code' => "340311",
			'cn' => "淮上区"
		],
		[
			'code' => "340321",
			'cn' => "怀远县"
		],
		[
			'code' => "340322",
			'cn' => "五河县"
		],
		[
			'code' => "340323",
			'cn' => "固镇县"
		],
		[
			'code' => "340324",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "340400",
		'cn' => "淮南市",
		'children' => [
	[
			'code' => "340402",
			'cn' => "大通区"
		],
		[
			'code' => "340403",
			'cn' => "田家庵区"
		],
		[
			'code' => "340404",
			'cn' => "谢家集区"
		],
		[
			'code' => "340405",
			'cn' => "八公山区"
		],
		[
			'code' => "340406",
			'cn' => "潘集区"
		],
		[
			'code' => "340421",
			'cn' => "凤台县"
		],
		[
			'code' => "340422",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "340500",
		'cn' => "马鞍山市",
		'children' => [
	[
			'code' => "340502",
			'cn' => "金家庄区"
		],
		[
			'code' => "340503",
			'cn' => "花山区"
		],
		[
			'code' => "340504",
			'cn' => "雨山区"
		],
		[
			'code' => "340521",
			'cn' => "当涂县"
		],
		[
			'code' => "340522",
			'cn' => "其它区"
		],
		[
			'code' => "341423",
			'cn' => "含山县"
		],
		[
			'code' => "341424",
			'cn' => "和县"
		]
		]
	],
		[
		'code' => "340600",
		'cn' => "淮北市",
		'children' => [
	[
			'code' => "340602",
			'cn' => "杜集区"
		],
		[
			'code' => "340603",
			'cn' => "相山区"
		],
		[
			'code' => "340604",
			'cn' => "烈山区"
		],
		[
			'code' => "340621",
			'cn' => "濉溪县"
		],
		[
			'code' => "340622",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "340700",
		'cn' => "铜陵市",
		'children' => [
	[
			'code' => "340702",
			'cn' => "铜官山区"
		],
		[
			'code' => "340703",
			'cn' => "狮子山区"
		],
		[
			'code' => "340711",
			'cn' => "郊区"
		],
		[
			'code' => "340721",
			'cn' => "铜陵县"
		],
		[
			'code' => "340722",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "340800",
		'cn' => "安庆市",
		'children' => [
	[
			'code' => "340802",
			'cn' => "迎江区"
		],
		[
			'code' => "340803",
			'cn' => "大观区"
		],
		[
			'code' => "340811",
			'cn' => "宜秀区"
		],
		[
			'code' => "340822",
			'cn' => "怀宁县"
		],
		[
			'code' => "340823",
			'cn' => "枞阳县"
		],
		[
			'code' => "340824",
			'cn' => "潜山县"
		],
		[
			'code' => "340825",
			'cn' => "太湖县"
		],
		[
			'code' => "340826",
			'cn' => "宿松县"
		],
		[
			'code' => "340827",
			'cn' => "望江县"
		],
		[
			'code' => "340828",
			'cn' => "岳西县"
		],
		[
			'code' => "340881",
			'cn' => "桐城市"
		],
		[
			'code' => "340882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341000",
		'cn' => "黄山市",
		'children' => [
	[
			'code' => "341002",
			'cn' => "屯溪区"
		],
		[
			'code' => "341003",
			'cn' => "黄山区"
		],
		[
			'code' => "341004",
			'cn' => "徽州区"
		],
		[
			'code' => "341021",
			'cn' => "歙县"
		],
		[
			'code' => "341022",
			'cn' => "休宁县"
		],
		[
			'code' => "341023",
			'cn' => "黟县"
		],
		[
			'code' => "341024",
			'cn' => "祁门县"
		],
		[
			'code' => "341025",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341100",
		'cn' => "滁州市",
		'children' => [
	[
			'code' => "341102",
			'cn' => "琅琊区"
		],
		[
			'code' => "341103",
			'cn' => "南谯区"
		],
		[
			'code' => "341122",
			'cn' => "来安县"
		],
		[
			'code' => "341124",
			'cn' => "全椒县"
		],
		[
			'code' => "341125",
			'cn' => "定远县"
		],
		[
			'code' => "341126",
			'cn' => "凤阳县"
		],
		[
			'code' => "341181",
			'cn' => "天长市"
		],
		[
			'code' => "341182",
			'cn' => "明光市"
		],
		[
			'code' => "341183",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341200",
		'cn' => "阜阳市",
		'children' => [
	[
			'code' => "341202",
			'cn' => "颍州区"
		],
		[
			'code' => "341203",
			'cn' => "颍东区"
		],
		[
			'code' => "341204",
			'cn' => "颍泉区"
		],
		[
			'code' => "341221",
			'cn' => "临泉县"
		],
		[
			'code' => "341222",
			'cn' => "太和县"
		],
		[
			'code' => "341225",
			'cn' => "阜南县"
		],
		[
			'code' => "341226",
			'cn' => "颍上县"
		],
		[
			'code' => "341282",
			'cn' => "界首市"
		],
		[
			'code' => "341283",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341300",
		'cn' => "宿州市",
		'children' => [
	[
			'code' => "341302",
			'cn' => "埇桥区"
		],
		[
			'code' => "341321",
			'cn' => "砀山县"
		],
		[
			'code' => "341322",
			'cn' => "萧县"
		],
		[
			'code' => "341323",
			'cn' => "灵璧县"
		],
		[
			'code' => "341324",
			'cn' => "泗县"
		],
		[
			'code' => "341325",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341500",
		'cn' => "六安市",
		'children' => [
	[
			'code' => "341502",
			'cn' => "金安区"
		],
		[
			'code' => "341503",
			'cn' => "裕安区"
		],
		[
			'code' => "341521",
			'cn' => "寿县"
		],
		[
			'code' => "341522",
			'cn' => "霍邱县"
		],
		[
			'code' => "341523",
			'cn' => "舒城县"
		],
		[
			'code' => "341524",
			'cn' => "金寨县"
		],
		[
			'code' => "341525",
			'cn' => "霍山县"
		],
		[
			'code' => "341526",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341600",
		'cn' => "亳州市",
		'children' => [
	[
			'code' => "341602",
			'cn' => "谯城区"
		],
		[
			'code' => "341621",
			'cn' => "涡阳县"
		],
		[
			'code' => "341622",
			'cn' => "蒙城县"
		],
		[
			'code' => "341623",
			'cn' => "利辛县"
		],
		[
			'code' => "341624",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341700",
		'cn' => "池州市",
		'children' => [
	[
			'code' => "341702",
			'cn' => "贵池区"
		],
		[
			'code' => "341721",
			'cn' => "东至县"
		],
		[
			'code' => "341722",
			'cn' => "石台县"
		],
		[
			'code' => "341723",
			'cn' => "青阳县"
		],
		[
			'code' => "341724",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "341800",
		'cn' => "宣城市",
		'children' => [
	[
			'code' => "341802",
			'cn' => "宣州区"
		],
		[
			'code' => "341821",
			'cn' => "郎溪县"
		],
		[
			'code' => "341822",
			'cn' => "广德县"
		],
		[
			'code' => "341823",
			'cn' => "泾县"
		],
		[
			'code' => "341824",
			'cn' => "绩溪县"
		],
		[
			'code' => "341825",
			'cn' => "旌德县"
		],
		[
			'code' => "341881",
			'cn' => "宁国市"
		],
		[
			'code' => "341882",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '350000',
	'cn' => '福建省',
	'children' => [
	[
		'code' => "350100",
		'cn' => "福州市",
		'children' => [
	[
			'code' => "350102",
			'cn' => "鼓楼区"
		],
		[
			'code' => "350103",
			'cn' => "台江区"
		],
		[
			'code' => "350104",
			'cn' => "仓山区"
		],
		[
			'code' => "350105",
			'cn' => "马尾区"
		],
		[
			'code' => "350111",
			'cn' => "晋安区"
		],
		[
			'code' => "350121",
			'cn' => "闽侯县"
		],
		[
			'code' => "350122",
			'cn' => "连江县"
		],
		[
			'code' => "350123",
			'cn' => "罗源县"
		],
		[
			'code' => "350124",
			'cn' => "闽清县"
		],
		[
			'code' => "350125",
			'cn' => "永泰县"
		],
		[
			'code' => "350128",
			'cn' => "平潭县"
		],
		[
			'code' => "350181",
			'cn' => "福清市"
		],
		[
			'code' => "350182",
			'cn' => "长乐市"
		],
		[
			'code' => "350183",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350200",
		'cn' => "厦门市",
		'children' => [
	[
			'code' => "350203",
			'cn' => "思明区"
		],
		[
			'code' => "350205",
			'cn' => "海沧区"
		],
		[
			'code' => "350206",
			'cn' => "湖里区"
		],
		[
			'code' => "350211",
			'cn' => "集美区"
		],
		[
			'code' => "350212",
			'cn' => "同安区"
		],
		[
			'code' => "350213",
			'cn' => "翔安区"
		],
		[
			'code' => "350214",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350300",
		'cn' => "莆田市",
		'children' => [
	[
			'code' => "350302",
			'cn' => "城厢区"
		],
		[
			'code' => "350303",
			'cn' => "涵江区"
		],
		[
			'code' => "350304",
			'cn' => "荔城区"
		],
		[
			'code' => "350305",
			'cn' => "秀屿区"
		],
		[
			'code' => "350322",
			'cn' => "仙游县"
		],
		[
			'code' => "350323",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350400",
		'cn' => "三明市",
		'children' => [
	[
			'code' => "350402",
			'cn' => "梅列区"
		],
		[
			'code' => "350403",
			'cn' => "三元区"
		],
		[
			'code' => "350421",
			'cn' => "明溪县"
		],
		[
			'code' => "350423",
			'cn' => "清流县"
		],
		[
			'code' => "350424",
			'cn' => "宁化县"
		],
		[
			'code' => "350425",
			'cn' => "大田县"
		],
		[
			'code' => "350426",
			'cn' => "尤溪县"
		],
		[
			'code' => "350427",
			'cn' => "沙县"
		],
		[
			'code' => "350428",
			'cn' => "将乐县"
		],
		[
			'code' => "350429",
			'cn' => "泰宁县"
		],
		[
			'code' => "350430",
			'cn' => "建宁县"
		],
		[
			'code' => "350481",
			'cn' => "永安市"
		],
		[
			'code' => "350482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350500",
		'cn' => "泉州市",
		'children' => [
	[
			'code' => "350502",
			'cn' => "鲤城区"
		],
		[
			'code' => "350503",
			'cn' => "丰泽区"
		],
		[
			'code' => "350504",
			'cn' => "洛江区"
		],
		[
			'code' => "350505",
			'cn' => "泉港区"
		],
		[
			'code' => "350521",
			'cn' => "惠安县"
		],
		[
			'code' => "350524",
			'cn' => "安溪县"
		],
		[
			'code' => "350525",
			'cn' => "永春县"
		],
		[
			'code' => "350526",
			'cn' => "德化县"
		],
		[
			'code' => "350527",
			'cn' => "金门县"
		],
		[
			'code' => "350581",
			'cn' => "石狮市"
		],
		[
			'code' => "350582",
			'cn' => "晋江市"
		],
		[
			'code' => "350583",
			'cn' => "南安市"
		],
		[
			'code' => "350584",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350600",
		'cn' => "漳州市",
		'children' => [
	[
			'code' => "350602",
			'cn' => "芗城区"
		],
		[
			'code' => "350603",
			'cn' => "龙文区"
		],
		[
			'code' => "350622",
			'cn' => "云霄县"
		],
		[
			'code' => "350623",
			'cn' => "漳浦县"
		],
		[
			'code' => "350624",
			'cn' => "诏安县"
		],
		[
			'code' => "350625",
			'cn' => "长泰县"
		],
		[
			'code' => "350626",
			'cn' => "东山县"
		],
		[
			'code' => "350627",
			'cn' => "南靖县"
		],
		[
			'code' => "350628",
			'cn' => "平和县"
		],
		[
			'code' => "350629",
			'cn' => "华安县"
		],
		[
			'code' => "350681",
			'cn' => "龙海市"
		],
		[
			'code' => "350682",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350700",
		'cn' => "南平市",
		'children' => [
	[
			'code' => "350702",
			'cn' => "延平区"
		],
		[
			'code' => "350721",
			'cn' => "顺昌县"
		],
		[
			'code' => "350722",
			'cn' => "浦城县"
		],
		[
			'code' => "350723",
			'cn' => "光泽县"
		],
		[
			'code' => "350724",
			'cn' => "松溪县"
		],
		[
			'code' => "350725",
			'cn' => "政和县"
		],
		[
			'code' => "350781",
			'cn' => "邵武市"
		],
		[
			'code' => "350782",
			'cn' => "武夷山市"
		],
		[
			'code' => "350783",
			'cn' => "建瓯市"
		],
		[
			'code' => "350784",
			'cn' => "建阳市"
		],
		[
			'code' => "350785",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350800",
		'cn' => "龙岩市",
		'children' => [
	[
			'code' => "350802",
			'cn' => "新罗区"
		],
		[
			'code' => "350821",
			'cn' => "长汀县"
		],
		[
			'code' => "350822",
			'cn' => "永定县"
		],
		[
			'code' => "350823",
			'cn' => "上杭县"
		],
		[
			'code' => "350824",
			'cn' => "武平县"
		],
		[
			'code' => "350825",
			'cn' => "连城县"
		],
		[
			'code' => "350881",
			'cn' => "漳平市"
		],
		[
			'code' => "350882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "350900",
		'cn' => "宁德市",
		'children' => [
	[
			'code' => "350902",
			'cn' => "蕉城区"
		],
		[
			'code' => "350921",
			'cn' => "霞浦县"
		],
		[
			'code' => "350922",
			'cn' => "古田县"
		],
		[
			'code' => "350923",
			'cn' => "屏南县"
		],
		[
			'code' => "350924",
			'cn' => "寿宁县"
		],
		[
			'code' => "350925",
			'cn' => "周宁县"
		],
		[
			'code' => "350926",
			'cn' => "柘荣县"
		],
		[
			'code' => "350981",
			'cn' => "福安市"
		],
		[
			'code' => "350982",
			'cn' => "福鼎市"
		],
		[
			'code' => "350983",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '360000',
	'cn' => '江西省',
	'children' => [
	[
		'code' => "360100",
		'cn' => "南昌市",
		'children' => [
	[
			'code' => "360102",
			'cn' => "东湖区"
		],
		[
			'code' => "360103",
			'cn' => "西湖区"
		],
		[
			'code' => "360104",
			'cn' => "青云谱区"
		],
		[
			'code' => "360105",
			'cn' => "湾里区"
		],
		[
			'code' => "360111",
			'cn' => "青山湖区"
		],
		[
			'code' => "360121",
			'cn' => "南昌县"
		],
		[
			'code' => "360122",
			'cn' => "新建县"
		],
		[
			'code' => "360123",
			'cn' => "安义县"
		],
		[
			'code' => "360124",
			'cn' => "进贤县"
		],
		[
			'code' => "360125",
			'cn' => "红谷滩新区"
		],
		[
			'code' => "360126",
			'cn' => "经济技术开发区"
		],
		[
			'code' => "360127",
			'cn' => "昌北区"
		],
		[
			'code' => "360128",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360200",
		'cn' => "景德镇市",
		'children' => [
	[
			'code' => "360202",
			'cn' => "昌江区"
		],
		[
			'code' => "360203",
			'cn' => "珠山区"
		],
		[
			'code' => "360222",
			'cn' => "浮梁县"
		],
		[
			'code' => "360281",
			'cn' => "乐平市"
		],
		[
			'code' => "360282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360300",
		'cn' => "萍乡市",
		'children' => [
	[
			'code' => "360302",
			'cn' => "安源区"
		],
		[
			'code' => "360313",
			'cn' => "湘东区"
		],
		[
			'code' => "360321",
			'cn' => "莲花县"
		],
		[
			'code' => "360322",
			'cn' => "上栗县"
		],
		[
			'code' => "360323",
			'cn' => "芦溪县"
		],
		[
			'code' => "360324",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360400",
		'cn' => "九江市",
		'children' => [
	[
			'code' => "360402",
			'cn' => "庐山区"
		],
		[
			'code' => "360403",
			'cn' => "浔阳区"
		],
		[
			'code' => "360421",
			'cn' => "九江县"
		],
		[
			'code' => "360423",
			'cn' => "武宁县"
		],
		[
			'code' => "360424",
			'cn' => "修水县"
		],
		[
			'code' => "360425",
			'cn' => "永修县"
		],
		[
			'code' => "360426",
			'cn' => "德安县"
		],
		[
			'code' => "360427",
			'cn' => "星子县"
		],
		[
			'code' => "360428",
			'cn' => "都昌县"
		],
		[
			'code' => "360429",
			'cn' => "湖口县"
		],
		[
			'code' => "360430",
			'cn' => "彭泽县"
		],
		[
			'code' => "360481",
			'cn' => "瑞昌市"
		],
		[
			'code' => "360482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360500",
		'cn' => "新余市",
		'children' => [
	[
			'code' => "360502",
			'cn' => "渝水区"
		],
		[
			'code' => "360521",
			'cn' => "分宜县"
		],
		[
			'code' => "360522",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360600",
		'cn' => "鹰潭市",
		'children' => [
	[
			'code' => "360602",
			'cn' => "月湖区"
		],
		[
			'code' => "360622",
			'cn' => "余江县"
		],
		[
			'code' => "360681",
			'cn' => "贵溪市"
		],
		[
			'code' => "360682",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360700",
		'cn' => "赣州市",
		'children' => [
	[
			'code' => "360702",
			'cn' => "章贡区"
		],
		[
			'code' => "360721",
			'cn' => "赣县"
		],
		[
			'code' => "360722",
			'cn' => "信丰县"
		],
		[
			'code' => "360723",
			'cn' => "大余县"
		],
		[
			'code' => "360724",
			'cn' => "上犹县"
		],
		[
			'code' => "360725",
			'cn' => "崇义县"
		],
		[
			'code' => "360726",
			'cn' => "安远县"
		],
		[
			'code' => "360727",
			'cn' => "龙南县"
		],
		[
			'code' => "360728",
			'cn' => "定南县"
		],
		[
			'code' => "360729",
			'cn' => "全南县"
		],
		[
			'code' => "360730",
			'cn' => "宁都县"
		],
		[
			'code' => "360731",
			'cn' => "于都县"
		],
		[
			'code' => "360732",
			'cn' => "兴国县"
		],
		[
			'code' => "360733",
			'cn' => "会昌县"
		],
		[
			'code' => "360734",
			'cn' => "寻乌县"
		],
		[
			'code' => "360735",
			'cn' => "石城县"
		],
		[
			'code' => "360751",
			'cn' => "黄金区"
		],
		[
			'code' => "360781",
			'cn' => "瑞金市"
		],
		[
			'code' => "360782",
			'cn' => "南康市"
		],
		[
			'code' => "360783",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360800",
		'cn' => "吉安市",
		'children' => [
	[
			'code' => "360802",
			'cn' => "吉州区"
		],
		[
			'code' => "360803",
			'cn' => "青原区"
		],
		[
			'code' => "360821",
			'cn' => "吉安县"
		],
		[
			'code' => "360822",
			'cn' => "吉水县"
		],
		[
			'code' => "360823",
			'cn' => "峡江县"
		],
		[
			'code' => "360824",
			'cn' => "新干县"
		],
		[
			'code' => "360825",
			'cn' => "永丰县"
		],
		[
			'code' => "360826",
			'cn' => "泰和县"
		],
		[
			'code' => "360827",
			'cn' => "遂川县"
		],
		[
			'code' => "360828",
			'cn' => "万安县"
		],
		[
			'code' => "360829",
			'cn' => "安福县"
		],
		[
			'code' => "360830",
			'cn' => "永新县"
		],
		[
			'code' => "360881",
			'cn' => "井冈山市"
		],
		[
			'code' => "360882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "360900",
		'cn' => "宜春市",
		'children' => [
	[
			'code' => "360902",
			'cn' => "袁州区"
		],
		[
			'code' => "360921",
			'cn' => "奉新县"
		],
		[
			'code' => "360922",
			'cn' => "万载县"
		],
		[
			'code' => "360923",
			'cn' => "上高县"
		],
		[
			'code' => "360924",
			'cn' => "宜丰县"
		],
		[
			'code' => "360925",
			'cn' => "靖安县"
		],
		[
			'code' => "360926",
			'cn' => "铜鼓县"
		],
		[
			'code' => "360981",
			'cn' => "丰城市"
		],
		[
			'code' => "360982",
			'cn' => "樟树市"
		],
		[
			'code' => "360983",
			'cn' => "高安市"
		],
		[
			'code' => "360984",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "361000",
		'cn' => "抚州市",
		'children' => [
	[
			'code' => "361002",
			'cn' => "临川区"
		],
		[
			'code' => "361021",
			'cn' => "南城县"
		],
		[
			'code' => "361022",
			'cn' => "黎川县"
		],
		[
			'code' => "361023",
			'cn' => "南丰县"
		],
		[
			'code' => "361024",
			'cn' => "崇仁县"
		],
		[
			'code' => "361025",
			'cn' => "乐安县"
		],
		[
			'code' => "361026",
			'cn' => "宜黄县"
		],
		[
			'code' => "361027",
			'cn' => "金溪县"
		],
		[
			'code' => "361028",
			'cn' => "资溪县"
		],
		[
			'code' => "361029",
			'cn' => "东乡县"
		],
		[
			'code' => "361030",
			'cn' => "广昌县"
		],
		[
			'code' => "361031",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "361100",
		'cn' => "上饶市",
		'children' => [
	[
			'code' => "361102",
			'cn' => "信州区"
		],
		[
			'code' => "361121",
			'cn' => "上饶县"
		],
		[
			'code' => "361122",
			'cn' => "广丰县"
		],
		[
			'code' => "361123",
			'cn' => "玉山县"
		],
		[
			'code' => "361124",
			'cn' => "铅山县"
		],
		[
			'code' => "361125",
			'cn' => "横峰县"
		],
		[
			'code' => "361126",
			'cn' => "弋阳县"
		],
		[
			'code' => "361127",
			'cn' => "余干县"
		],
		[
			'code' => "361128",
			'cn' => "鄱阳县"
		],
		[
			'code' => "361129",
			'cn' => "万年县"
		],
		[
			'code' => "361130",
			'cn' => "婺源县"
		],
		[
			'code' => "361181",
			'cn' => "德兴市"
		],
		[
			'code' => "361182",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '370000',
	'cn' => '山东省',
	'children' => [
	[
		'code' => "370100",
		'cn' => "济南市",
		'children' => [
	[
			'code' => "370102",
			'cn' => "历下区"
		],
		[
			'code' => "370103",
			'cn' => "市中区"
		],
		[
			'code' => "370104",
			'cn' => "槐荫区"
		],
		[
			'code' => "370105",
			'cn' => "天桥区"
		],
		[
			'code' => "370112",
			'cn' => "历城区"
		],
		[
			'code' => "370113",
			'cn' => "长清区"
		],
		[
			'code' => "370124",
			'cn' => "平阴县"
		],
		[
			'code' => "370125",
			'cn' => "济阳县"
		],
		[
			'code' => "370126",
			'cn' => "商河县"
		],
		[
			'code' => "370181",
			'cn' => "章丘市"
		],
		[
			'code' => "370182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370200",
		'cn' => "青岛市",
		'children' => [
	[
			'code' => "370202",
			'cn' => "市南区"
		],
		[
			'code' => "370203",
			'cn' => "市北区"
		],
		[
			'code' => "370205",
			'cn' => "四方区"
		],
		[
			'code' => "370211",
			'cn' => "黄岛区"
		],
		[
			'code' => "370212",
			'cn' => "崂山区"
		],
		[
			'code' => "370213",
			'cn' => "李沧区"
		],
		[
			'code' => "370214",
			'cn' => "城阳区"
		],
		[
			'code' => "370251",
			'cn' => "开发区"
		],
		[
			'code' => "370281",
			'cn' => "胶州市"
		],
		[
			'code' => "370282",
			'cn' => "即墨市"
		],
		[
			'code' => "370283",
			'cn' => "平度市"
		],
		[
			'code' => "370284",
			'cn' => "胶南市"
		],
		[
			'code' => "370285",
			'cn' => "莱西市"
		],
		[
			'code' => "370286",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370300",
		'cn' => "淄博市",
		'children' => [
	[
			'code' => "370302",
			'cn' => "淄川区"
		],
		[
			'code' => "370303",
			'cn' => "张店区"
		],
		[
			'code' => "370304",
			'cn' => "博山区"
		],
		[
			'code' => "370305",
			'cn' => "临淄区"
		],
		[
			'code' => "370306",
			'cn' => "周村区"
		],
		[
			'code' => "370321",
			'cn' => "桓台县"
		],
		[
			'code' => "370322",
			'cn' => "高青县"
		],
		[
			'code' => "370323",
			'cn' => "沂源县"
		],
		[
			'code' => "370324",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370400",
		'cn' => "枣庄市",
		'children' => [
	[
			'code' => "370402",
			'cn' => "市中区"
		],
		[
			'code' => "370403",
			'cn' => "薛城区"
		],
		[
			'code' => "370404",
			'cn' => "峄城区"
		],
		[
			'code' => "370405",
			'cn' => "台儿庄区"
		],
		[
			'code' => "370406",
			'cn' => "山亭区"
		],
		[
			'code' => "370481",
			'cn' => "滕州市"
		],
		[
			'code' => "370482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370500",
		'cn' => "东营市",
		'children' => [
	[
			'code' => "370502",
			'cn' => "东营区"
		],
		[
			'code' => "370503",
			'cn' => "河口区"
		],
		[
			'code' => "370521",
			'cn' => "垦利县"
		],
		[
			'code' => "370522",
			'cn' => "利津县"
		],
		[
			'code' => "370523",
			'cn' => "广饶县"
		],
		[
			'code' => "370589",
			'cn' => "西城区"
		],
		[
			'code' => "370590",
			'cn' => "东城区"
		],
		[
			'code' => "370591",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370600",
		'cn' => "烟台市",
		'children' => [
	[
			'code' => "370602",
			'cn' => "芝罘区"
		],
		[
			'code' => "370611",
			'cn' => "福山区"
		],
		[
			'code' => "370612",
			'cn' => "牟平区"
		],
		[
			'code' => "370613",
			'cn' => "莱山区"
		],
		[
			'code' => "370634",
			'cn' => "长岛县"
		],
		[
			'code' => "370681",
			'cn' => "龙口市"
		],
		[
			'code' => "370682",
			'cn' => "莱阳市"
		],
		[
			'code' => "370683",
			'cn' => "莱州市"
		],
		[
			'code' => "370684",
			'cn' => "蓬莱市"
		],
		[
			'code' => "370685",
			'cn' => "招远市"
		],
		[
			'code' => "370686",
			'cn' => "栖霞市"
		],
		[
			'code' => "370687",
			'cn' => "海阳市"
		],
		[
			'code' => "370688",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370700",
		'cn' => "潍坊市",
		'children' => [
	[
			'code' => "370702",
			'cn' => "潍城区"
		],
		[
			'code' => "370703",
			'cn' => "寒亭区"
		],
		[
			'code' => "370704",
			'cn' => "坊子区"
		],
		[
			'code' => "370705",
			'cn' => "奎文区"
		],
		[
			'code' => "370724",
			'cn' => "临朐县"
		],
		[
			'code' => "370725",
			'cn' => "昌乐县"
		],
		[
			'code' => "370751",
			'cn' => "开发区"
		],
		[
			'code' => "370781",
			'cn' => "青州市"
		],
		[
			'code' => "370782",
			'cn' => "诸城市"
		],
		[
			'code' => "370783",
			'cn' => "寿光市"
		],
		[
			'code' => "370784",
			'cn' => "安丘市"
		],
		[
			'code' => "370785",
			'cn' => "高密市"
		],
		[
			'code' => "370786",
			'cn' => "昌邑市"
		],
		[
			'code' => "370787",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370800",
		'cn' => "济宁市",
		'children' => [
	[
			'code' => "370802",
			'cn' => "市中区"
		],
		[
			'code' => "370811",
			'cn' => "任城区"
		],
		[
			'code' => "370826",
			'cn' => "微山县"
		],
		[
			'code' => "370827",
			'cn' => "鱼台县"
		],
		[
			'code' => "370828",
			'cn' => "金乡县"
		],
		[
			'code' => "370829",
			'cn' => "嘉祥县"
		],
		[
			'code' => "370830",
			'cn' => "汶上县"
		],
		[
			'code' => "370831",
			'cn' => "泗水县"
		],
		[
			'code' => "370832",
			'cn' => "梁山县"
		],
		[
			'code' => "370881",
			'cn' => "曲阜市"
		],
		[
			'code' => "370882",
			'cn' => "兖州市"
		],
		[
			'code' => "370883",
			'cn' => "邹城市"
		],
		[
			'code' => "370884",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "370900",
		'cn' => "泰安市",
		'children' => [
	[
			'code' => "370902",
			'cn' => "泰山区"
		],
		[
			'code' => "370903",
			'cn' => "岱岳区"
		],
		[
			'code' => "370921",
			'cn' => "宁阳县"
		],
		[
			'code' => "370923",
			'cn' => "东平县"
		],
		[
			'code' => "370982",
			'cn' => "新泰市"
		],
		[
			'code' => "370983",
			'cn' => "肥城市"
		],
		[
			'code' => "370984",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371000",
		'cn' => "威海市",
		'children' => [
	[
			'code' => "371002",
			'cn' => "环翠区"
		],
		[
			'code' => "371081",
			'cn' => "文登市"
		],
		[
			'code' => "371082",
			'cn' => "荣成市"
		],
		[
			'code' => "371083",
			'cn' => "乳山市"
		],
		[
			'code' => "371084",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371100",
		'cn' => "日照市",
		'children' => [
	[
			'code' => "371102",
			'cn' => "东港区"
		],
		[
			'code' => "371103",
			'cn' => "岚山区"
		],
		[
			'code' => "371121",
			'cn' => "五莲县"
		],
		[
			'code' => "371122",
			'cn' => "莒县"
		],
		[
			'code' => "371123",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371200",
		'cn' => "莱芜市",
		'children' => [
	[
			'code' => "371202",
			'cn' => "莱城区"
		],
		[
			'code' => "371203",
			'cn' => "钢城区"
		],
		[
			'code' => "371204",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371300",
		'cn' => "临沂市",
		'children' => [
	[
			'code' => "371302",
			'cn' => "兰山区"
		],
		[
			'code' => "371311",
			'cn' => "罗庄区"
		],
		[
			'code' => "371312",
			'cn' => "河东区"
		],
		[
			'code' => "371321",
			'cn' => "沂南县"
		],
		[
			'code' => "371322",
			'cn' => "郯城县"
		],
		[
			'code' => "371323",
			'cn' => "沂水县"
		],
		[
			'code' => "371324",
			'cn' => "苍山县"
		],
		[
			'code' => "371325",
			'cn' => "费县"
		],
		[
			'code' => "371326",
			'cn' => "平邑县"
		],
		[
			'code' => "371327",
			'cn' => "莒南县"
		],
		[
			'code' => "371328",
			'cn' => "蒙阴县"
		],
		[
			'code' => "371329",
			'cn' => "临沭县"
		],
		[
			'code' => "371330",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371400",
		'cn' => "德州市",
		'children' => [
	[
			'code' => "371402",
			'cn' => "德城区"
		],
		[
			'code' => "371421",
			'cn' => "陵县"
		],
		[
			'code' => "371422",
			'cn' => "宁津县"
		],
		[
			'code' => "371423",
			'cn' => "庆云县"
		],
		[
			'code' => "371424",
			'cn' => "临邑县"
		],
		[
			'code' => "371425",
			'cn' => "齐河县"
		],
		[
			'code' => "371426",
			'cn' => "平原县"
		],
		[
			'code' => "371427",
			'cn' => "夏津县"
		],
		[
			'code' => "371428",
			'cn' => "武城县"
		],
		[
			'code' => "371451",
			'cn' => "开发区"
		],
		[
			'code' => "371481",
			'cn' => "乐陵市"
		],
		[
			'code' => "371482",
			'cn' => "禹城市"
		],
		[
			'code' => "371483",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371500",
		'cn' => "聊城市",
		'children' => [
	[
			'code' => "371502",
			'cn' => "东昌府区"
		],
		[
			'code' => "371521",
			'cn' => "阳谷县"
		],
		[
			'code' => "371522",
			'cn' => "莘县"
		],
		[
			'code' => "371523",
			'cn' => "茌平县"
		],
		[
			'code' => "371524",
			'cn' => "东阿县"
		],
		[
			'code' => "371525",
			'cn' => "冠县"
		],
		[
			'code' => "371526",
			'cn' => "高唐县"
		],
		[
			'code' => "371581",
			'cn' => "临清市"
		],
		[
			'code' => "371582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371600",
		'cn' => "滨州市",
		'children' => [
	[
			'code' => "371602",
			'cn' => "滨城区"
		],
		[
			'code' => "371621",
			'cn' => "惠民县"
		],
		[
			'code' => "371622",
			'cn' => "阳信县"
		],
		[
			'code' => "371623",
			'cn' => "无棣县"
		],
		[
			'code' => "371624",
			'cn' => "沾化县"
		],
		[
			'code' => "371625",
			'cn' => "博兴县"
		],
		[
			'code' => "371626",
			'cn' => "邹平县"
		],
		[
			'code' => "371627",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "371700",
		'cn' => "菏泽市",
		'children' => [
	[
			'code' => "371702",
			'cn' => "牡丹区"
		],
		[
			'code' => "371721",
			'cn' => "曹县"
		],
		[
			'code' => "371722",
			'cn' => "单县"
		],
		[
			'code' => "371723",
			'cn' => "成武县"
		],
		[
			'code' => "371724",
			'cn' => "巨野县"
		],
		[
			'code' => "371725",
			'cn' => "郓城县"
		],
		[
			'code' => "371726",
			'cn' => "鄄城县"
		],
		[
			'code' => "371727",
			'cn' => "定陶县"
		],
		[
			'code' => "371728",
			'cn' => "东明县"
		],
		[
			'code' => "371729",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '410000',
	'cn' => '河南省',
	'children' => [
	[
		'code' => "410100",
		'cn' => "郑州市",
		'children' => [
	[
			'code' => "410102",
			'cn' => "中原区"
		],
		[
			'code' => "410103",
			'cn' => "二七区"
		],
		[
			'code' => "410104",
			'cn' => "管城回族区"
		],
		[
			'code' => "410105",
			'cn' => "金水区"
		],
		[
			'code' => "410106",
			'cn' => "上街区"
		],
		[
			'code' => "410108",
			'cn' => "惠济区"
		],
		[
			'code' => "410122",
			'cn' => "中牟县"
		],
		[
			'code' => "410181",
			'cn' => "巩义市"
		],
		[
			'code' => "410182",
			'cn' => "荥阳市"
		],
		[
			'code' => "410183",
			'cn' => "新密市"
		],
		[
			'code' => "410184",
			'cn' => "新郑市"
		],
		[
			'code' => "410185",
			'cn' => "登封市"
		],
		[
			'code' => "410186",
			'cn' => "郑东新区"
		],
		[
			'code' => "410187",
			'cn' => "高新区"
		],
		[
			'code' => "410188",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410200",
		'cn' => "开封市",
		'children' => [
	[
			'code' => "410202",
			'cn' => "龙亭区"
		],
		[
			'code' => "410203",
			'cn' => "顺河回族区"
		],
		[
			'code' => "410204",
			'cn' => "鼓楼区"
		],
		[
			'code' => "410205",
			'cn' => "禹王台区"
		],
		[
			'code' => "410211",
			'cn' => "金明区"
		],
		[
			'code' => "410221",
			'cn' => "杞县"
		],
		[
			'code' => "410222",
			'cn' => "通许县"
		],
		[
			'code' => "410223",
			'cn' => "尉氏县"
		],
		[
			'code' => "410224",
			'cn' => "开封县"
		],
		[
			'code' => "410225",
			'cn' => "兰考县"
		],
		[
			'code' => "410226",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410300",
		'cn' => "洛阳市",
		'children' => [
	[
			'code' => "410302",
			'cn' => "老城区"
		],
		[
			'code' => "410303",
			'cn' => "西工区"
		],
		[
			'code' => "410304",
			'cn' => "廛河回族区"
		],
		[
			'code' => "410305",
			'cn' => "涧西区"
		],
		[
			'code' => "410306",
			'cn' => "吉利区"
		],
		[
			'code' => "410307",
			'cn' => "洛龙区"
		],
		[
			'code' => "410322",
			'cn' => "孟津县"
		],
		[
			'code' => "410323",
			'cn' => "新安县"
		],
		[
			'code' => "410324",
			'cn' => "栾川县"
		],
		[
			'code' => "410325",
			'cn' => "嵩县"
		],
		[
			'code' => "410326",
			'cn' => "汝阳县"
		],
		[
			'code' => "410327",
			'cn' => "宜阳县"
		],
		[
			'code' => "410328",
			'cn' => "洛宁县"
		],
		[
			'code' => "410329",
			'cn' => "伊川县"
		],
		[
			'code' => "410381",
			'cn' => "偃师市"
		],
		[
			'code' => "471004",
			'cn' => "高新区"
		],
		[
			'code' => "471005",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410400",
		'cn' => "平顶山市",
		'children' => [
	[
			'code' => "410402",
			'cn' => "新华区"
		],
		[
			'code' => "410403",
			'cn' => "卫东区"
		],
		[
			'code' => "410404",
			'cn' => "石龙区"
		],
		[
			'code' => "410411",
			'cn' => "湛河区"
		],
		[
			'code' => "410421",
			'cn' => "宝丰县"
		],
		[
			'code' => "410422",
			'cn' => "叶县"
		],
		[
			'code' => "410423",
			'cn' => "鲁山县"
		],
		[
			'code' => "410425",
			'cn' => "郏县"
		],
		[
			'code' => "410481",
			'cn' => "舞钢市"
		],
		[
			'code' => "410482",
			'cn' => "汝州市"
		],
		[
			'code' => "410483",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410500",
		'cn' => "安阳市",
		'children' => [
	[
			'code' => "410502",
			'cn' => "文峰区"
		],
		[
			'code' => "410503",
			'cn' => "北关区"
		],
		[
			'code' => "410505",
			'cn' => "殷都区"
		],
		[
			'code' => "410506",
			'cn' => "龙安区"
		],
		[
			'code' => "410522",
			'cn' => "安阳县"
		],
		[
			'code' => "410523",
			'cn' => "汤阴县"
		],
		[
			'code' => "410526",
			'cn' => "滑县"
		],
		[
			'code' => "410527",
			'cn' => "内黄县"
		],
		[
			'code' => "410581",
			'cn' => "林州市"
		],
		[
			'code' => "410582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410600",
		'cn' => "鹤壁市",
		'children' => [
	[
			'code' => "410602",
			'cn' => "鹤山区"
		],
		[
			'code' => "410603",
			'cn' => "山城区"
		],
		[
			'code' => "410611",
			'cn' => "淇滨区"
		],
		[
			'code' => "410621",
			'cn' => "浚县"
		],
		[
			'code' => "410622",
			'cn' => "淇县"
		],
		[
			'code' => "410623",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410700",
		'cn' => "新乡市",
		'children' => [
	[
			'code' => "410702",
			'cn' => "红旗区"
		],
		[
			'code' => "410703",
			'cn' => "卫滨区"
		],
		[
			'code' => "410704",
			'cn' => "凤泉区"
		],
		[
			'code' => "410711",
			'cn' => "牧野区"
		],
		[
			'code' => "410721",
			'cn' => "新乡县"
		],
		[
			'code' => "410724",
			'cn' => "获嘉县"
		],
		[
			'code' => "410725",
			'cn' => "原阳县"
		],
		[
			'code' => "410726",
			'cn' => "延津县"
		],
		[
			'code' => "410727",
			'cn' => "封丘县"
		],
		[
			'code' => "410728",
			'cn' => "长垣县"
		],
		[
			'code' => "410781",
			'cn' => "卫辉市"
		],
		[
			'code' => "410782",
			'cn' => "辉县市"
		],
		[
			'code' => "410783",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410800",
		'cn' => "焦作市",
		'children' => [
	[
			'code' => "410802",
			'cn' => "解放区"
		],
		[
			'code' => "410803",
			'cn' => "中站区"
		],
		[
			'code' => "410804",
			'cn' => "马村区"
		],
		[
			'code' => "410811",
			'cn' => "山阳区"
		],
		[
			'code' => "410821",
			'cn' => "修武县"
		],
		[
			'code' => "410822",
			'cn' => "博爱县"
		],
		[
			'code' => "410823",
			'cn' => "武陟县"
		],
		[
			'code' => "410825",
			'cn' => "温县"
		],
		[
			'code' => "410882",
			'cn' => "沁阳市"
		],
		[
			'code' => "410883",
			'cn' => "孟州市"
		],
		[
			'code' => "410884",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "410900",
		'cn' => "濮阳市",
		'children' => [
	[
			'code' => "410902",
			'cn' => "华龙区"
		],
		[
			'code' => "410922",
			'cn' => "清丰县"
		],
		[
			'code' => "410923",
			'cn' => "南乐县"
		],
		[
			'code' => "410926",
			'cn' => "范县"
		],
		[
			'code' => "410927",
			'cn' => "台前县"
		],
		[
			'code' => "410928",
			'cn' => "濮阳县"
		],
		[
			'code' => "410929",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411000",
		'cn' => "许昌市",
		'children' => [
	[
			'code' => "410902",
			'cn' => "华龙区"
		],
		[
			'code' => "410922",
			'cn' => "清丰县"
		],
		[
			'code' => "410923",
			'cn' => "南乐县"
		],
		[
			'code' => "410926",
			'cn' => "范县"
		],
		[
			'code' => "410927",
			'cn' => "台前县"
		],
		[
			'code' => "410928",
			'cn' => "濮阳县"
		],
		[
			'code' => "410929",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411100",
		'cn' => "漯河市",
		'children' => [
	[
			'code' => "411002",
			'cn' => "魏都区"
		],
		[
			'code' => "411023",
			'cn' => "许昌县"
		],
		[
			'code' => "411024",
			'cn' => "鄢陵县"
		],
		[
			'code' => "411025",
			'cn' => "襄城县"
		],
		[
			'code' => "411081",
			'cn' => "禹州市"
		],
		[
			'code' => "411082",
			'cn' => "长葛市"
		],
		[
			'code' => "411083",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411200",
		'cn' => "三门峡市",
		'children' => [
	[
			'code' => "411102",
			'cn' => "源汇区"
		],
		[
			'code' => "411103",
			'cn' => "郾城区"
		],
		[
			'code' => "411104",
			'cn' => "召陵区"
		],
		[
			'code' => "411121",
			'cn' => "舞阳县"
		],
		[
			'code' => "411122",
			'cn' => "临颍县"
		],
		[
			'code' => "411123",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411300",
		'cn' => "南阳市",
		'children' => [
	[
			'code' => "411202",
			'cn' => "湖滨区"
		],
		[
			'code' => "411221",
			'cn' => "渑池县"
		],
		[
			'code' => "411222",
			'cn' => "陕县"
		],
		[
			'code' => "411224",
			'cn' => "卢氏县"
		],
		[
			'code' => "411281",
			'cn' => "义马市"
		],
		[
			'code' => "411282",
			'cn' => "灵宝市"
		],
		[
			'code' => "411283",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411400",
		'cn' => "商丘市",
		'children' => [
	[
			'code' => "411302",
			'cn' => "宛城区"
		],
		[
			'code' => "411303",
			'cn' => "卧龙区"
		],
		[
			'code' => "411321",
			'cn' => "南召县"
		],
		[
			'code' => "411322",
			'cn' => "方城县"
		],
		[
			'code' => "411323",
			'cn' => "西峡县"
		],
		[
			'code' => "411324",
			'cn' => "镇平县"
		],
		[
			'code' => "411325",
			'cn' => "内乡县"
		],
		[
			'code' => "411326",
			'cn' => "淅川县"
		],
		[
			'code' => "411327",
			'cn' => "社旗县"
		],
		[
			'code' => "411328",
			'cn' => "唐河县"
		],
		[
			'code' => "411329",
			'cn' => "新野县"
		],
		[
			'code' => "411330",
			'cn' => "桐柏县"
		],
		[
			'code' => "411381",
			'cn' => "邓州市"
		],
		[
			'code' => "411382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411500",
		'cn' => "信阳市",
		'children' => [
	[
			'code' => "411402",
			'cn' => "梁园区"
		],
		[
			'code' => "411403",
			'cn' => "睢阳区"
		],
		[
			'code' => "411421",
			'cn' => "民权县"
		],
		[
			'code' => "411422",
			'cn' => "睢县"
		],
		[
			'code' => "411423",
			'cn' => "宁陵县"
		],
		[
			'code' => "411424",
			'cn' => "柘城县"
		],
		[
			'code' => "411425",
			'cn' => "虞城县"
		],
		[
			'code' => "411426",
			'cn' => "夏邑县"
		],
		[
			'code' => "411481",
			'cn' => "永城市"
		],
		[
			'code' => "411482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411600",
		'cn' => "周口市",
		'children' => [
	[
			'code' => "411502",
			'cn' => "浉河区"
		],
		[
			'code' => "411503",
			'cn' => "平桥区"
		],
		[
			'code' => "411521",
			'cn' => "罗山县"
		],
		[
			'code' => "411522",
			'cn' => "光山县"
		],
		[
			'code' => "411523",
			'cn' => "新县"
		],
		[
			'code' => "411524",
			'cn' => "商城县"
		],
		[
			'code' => "411525",
			'cn' => "固始县"
		],
		[
			'code' => "411526",
			'cn' => "潢川县"
		],
		[
			'code' => "411527",
			'cn' => "淮滨县"
		],
		[
			'code' => "411528",
			'cn' => "息县"
		],
		[
			'code' => "411529",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "411700",
		'cn' => "驻马店市",
		'children' => [
	[
			'code' => "411602",
			'cn' => "川汇区"
		],
		[
			'code' => "411621",
			'cn' => "扶沟县"
		],
		[
			'code' => "411622",
			'cn' => "西华县"
		],
		[
			'code' => "411623",
			'cn' => "商水县"
		],
		[
			'code' => "411624",
			'cn' => "沈丘县"
		],
		[
			'code' => "411625",
			'cn' => "郸城县"
		],
		[
			'code' => "411626",
			'cn' => "淮阳县"
		],
		[
			'code' => "411627",
			'cn' => "太康县"
		],
		[
			'code' => "411628",
			'cn' => "鹿邑县"
		],
		[
			'code' => "411681",
			'cn' => "项城市"
		],
		[
			'code' => "411682",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '420000',
	'cn' => '湖北省',
	'children' => [
	[
		'code' => "420100",
		'cn' => "武汉市",
		'children' => [
	[
			'code' => "420102",
			'cn' => "江岸区"
		],
		[
			'code' => "420103",
			'cn' => "江汉区"
		],
		[
			'code' => "420104",
			'cn' => "硚口区"
		],
		[
			'code' => "420105",
			'cn' => "汉阳区"
		],
		[
			'code' => "420106",
			'cn' => "武昌区"
		],
		[
			'code' => "420107",
			'cn' => "青山区"
		],
		[
			'code' => "420111",
			'cn' => "洪山区"
		],
		[
			'code' => "420112",
			'cn' => "东西湖区"
		],
		[
			'code' => "420113",
			'cn' => "汉南区"
		],
		[
			'code' => "420114",
			'cn' => "蔡甸区"
		],
		[
			'code' => "420115",
			'cn' => "江夏区"
		],
		[
			'code' => "420116",
			'cn' => "黄陂区"
		],
		[
			'code' => "420117",
			'cn' => "新洲区"
		],
		[
			'code' => "420118",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420200",
		'cn' => "黄石市",
		'children' => [
	[
			'code' => "420202",
			'cn' => "黄石港区"
		],
		[
			'code' => "420203",
			'cn' => "西塞山区"
		],
		[
			'code' => "420204",
			'cn' => "下陆区"
		],
		[
			'code' => "420205",
			'cn' => "铁山区"
		],
		[
			'code' => "420222",
			'cn' => "阳新县"
		],
		[
			'code' => "420281",
			'cn' => "大冶市"
		],
		[
			'code' => "420282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420300",
		'cn' => "十堰市",
		'children' => [
	[
			'code' => "420302",
			'cn' => "茅箭区"
		],
		[
			'code' => "420303",
			'cn' => "张湾区"
		],
		[
			'code' => "420321",
			'cn' => "郧县"
		],
		[
			'code' => "420322",
			'cn' => "郧西县"
		],
		[
			'code' => "420323",
			'cn' => "竹山县"
		],
		[
			'code' => "420324",
			'cn' => "竹溪县"
		],
		[
			'code' => "420325",
			'cn' => "房县"
		],
		[
			'code' => "420381",
			'cn' => "丹江口市"
		],
		[
			'code' => "420382",
			'cn' => "城区"
		],
		[
			'code' => "420383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420500",
		'cn' => "宜昌市",
		'children' => [
	[
			'code' => "420502",
			'cn' => "西陵区"
		],
		[
			'code' => "420503",
			'cn' => "伍家岗区"
		],
		[
			'code' => "420504",
			'cn' => "点军区"
		],
		[
			'code' => "420505",
			'cn' => "猇亭区"
		],
		[
			'code' => "420506",
			'cn' => "夷陵区"
		],
		[
			'code' => "420525",
			'cn' => "远安县"
		],
		[
			'code' => "420526",
			'cn' => "兴山县"
		],
		[
			'code' => "420527",
			'cn' => "秭归县"
		],
		[
			'code' => "420528",
			'cn' => "长阳土家族自治县"
		],
		[
			'code' => "420529",
			'cn' => "五峰土家族自治县"
		],
		[
			'code' => "420551",
			'cn' => "葛洲坝区"
		],
		[
			'code' => "420552",
			'cn' => "开发区"
		],
		[
			'code' => "420581",
			'cn' => "宜都市"
		],
		[
			'code' => "420582",
			'cn' => "当阳市"
		],
		[
			'code' => "420583",
			'cn' => "枝江市"
		],
		[
			'code' => "420584",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420600",
		'cn' => "襄阳市",
		'children' => [
	[
			'code' => "420602",
			'cn' => "襄城区"
		],
		[
			'code' => "420606",
			'cn' => "樊城区"
		],
		[
			'code' => "420607",
			'cn' => "襄州区"
		],
		[
			'code' => "420624",
			'cn' => "南漳县"
		],
		[
			'code' => "420625",
			'cn' => "谷城县"
		],
		[
			'code' => "420626",
			'cn' => "保康县"
		],
		[
			'code' => "420682",
			'cn' => "老河口市"
		],
		[
			'code' => "420683",
			'cn' => "枣阳市"
		],
		[
			'code' => "420684",
			'cn' => "宜城市"
		],
		[
			'code' => "420685",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420700",
		'cn' => "鄂州市",
		'children' => [
	[
			'code' => "420702",
			'cn' => "梁子湖区"
		],
		[
			'code' => "420703",
			'cn' => "华容区"
		],
		[
			'code' => "420704",
			'cn' => "鄂城区"
		],
		[
			'code' => "420705",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420800",
		'cn' => "荆门市",
		'children' => [
	[
			'code' => "420802",
			'cn' => "东宝区"
		],
		[
			'code' => "420804",
			'cn' => "掇刀区"
		],
		[
			'code' => "420821",
			'cn' => "京山县"
		],
		[
			'code' => "420822",
			'cn' => "沙洋县"
		],
		[
			'code' => "420881",
			'cn' => "钟祥市"
		],
		[
			'code' => "420882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "420900",
		'cn' => "孝感市",
		'children' => [
	[
			'code' => "420902",
			'cn' => "孝南区"
		],
		[
			'code' => "420921",
			'cn' => "孝昌县"
		],
		[
			'code' => "420922",
			'cn' => "大悟县"
		],
		[
			'code' => "420923",
			'cn' => "云梦县"
		],
		[
			'code' => "420981",
			'cn' => "应城市"
		],
		[
			'code' => "420982",
			'cn' => "安陆市"
		],
		[
			'code' => "420984",
			'cn' => "汉川市"
		],
		[
			'code' => "420985",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "421000",
		'cn' => "荆州市",
		'children' => [
	[
			'code' => "421002",
			'cn' => "沙市区"
		],
		[
			'code' => "421003",
			'cn' => "荆州区"
		],
		[
			'code' => "421022",
			'cn' => "公安县"
		],
		[
			'code' => "421023",
			'cn' => "监利县"
		],
		[
			'code' => "421024",
			'cn' => "江陵县"
		],
		[
			'code' => "421081",
			'cn' => "石首市"
		],
		[
			'code' => "421083",
			'cn' => "洪湖市"
		],
		[
			'code' => "421087",
			'cn' => "松滋市"
		],
		[
			'code' => "421088",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "421100",
		'cn' => "黄冈市",
		'children' => [
	[
			'code' => "421102",
			'cn' => "黄州区"
		],
		[
			'code' => "421121",
			'cn' => "团风县"
		],
		[
			'code' => "421122",
			'cn' => "红安县"
		],
		[
			'code' => "421123",
			'cn' => "罗田县"
		],
		[
			'code' => "421124",
			'cn' => "英山县"
		],
		[
			'code' => "421125",
			'cn' => "浠水县"
		],
		[
			'code' => "421126",
			'cn' => "蕲春县"
		],
		[
			'code' => "421127",
			'cn' => "黄梅县"
		],
		[
			'code' => "421181",
			'cn' => "麻城市"
		],
		[
			'code' => "421182",
			'cn' => "武穴市"
		],
		[
			'code' => "421183",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "421200",
		'cn' => "咸宁市",
		'children' => [
	[
			'code' => "421202",
			'cn' => "咸安区"
		],
		[
			'code' => "421221",
			'cn' => "嘉鱼县"
		],
		[
			'code' => "421222",
			'cn' => "通城县"
		],
		[
			'code' => "421223",
			'cn' => "崇阳县"
		],
		[
			'code' => "421224",
			'cn' => "通山县"
		],
		[
			'code' => "421281",
			'cn' => "赤壁市"
		],
		[
			'code' => "421282",
			'cn' => "温泉城区"
		],
		[
			'code' => "421283",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "421300",
		'cn' => "随州市",
		'children' => [
	[
			'code' => "421302",
			'cn' => "曾都区"
		],
		[
			'code' => "421321",
			'cn' => "随县"
		],
		[
			'code' => "421381",
			'cn' => "广水市"
		],
		[
			'code' => "421382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "422800",
		'cn' => "恩施土家族苗族自治州",
		'children' => [
	[
			'code' => "422801",
			'cn' => "恩施市"
		],
		[
			'code' => "422802",
			'cn' => "利川市"
		],
		[
			'code' => "422822",
			'cn' => "建始县"
		],
		[
			'code' => "422823",
			'cn' => "巴东县"
		],
		[
			'code' => "422825",
			'cn' => "宣恩县"
		],
		[
			'code' => "422826",
			'cn' => "咸丰县"
		],
		[
			'code' => "422827",
			'cn' => "来凤县"
		],
		[
			'code' => "422828",
			'cn' => "鹤峰县"
		],
		[
			'code' => "422829",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "429004",
		'cn' => "仙桃市"
	],
		[
		'code' => "429005",
		'cn' => "潜江市"
	],
		[
		'code' => "429006",
		'cn' => "天门市"
	],
		[
		'code' => "429021",
		'cn' => "神农架林区"
	]
		]
],
		[
	'code' => '430000',
	'cn' => '湖南省',
	'children' => [
	[
		'code' => "430100",
		'cn' => "长沙市",
		'children' => [
	[
			'code' => "430102",
			'cn' => "芙蓉区"
		],
		[
			'code' => "430103",
			'cn' => "天心区"
		],
		[
			'code' => "430104",
			'cn' => "岳麓区"
		],
		[
			'code' => "430105",
			'cn' => "开福区"
		],
		[
			'code' => "430111",
			'cn' => "雨花区"
		],
		[
			'code' => "430121",
			'cn' => "长沙县"
		],
		[
			'code' => "430122",
			'cn' => "望城县"
		],
		[
			'code' => "430124",
			'cn' => "宁乡县"
		],
		[
			'code' => "430181",
			'cn' => "浏阳市"
		],
		[
			'code' => "430182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430200",
		'cn' => "株洲市",
		'children' => [
	[
			'code' => "430202",
			'cn' => "荷塘区"
		],
		[
			'code' => "430203",
			'cn' => "芦淞区"
		],
		[
			'code' => "430204",
			'cn' => "石峰区"
		],
		[
			'code' => "430211",
			'cn' => "天元区"
		],
		[
			'code' => "430221",
			'cn' => "株洲县"
		],
		[
			'code' => "430223",
			'cn' => "攸县"
		],
		[
			'code' => "430224",
			'cn' => "茶陵县"
		],
		[
			'code' => "430225",
			'cn' => "炎陵县"
		],
		[
			'code' => "430281",
			'cn' => "醴陵市"
		],
		[
			'code' => "430282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430300",
		'cn' => "湘潭市",
		'children' => [
	[
			'code' => "430302",
			'cn' => "雨湖区"
		],
		[
			'code' => "430304",
			'cn' => "岳塘区"
		],
		[
			'code' => "430321",
			'cn' => "湘潭县"
		],
		[
			'code' => "430381",
			'cn' => "湘乡市"
		],
		[
			'code' => "430382",
			'cn' => "韶山市"
		],
		[
			'code' => "430383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430400",
		'cn' => "衡阳市",
		'children' => [
	[
			'code' => "430405",
			'cn' => "珠晖区"
		],
		[
			'code' => "430406",
			'cn' => "雁峰区"
		],
		[
			'code' => "430407",
			'cn' => "石鼓区"
		],
		[
			'code' => "430408",
			'cn' => "蒸湘区"
		],
		[
			'code' => "430412",
			'cn' => "南岳区"
		],
		[
			'code' => "430421",
			'cn' => "衡阳县"
		],
		[
			'code' => "430422",
			'cn' => "衡南县"
		],
		[
			'code' => "430423",
			'cn' => "衡山县"
		],
		[
			'code' => "430424",
			'cn' => "衡东县"
		],
		[
			'code' => "430426",
			'cn' => "祁东县"
		],
		[
			'code' => "430481",
			'cn' => "耒阳市"
		],
		[
			'code' => "430482",
			'cn' => "常宁市"
		],
		[
			'code' => "430483",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430500",
		'cn' => "邵阳市",
		'children' => [
	[
			'code' => "430502",
			'cn' => "双清区"
		],
		[
			'code' => "430503",
			'cn' => "大祥区"
		],
		[
			'code' => "430511",
			'cn' => "北塔区"
		],
		[
			'code' => "430521",
			'cn' => "邵东县"
		],
		[
			'code' => "430522",
			'cn' => "新邵县"
		],
		[
			'code' => "430523",
			'cn' => "邵阳县"
		],
		[
			'code' => "430524",
			'cn' => "隆回县"
		],
		[
			'code' => "430525",
			'cn' => "洞口县"
		],
		[
			'code' => "430527",
			'cn' => "绥宁县"
		],
		[
			'code' => "430528",
			'cn' => "新宁县"
		],
		[
			'code' => "430529",
			'cn' => "城步苗族自治县"
		],
		[
			'code' => "430581",
			'cn' => "武冈市"
		],
		[
			'code' => "430582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430600",
		'cn' => "岳阳市",
		'children' => [
	[
			'code' => "430602",
			'cn' => "岳阳楼区"
		],
		[
			'code' => "430603",
			'cn' => "云溪区"
		],
		[
			'code' => "430611",
			'cn' => "君山区"
		],
		[
			'code' => "430621",
			'cn' => "岳阳县"
		],
		[
			'code' => "430623",
			'cn' => "华容县"
		],
		[
			'code' => "430624",
			'cn' => "湘阴县"
		],
		[
			'code' => "430626",
			'cn' => "平江县"
		],
		[
			'code' => "430681",
			'cn' => "汨罗市"
		],
		[
			'code' => "430682",
			'cn' => "临湘市"
		],
		[
			'code' => "430683",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430700",
		'cn' => "常德市",
		'children' => [
	[
			'code' => "430702",
			'cn' => "武陵区"
		],
		[
			'code' => "430703",
			'cn' => "鼎城区"
		],
		[
			'code' => "430721",
			'cn' => "安乡县"
		],
		[
			'code' => "430722",
			'cn' => "汉寿县"
		],
		[
			'code' => "430723",
			'cn' => "澧县"
		],
		[
			'code' => "430724",
			'cn' => "临澧县"
		],
		[
			'code' => "430725",
			'cn' => "桃源县"
		],
		[
			'code' => "430726",
			'cn' => "石门县"
		],
		[
			'code' => "430781",
			'cn' => "津市市"
		],
		[
			'code' => "430782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430800",
		'cn' => "张家界市",
		'children' => [
	[
			'code' => "430802",
			'cn' => "永定区"
		],
		[
			'code' => "430811",
			'cn' => "武陵源区"
		],
		[
			'code' => "430821",
			'cn' => "慈利县"
		],
		[
			'code' => "430822",
			'cn' => "桑植县"
		],
		[
			'code' => "430823",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "430900",
		'cn' => "益阳市",
		'children' => [
	[
			'code' => "430902",
			'cn' => "资阳区"
		],
		[
			'code' => "430903",
			'cn' => "赫山区"
		],
		[
			'code' => "430921",
			'cn' => "南县"
		],
		[
			'code' => "430922",
			'cn' => "桃江县"
		],
		[
			'code' => "430923",
			'cn' => "安化县"
		],
		[
			'code' => "430981",
			'cn' => "沅江市"
		],
		[
			'code' => "430982",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "431000",
		'cn' => "郴州市",
		'children' => [
	[
			'code' => "431002",
			'cn' => "北湖区"
		],
		[
			'code' => "431003",
			'cn' => "苏仙区"
		],
		[
			'code' => "431021",
			'cn' => "桂阳县"
		],
		[
			'code' => "431022",
			'cn' => "宜章县"
		],
		[
			'code' => "431023",
			'cn' => "永兴县"
		],
		[
			'code' => "431024",
			'cn' => "嘉禾县"
		],
		[
			'code' => "431025",
			'cn' => "临武县"
		],
		[
			'code' => "431026",
			'cn' => "汝城县"
		],
		[
			'code' => "431027",
			'cn' => "桂东县"
		],
		[
			'code' => "431028",
			'cn' => "安仁县"
		],
		[
			'code' => "431081",
			'cn' => "资兴市"
		],
		[
			'code' => "431082",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "431100",
		'cn' => "永州市",
		'children' => [
	[
			'code' => "431102",
			'cn' => "零陵区"
		],
		[
			'code' => "431103",
			'cn' => "冷水滩区"
		],
		[
			'code' => "431121",
			'cn' => "祁阳县"
		],
		[
			'code' => "431122",
			'cn' => "东安县"
		],
		[
			'code' => "431123",
			'cn' => "双牌县"
		],
		[
			'code' => "431124",
			'cn' => "道县"
		],
		[
			'code' => "431125",
			'cn' => "江永县"
		],
		[
			'code' => "431126",
			'cn' => "宁远县"
		],
		[
			'code' => "431127",
			'cn' => "蓝山县"
		],
		[
			'code' => "431128",
			'cn' => "新田县"
		],
		[
			'code' => "431129",
			'cn' => "江华瑶族自治县"
		],
		[
			'code' => "431130",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "431200",
		'cn' => "怀化市",
		'children' => [
	[
			'code' => "431202",
			'cn' => "鹤城区"
		],
		[
			'code' => "431221",
			'cn' => "中方县"
		],
		[
			'code' => "431222",
			'cn' => "沅陵县"
		],
		[
			'code' => "431223",
			'cn' => "辰溪县"
		],
		[
			'code' => "431224",
			'cn' => "溆浦县"
		],
		[
			'code' => "431225",
			'cn' => "会同县"
		],
		[
			'code' => "431226",
			'cn' => "麻阳苗族自治县"
		],
		[
			'code' => "431227",
			'cn' => "新晃侗族自治县"
		],
		[
			'code' => "431228",
			'cn' => "芷江侗族自治县"
		],
		[
			'code' => "431229",
			'cn' => "靖州苗族侗族自治县"
		],
		[
			'code' => "431230",
			'cn' => "通道侗族自治县"
		],
		[
			'code' => "431281",
			'cn' => "洪江市"
		],
		[
			'code' => "431282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "431300",
		'cn' => "娄底市",
		'children' => [
	[
			'code' => "431302",
			'cn' => "娄星区"
		],
		[
			'code' => "431321",
			'cn' => "双峰县"
		],
		[
			'code' => "431322",
			'cn' => "新化县"
		],
		[
			'code' => "431381",
			'cn' => "冷水江市"
		],
		[
			'code' => "431382",
			'cn' => "涟源市"
		],
		[
			'code' => "431383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "433100",
		'cn' => "湘西土家族苗族自治州",
		'children' => [
	[
			'code' => "433101",
			'cn' => "吉首市"
		],
		[
			'code' => "433122",
			'cn' => "泸溪县"
		],
		[
			'code' => "433123",
			'cn' => "凤凰县"
		],
		[
			'code' => "433124",
			'cn' => "花垣县"
		],
		[
			'code' => "433125",
			'cn' => "保靖县"
		],
		[
			'code' => "433126",
			'cn' => "古丈县"
		],
		[
			'code' => "433127",
			'cn' => "永顺县"
		],
		[
			'code' => "433130",
			'cn' => "龙山县"
		],
		[
			'code' => "433131",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '440000',
	'cn' => '广东省',
	'children' => [
	[
		'code' => "440100",
		'cn' => "广州市",
		'children' => [
	[
			'code' => "440103",
			'cn' => "荔湾区"
		],
		[
			'code' => "440104",
			'cn' => "越秀区"
		],
		[
			'code' => "440105",
			'cn' => "海珠区"
		],
		[
			'code' => "440106",
			'cn' => "天河区"
		],
		[
			'code' => "440111",
			'cn' => "白云区"
		],
		[
			'code' => "440112",
			'cn' => "黄埔区"
		],
		[
			'code' => "440113",
			'cn' => "番禺区"
		],
		[
			'code' => "440114",
			'cn' => "花都区"
		],
		[
			'code' => "440115",
			'cn' => "南沙区"
		],
		[
			'code' => "440116",
			'cn' => "萝岗区"
		],
		[
			'code' => "440183",
			'cn' => "增城市"
		],
		[
			'code' => "440184",
			'cn' => "从化市"
		],
		[
			'code' => "440188",
			'cn' => "东山区"
		],
		[
			'code' => "440189",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440200",
		'cn' => "韶关市",
		'children' => [
	[
			'code' => "440203",
			'cn' => "武江区"
		],
		[
			'code' => "440204",
			'cn' => "浈江区"
		],
		[
			'code' => "440205",
			'cn' => "曲江区"
		],
		[
			'code' => "440222",
			'cn' => "始兴县"
		],
		[
			'code' => "440224",
			'cn' => "仁化县"
		],
		[
			'code' => "440229",
			'cn' => "翁源县"
		],
		[
			'code' => "440232",
			'cn' => "乳源瑶族自治县"
		],
		[
			'code' => "440233",
			'cn' => "新丰县"
		],
		[
			'code' => "440281",
			'cn' => "乐昌市"
		],
		[
			'code' => "440282",
			'cn' => "南雄市"
		],
		[
			'code' => "440283",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440300",
		'cn' => "深圳市",
		'children' => [
	[
			'code' => "440303",
			'cn' => "罗湖区"
		],
		[
			'code' => "440304",
			'cn' => "福田区"
		],
		[
			'code' => "440305",
			'cn' => "南山区"
		],
		[
			'code' => "440306",
			'cn' => "宝安区"
		],
		[
			'code' => "440307",
			'cn' => "龙岗区"
		],
		[
			'code' => "440308",
			'cn' => "盐田区"
		],
		[
			'code' => "440309",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440400",
		'cn' => "珠海市",
		'children' => [
	[
			'code' => "440402",
			'cn' => "香洲区"
		],
		[
			'code' => "440403",
			'cn' => "斗门区"
		],
		[
			'code' => "440404",
			'cn' => "金湾区"
		],
		[
			'code' => "440486",
			'cn' => "金唐区"
		],
		[
			'code' => "440487",
			'cn' => "南湾区"
		],
		[
			'code' => "440488",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440500",
		'cn' => "汕头市",
		'children' => [
	[
			'code' => "440507",
			'cn' => "龙湖区"
		],
		[
			'code' => "440511",
			'cn' => "金平区"
		],
		[
			'code' => "440512",
			'cn' => "濠江区"
		],
		[
			'code' => "440513",
			'cn' => "潮阳区"
		],
		[
			'code' => "440514",
			'cn' => "潮南区"
		],
		[
			'code' => "440515",
			'cn' => "澄海区"
		],
		[
			'code' => "440523",
			'cn' => "南澳县"
		],
		[
			'code' => "440524",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440600",
		'cn' => "佛山市",
		'children' => [
	[
			'code' => "440604",
			'cn' => "禅城区"
		],
		[
			'code' => "440605",
			'cn' => "南海区"
		],
		[
			'code' => "440606",
			'cn' => "顺德区"
		],
		[
			'code' => "440607",
			'cn' => "三水区"
		],
		[
			'code' => "440608",
			'cn' => "高明区"
		],
		[
			'code' => "440609",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440700",
		'cn' => "江门市",
		'children' => [
	[
			'code' => "440703",
			'cn' => "蓬江区"
		],
		[
			'code' => "440704",
			'cn' => "江海区"
		],
		[
			'code' => "440705",
			'cn' => "新会区"
		],
		[
			'code' => "440781",
			'cn' => "台山市"
		],
		[
			'code' => "440783",
			'cn' => "开平市"
		],
		[
			'code' => "440784",
			'cn' => "鹤山市"
		],
		[
			'code' => "440785",
			'cn' => "恩平市"
		],
		[
			'code' => "440786",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440800",
		'cn' => "湛江市",
		'children' => [
	[
			'code' => "440802",
			'cn' => "赤坎区"
		],
		[
			'code' => "440803",
			'cn' => "霞山区"
		],
		[
			'code' => "440804",
			'cn' => "坡头区"
		],
		[
			'code' => "440811",
			'cn' => "麻章区"
		],
		[
			'code' => "440823",
			'cn' => "遂溪县"
		],
		[
			'code' => "440825",
			'cn' => "徐闻县"
		],
		[
			'code' => "440881",
			'cn' => "廉江市"
		],
		[
			'code' => "440882",
			'cn' => "雷州市"
		],
		[
			'code' => "440883",
			'cn' => "吴川市"
		],
		[
			'code' => "440884",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "440900",
		'cn' => "茂名市",
		'children' => [
	[
			'code' => "440902",
			'cn' => "茂南区"
		],
		[
			'code' => "440903",
			'cn' => "茂港区"
		],
		[
			'code' => "440923",
			'cn' => "电白县"
		],
		[
			'code' => "440981",
			'cn' => "高州市"
		],
		[
			'code' => "440982",
			'cn' => "化州市"
		],
		[
			'code' => "440983",
			'cn' => "信宜市"
		],
		[
			'code' => "440984",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441200",
		'cn' => "肇庆市",
		'children' => [
	[
			'code' => "441202",
			'cn' => "端州区"
		],
		[
			'code' => "441203",
			'cn' => "鼎湖区"
		],
		[
			'code' => "441223",
			'cn' => "广宁县"
		],
		[
			'code' => "441224",
			'cn' => "怀集县"
		],
		[
			'code' => "441225",
			'cn' => "封开县"
		],
		[
			'code' => "441226",
			'cn' => "德庆县"
		],
		[
			'code' => "441283",
			'cn' => "高要市"
		],
		[
			'code' => "441284",
			'cn' => "四会市"
		],
		[
			'code' => "441285",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441300",
		'cn' => "惠州市",
		'children' => [
	[
			'code' => "441302",
			'cn' => "惠城区"
		],
		[
			'code' => "441303",
			'cn' => "惠阳区"
		],
		[
			'code' => "441322",
			'cn' => "博罗县"
		],
		[
			'code' => "441323",
			'cn' => "惠东县"
		],
		[
			'code' => "441324",
			'cn' => "龙门县"
		],
		[
			'code' => "441325",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441400",
		'cn' => "梅州市",
		'children' => [
	[
			'code' => "441402",
			'cn' => "梅江区"
		],
		[
			'code' => "441421",
			'cn' => "梅县"
		],
		[
			'code' => "441422",
			'cn' => "大埔县"
		],
		[
			'code' => "441423",
			'cn' => "丰顺县"
		],
		[
			'code' => "441424",
			'cn' => "五华县"
		],
		[
			'code' => "441426",
			'cn' => "平远县"
		],
		[
			'code' => "441427",
			'cn' => "蕉岭县"
		],
		[
			'code' => "441481",
			'cn' => "兴宁市"
		],
		[
			'code' => "441482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441500",
		'cn' => "汕尾市",
		'children' => [
	[
			'code' => "441502",
			'cn' => "城区"
		],
		[
			'code' => "441521",
			'cn' => "海丰县"
		],
		[
			'code' => "441523",
			'cn' => "陆河县"
		],
		[
			'code' => "441581",
			'cn' => "陆丰市"
		],
		[
			'code' => "441582",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441600",
		'cn' => "河源市",
		'children' => [
	[
			'code' => "441602",
			'cn' => "源城区"
		],
		[
			'code' => "441621",
			'cn' => "紫金县"
		],
		[
			'code' => "441622",
			'cn' => "龙川县"
		],
		[
			'code' => "441623",
			'cn' => "连平县"
		],
		[
			'code' => "441624",
			'cn' => "和平县"
		],
		[
			'code' => "441625",
			'cn' => "东源县"
		],
		[
			'code' => "441626",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441700",
		'cn' => "阳江市",
		'children' => [
	[
			'code' => "441702",
			'cn' => "江城区"
		],
		[
			'code' => "441721",
			'cn' => "阳西县"
		],
		[
			'code' => "441723",
			'cn' => "阳东县"
		],
		[
			'code' => "441781",
			'cn' => "阳春市"
		],
		[
			'code' => "441782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441800",
		'cn' => "清远市",
		'children' => [
	[
			'code' => "441802",
			'cn' => "清城区"
		],
		[
			'code' => "441821",
			'cn' => "佛冈县"
		],
		[
			'code' => "441823",
			'cn' => "阳山县"
		],
		[
			'code' => "441825",
			'cn' => "连山壮族瑶族自治县"
		],
		[
			'code' => "441826",
			'cn' => "连南瑶族自治县"
		],
		[
			'code' => "441827",
			'cn' => "清新县"
		],
		[
			'code' => "441881",
			'cn' => "英德市"
		],
		[
			'code' => "441882",
			'cn' => "连州市"
		],
		[
			'code' => "441883",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "441900",
		'cn' => "东莞市"
	],
		[
		'code' => "442000",
		'cn' => "中山市"
	],
		[
		'code' => "445100",
		'cn' => "潮州市",
		'children' => [
	[
			'code' => "445102",
			'cn' => "湘桥区"
		],
		[
			'code' => "445121",
			'cn' => "潮安县"
		],
		[
			'code' => "445122",
			'cn' => "饶平县"
		],
		[
			'code' => "445185",
			'cn' => "枫溪区"
		],
		[
			'code' => "445186",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "445200",
		'cn' => "揭阳市",
		'children' => [
	[
			'code' => "445202",
			'cn' => "榕城区"
		],
		[
			'code' => "445221",
			'cn' => "揭东县"
		],
		[
			'code' => "445222",
			'cn' => "揭西县"
		],
		[
			'code' => "445224",
			'cn' => "惠来县"
		],
		[
			'code' => "445281",
			'cn' => "普宁市"
		],
		[
			'code' => "445284",
			'cn' => "东山区"
		],
		[
			'code' => "445285",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "445300",
		'cn' => "云浮市",
		'children' => [
	[
			'code' => "445302",
			'cn' => "云城区"
		],
		[
			'code' => "445321",
			'cn' => "新兴县"
		],
		[
			'code' => "445322",
			'cn' => "郁南县"
		],
		[
			'code' => "445323",
			'cn' => "云安县"
		],
		[
			'code' => "445381",
			'cn' => "罗定市"
		],
		[
			'code' => "445382",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '450000',
	'cn' => '广西壮族',
	'children' => [
	[
		'code' => "450100",
		'cn' => "南宁市",
		'children' => [
	[
			'code' => "450102",
			'cn' => "兴宁区"
		],
		[
			'code' => "450103",
			'cn' => "青秀区"
		],
		[
			'code' => "450105",
			'cn' => "江南区"
		],
		[
			'code' => "450107",
			'cn' => "西乡塘区"
		],
		[
			'code' => "450108",
			'cn' => "良庆区"
		],
		[
			'code' => "450109",
			'cn' => "邕宁区"
		],
		[
			'code' => "450122",
			'cn' => "武鸣县"
		],
		[
			'code' => "450123",
			'cn' => "隆安县"
		],
		[
			'code' => "450124",
			'cn' => "马山县"
		],
		[
			'code' => "450125",
			'cn' => "上林县"
		],
		[
			'code' => "450126",
			'cn' => "宾阳县"
		],
		[
			'code' => "450127",
			'cn' => "横县"
		],
		[
			'code' => "450128",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450200",
		'cn' => "柳州市",
		'children' => [
	[
			'code' => "450202",
			'cn' => "城中区"
		],
		[
			'code' => "450203",
			'cn' => "鱼峰区"
		],
		[
			'code' => "450204",
			'cn' => "柳南区"
		],
		[
			'code' => "450205",
			'cn' => "柳北区"
		],
		[
			'code' => "450221",
			'cn' => "柳江县"
		],
		[
			'code' => "450222",
			'cn' => "柳城县"
		],
		[
			'code' => "450223",
			'cn' => "鹿寨县"
		],
		[
			'code' => "450224",
			'cn' => "融安县"
		],
		[
			'code' => "450225",
			'cn' => "融水苗族自治县"
		],
		[
			'code' => "450226",
			'cn' => "三江侗族自治县"
		],
		[
			'code' => "450227",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450300",
		'cn' => "桂林市",
		'children' => [
	[
			'code' => "450302",
			'cn' => "秀峰区"
		],
		[
			'code' => "450303",
			'cn' => "叠彩区"
		],
		[
			'code' => "450304",
			'cn' => "象山区"
		],
		[
			'code' => "450305",
			'cn' => "七星区"
		],
		[
			'code' => "450311",
			'cn' => "雁山区"
		],
		[
			'code' => "450321",
			'cn' => "阳朔县"
		],
		[
			'code' => "450322",
			'cn' => "临桂县"
		],
		[
			'code' => "450323",
			'cn' => "灵川县"
		],
		[
			'code' => "450324",
			'cn' => "全州县"
		],
		[
			'code' => "450325",
			'cn' => "兴安县"
		],
		[
			'code' => "450326",
			'cn' => "永福县"
		],
		[
			'code' => "450327",
			'cn' => "灌阳县"
		],
		[
			'code' => "450328",
			'cn' => "龙胜各族自治县"
		],
		[
			'code' => "450329",
			'cn' => "资源县"
		],
		[
			'code' => "450330",
			'cn' => "平乐县"
		],
		[
			'code' => "450331",
			'cn' => "荔浦县"
		],
		[
			'code' => "450332",
			'cn' => "恭城瑶族自治县"
		],
		[
			'code' => "450333",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450400",
		'cn' => "梧州市",
		'children' => [
	[
			'code' => "450403",
			'cn' => "万秀区"
		],
		[
			'code' => "450404",
			'cn' => "蝶山区"
		],
		[
			'code' => "450405",
			'cn' => "长洲区"
		],
		[
			'code' => "450421",
			'cn' => "苍梧县"
		],
		[
			'code' => "450422",
			'cn' => "藤县"
		],
		[
			'code' => "450423",
			'cn' => "蒙山县"
		],
		[
			'code' => "450481",
			'cn' => "岑溪市"
		],
		[
			'code' => "450482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450500",
		'cn' => "北海市",
		'children' => [
	[
			'code' => "450502",
			'cn' => "海城区"
		],
		[
			'code' => "450503",
			'cn' => "银海区"
		],
		[
			'code' => "450512",
			'cn' => "铁山港区"
		],
		[
			'code' => "450521",
			'cn' => "合浦县"
		],
		[
			'code' => "450522",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450600",
		'cn' => "防城港市",
		'children' => [
	[
			'code' => "450602",
			'cn' => "港口区"
		],
		[
			'code' => "450603",
			'cn' => "防城区"
		],
		[
			'code' => "450621",
			'cn' => "上思县"
		],
		[
			'code' => "450681",
			'cn' => "东兴市"
		],
		[
			'code' => "450682",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450700",
		'cn' => "钦州市",
		'children' => [
	[
			'code' => "450702",
			'cn' => "钦南区"
		],
		[
			'code' => "450703",
			'cn' => "钦北区"
		],
		[
			'code' => "450721",
			'cn' => "灵山县"
		],
		[
			'code' => "450722",
			'cn' => "浦北县"
		],
		[
			'code' => "450723",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450800",
		'cn' => "贵港市",
		'children' => [
	[
			'code' => "450802",
			'cn' => "港北区"
		],
		[
			'code' => "450803",
			'cn' => "港南区"
		],
		[
			'code' => "450804",
			'cn' => "覃塘区"
		],
		[
			'code' => "450821",
			'cn' => "平南县"
		],
		[
			'code' => "450881",
			'cn' => "桂平市"
		],
		[
			'code' => "450882",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "450900",
		'cn' => "玉林市",
		'children' => [
	[
			'code' => "450902",
			'cn' => "玉州区"
		],
		[
			'code' => "450921",
			'cn' => "容县"
		],
		[
			'code' => "450922",
			'cn' => "陆川县"
		],
		[
			'code' => "450923",
			'cn' => "博白县"
		],
		[
			'code' => "450924",
			'cn' => "兴业县"
		],
		[
			'code' => "450981",
			'cn' => "北流市"
		],
		[
			'code' => "450982",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "451000",
		'cn' => "百色市",
		'children' => [
	[
			'code' => "451002",
			'cn' => "右江区"
		],
		[
			'code' => "451021",
			'cn' => "田阳县"
		],
		[
			'code' => "451022",
			'cn' => "田东县"
		],
		[
			'code' => "451023",
			'cn' => "平果县"
		],
		[
			'code' => "451024",
			'cn' => "德保县"
		],
		[
			'code' => "451025",
			'cn' => "靖西县"
		],
		[
			'code' => "451026",
			'cn' => "那坡县"
		],
		[
			'code' => "451027",
			'cn' => "凌云县"
		],
		[
			'code' => "451028",
			'cn' => "乐业县"
		],
		[
			'code' => "451029",
			'cn' => "田林县"
		],
		[
			'code' => "451030",
			'cn' => "西林县"
		],
		[
			'code' => "451031",
			'cn' => "隆林各族自治县"
		],
		[
			'code' => "451032",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "451100",
		'cn' => "贺州市",
		'children' => [
	[
				'code' => "451102",
				'cn' => "八步区"
			],
		[
				'code' => "451121",
				'cn' => "昭平县"
			],
		[
				'code' => "451122",
				'cn' => "钟山县"
			],
		[
				'code' => "451123",
				'cn' => "富川瑶族自治县"
			],

			[
				'code' => "451124",
				'cn' => "其它区"
			]
		]
	],
		[
		'code' => "451200",
		'cn' => "河池市",
		'children' => [
	[
			'code' => "451202",
			'cn' => "金城江区"
		],
		[
			'code' => "451221",
			'cn' => "南丹县"
		],
		[
			'code' => "451222",
			'cn' => "天峨县"
		],
		[
			'code' => "451223",
			'cn' => "凤山县"
		],
		[
			'code' => "451224",
			'cn' => "东兰县"
		],
		[
			'code' => "451225",
			'cn' => "罗城仫佬族自治县"
		],
		[
			'code' => "451226",
			'cn' => "环江毛南族自治县"
		],
		[
			'code' => "451227",
			'cn' => "巴马瑶族自治县"
		],
		[
			'code' => "451228",
			'cn' => "都安瑶族自治县"
		],
		[
			'code' => "451229",
			'cn' => "大化瑶族自治县"
		],
		[
			'code' => "451281",
			'cn' => "宜州市"
		],
		[
			'code' => "451282",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "451300",
		'cn' => "来宾市",
		'children' => [
	[
			'code' => "451302",
			'cn' => "兴宾区"
		],
		[
			'code' => "451321",
			'cn' => "忻城县"
		],
		[
			'code' => "451322",
			'cn' => "象州县"
		],
		[
			'code' => "451323",
			'cn' => "武宣县"
		],
		[
			'code' => "451324",
			'cn' => "金秀瑶族自治县"
		],
		[
			'code' => "451381",
			'cn' => "合山市"
		],
		[
			'code' => "451382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "451400",
		'cn' => "崇左市",
		'children' => [
	[
			'code' => "451402",
			'cn' => "江洲区"
		],
		[
			'code' => "451421",
			'cn' => "扶绥县"
		],
		[
			'code' => "451422",
			'cn' => "宁明县"
		],
		[
			'code' => "451423",
			'cn' => "龙州县"
		],
		[
			'code' => "451424",
			'cn' => "大新县"
		],
		[
			'code' => "451425",
			'cn' => "天等县"
		],
		[
			'code' => "451481",
			'cn' => "凭祥市"
		],
		[
			'code' => "451482",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '460000',
	'cn' => '海南省',
	'children' => [
	[
		'code' => "460100",
		'cn' => "海口市",
		'children' => [
	[
			'code' => "460105",
			'cn' => "秀英区"
		],
		[
			'code' => "460106",
			'cn' => "龙华区"
		],
		[
			'code' => "460107",
			'cn' => "琼山区"
		],
		[
			'code' => "460108",
			'cn' => "美兰区"
		],
		[
			'code' => "460109",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "460200",
		'cn' => "三亚市",
		'children' => [
	[
			'code' => "460202",
			'cn' => "海棠区"
		],
		[
			'code' => "460203",
			'cn' => "吉阳区"
		],
		[
			'code' => "460204",
			'cn' => "天涯区"
		],
		[
			'code' => "460205",
			'cn' => "崖州区"
		]
		]
	],
		[
		'code' => "469001",
		'cn' => "五指山市"
	],
		[
		'code' => "469002",
		'cn' => "琼海市"
	],
		[
		'code' => "469003",
		'cn' => "儋州市"
	],
		[
		'code' => "469005",
		'cn' => "文昌市"
	],
		[
		'code' => "469006",
		'cn' => "万宁市"
	],
		[
		'code' => "469007",
		'cn' => "东方市"
	],
		[
		'code' => "469025",
		'cn' => "定安县"
	],
		[
		'code' => "469026",
		'cn' => "屯昌县"
	],
		[
		'code' => "469027",
		'cn' => "澄迈县"
	],
		[
		'code' => "469028",
		'cn' => "临高县"
	],
		[
		'code' => "469030",
		'cn' => "白沙黎族自治县"
	],
		[
		'code' => "469031",
		'cn' => "昌江黎族自治县"
	],
		[
		'code' => "469033",
		'cn' => "乐东黎族自治县"
	],
		[
		'code' => "469034",
		'cn' => "陵水黎族自治县"
	],
		[
		'code' => "469035",
		'cn' => "保亭黎族苗族自治县"
	],
		[
		'code' => "469036",
		'cn' => "琼中黎族苗族自治县"
	],
		[
		'code' => "469037",
		'cn' => "西沙群岛"
	],
		[
		'code' => "469038",
		'cn' => "南沙群岛"
	],
		[
		'code' => "469039",
		'cn' => "中沙群岛的岛礁及其海域"
	]
		]
],
		[
	'code' => '500000',
	'cn' => '重庆',
	'children' => [
	[
		'code' => '500000',
		'cn' => '重庆',
		'children' => [
	[
			'code' => "500101",
			'cn' => "万州区"
		],
		[
			'code' => "500102",
			'cn' => "涪陵区"
		],
		[
			'code' => "500103",
			'cn' => "渝中区"
		],
		[
			'code' => "500104",
			'cn' => "大渡口区"
		],
		[
			'code' => "500105",
			'cn' => "江北区"
		],
		[
			'code' => "500106",
			'cn' => "沙坪坝区"
		],
		[
			'code' => "500107",
			'cn' => "九龙坡区"
		],
		[
			'code' => "500108",
			'cn' => "南岸区"
		],
		[
			'code' => "500109",
			'cn' => "北碚区"
		],
		[
			'code' => "500110",
			'cn' => "万盛区"
		],
		[
			'code' => "500111",
			'cn' => "双桥区"
		],
		[
			'code' => "500112",
			'cn' => "渝北区"
		],
		[
			'code' => "500113",
			'cn' => "巴南区"
		],
		[
			'code' => "500114",
			'cn' => "黔江区"
		],
		[
			'code' => "500115",
			'cn' => "长寿区"
		],
		[
			'code' => "500222",
			'cn' => "綦江县"
		],
		[
			'code' => "500223",
			'cn' => "潼南县"
		],
		[
			'code' => "500224",
			'cn' => "铜梁县"
		],
		[
			'code' => "500225",
			'cn' => "大足县"
		],
		[
			'code' => "500226",
			'cn' => "荣昌县"
		],
		[
			'code' => "500227",
			'cn' => "璧山县"
		],
		[
			'code' => "500228",
			'cn' => "梁平县"
		],
		[
			'code' => "500229",
			'cn' => "城口县"
		],
		[
			'code' => "500230",
			'cn' => "丰都县"
		],
		[
			'code' => "500231",
			'cn' => "垫江县"
		],
		[
			'code' => "500232",
			'cn' => "武隆县"
		],
		[
			'code' => "500233",
			'cn' => "忠县"
		],
		[
			'code' => "500234",
			'cn' => "开县"
		],
		[
			'code' => "500235",
			'cn' => "云阳县"
		],
		[
			'code' => "500236",
			'cn' => "奉节县"
		],
		[
			'code' => "500237",
			'cn' => "巫山县"
		],
		[
			'code' => "500238",
			'cn' => "巫溪县"
		],
		[
			'code' => "500240",
			'cn' => "石柱土家族自治县"
		],
		[
			'code' => "500241",
			'cn' => "秀山土家族苗族自治县"
		],
		[
			'code' => "500242",
			'cn' => "酉阳土家族苗族自治县"
		],
		[
			'code' => "500243",
			'cn' => "彭水苗族土家族自治县"
		],
		[
			'code' => "500381",
			'cn' => "江津区"
		],
		[
			'code' => "500382",
			'cn' => "合川区"
		],
		[
			'code' => "500383",
			'cn' => "永川区"
		],
		[
			'code' => "500384",
			'cn' => "南川区"
		],
		[
			'code' => "500385",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '510000',
	'cn' => '四川省',
	'children' => [
	[
		'code' => "510100",
		'cn' => "成都市",
		'children' => [
	[
			'code' => "510104",
			'cn' => "锦江区"
		],
		[
			'code' => "510105",
			'cn' => "青羊区"
		],
		[
			'code' => "510106",
			'cn' => "金牛区"
		],
		[
			'code' => "510107",
			'cn' => "武侯区"
		],
		[
			'code' => "510108",
			'cn' => "成华区"
		],
		[
			'code' => "510112",
			'cn' => "龙泉驿区"
		],
		[
			'code' => "510113",
			'cn' => "青白江区"
		],
		[
			'code' => "510114",
			'cn' => "新都区"
		],
		[
			'code' => "510115",
			'cn' => "温江区"
		],
		[
			'code' => "510121",
			'cn' => "金堂县"
		],
		[
			'code' => "510122",
			'cn' => "双流县"
		],
		[
			'code' => "510124",
			'cn' => "郫县"
		],
		[
			'code' => "510129",
			'cn' => "大邑县"
		],
		[
			'code' => "510131",
			'cn' => "蒲江县"
		],
		[
			'code' => "510132",
			'cn' => "新津县"
		],
		[
			'code' => "510181",
			'cn' => "都江堰市"
		],
		[
			'code' => "510182",
			'cn' => "彭州市"
		],
		[
			'code' => "510183",
			'cn' => "邛崃市"
		],
		[
			'code' => "510184",
			'cn' => "崇州市"
		],
		[
			'code' => "510185",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510300",
		'cn' => "自贡市",
		'children' => [
	[
			'code' => "510302",
			'cn' => "自流井区"
		],
		[
			'code' => "510303",
			'cn' => "贡井区"
		],
		[
			'code' => "510304",
			'cn' => "大安区"
		],
		[
			'code' => "510311",
			'cn' => "沿滩区"
		],
		[
			'code' => "510321",
			'cn' => "荣县"
		],
		[
			'code' => "510322",
			'cn' => "富顺县"
		],
		[
			'code' => "510323",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510400",
		'cn' => "攀枝花市",
		'children' => [
	[
			'code' => "510402",
			'cn' => "东区"
		],
		[
			'code' => "510403",
			'cn' => "西区"
		],
		[
			'code' => "510411",
			'cn' => "仁和区"
		],
		[
			'code' => "510421",
			'cn' => "米易县"
		],
		[
			'code' => "510422",
			'cn' => "盐边县"
		],
		[
			'code' => "510423",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510500",
		'cn' => "泸州市",
		'children' => [
	[
			'code' => "510502",
			'cn' => "江阳区"
		],
		[
			'code' => "510503",
			'cn' => "纳溪区"
		],
		[
			'code' => "510504",
			'cn' => "龙马潭区"
		],
		[
			'code' => "510521",
			'cn' => "泸县"
		],
		[
			'code' => "510522",
			'cn' => "合江县"
		],
		[
			'code' => "510524",
			'cn' => "叙永县"
		],
		[
			'code' => "510525",
			'cn' => "古蔺县"
		],
		[
			'code' => "510526",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510600",
		'cn' => "德阳市",
		'children' => [
	[
			'code' => "510603",
			'cn' => "旌阳区"
		],
		[
			'code' => "510623",
			'cn' => "中江县"
		],
		[
			'code' => "510626",
			'cn' => "罗江县"
		],
		[
			'code' => "510681",
			'cn' => "广汉市"
		],
		[
			'code' => "510682",
			'cn' => "什邡市"
		],
		[
			'code' => "510683",
			'cn' => "绵竹市"
		],
		[
			'code' => "510684",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510700",
		'cn' => "绵阳市",
		'children' => [
	[
			'code' => "510703",
			'cn' => "涪城区"
		],
		[
			'code' => "510704",
			'cn' => "游仙区"
		],
		[
			'code' => "510722",
			'cn' => "三台县"
		],
		[
			'code' => "510723",
			'cn' => "盐亭县"
		],
		[
			'code' => "510724",
			'cn' => "安县"
		],
		[
			'code' => "510725",
			'cn' => "梓潼县"
		],
		[
			'code' => "510726",
			'cn' => "北川羌族自治县"
		],
		[
			'code' => "510727",
			'cn' => "平武县"
		],
		[
			'code' => "510751",
			'cn' => "高新区"
		],
		[
			'code' => "510781",
			'cn' => "江油市"
		],
		[
			'code' => "510782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510800",
		'cn' => "广元市",
		'children' => [
	[
			'code' => "510802",
			'cn' => "利州区"
		],
		[
			'code' => "510811",
			'cn' => "元坝区"
		],
		[
			'code' => "510812",
			'cn' => "朝天区"
		],
		[
			'code' => "510821",
			'cn' => "旺苍县"
		],
		[
			'code' => "510822",
			'cn' => "青川县"
		],
		[
			'code' => "510823",
			'cn' => "剑阁县"
		],
		[
			'code' => "510824",
			'cn' => "苍溪县"
		],
		[
			'code' => "510825",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "510900",
		'cn' => "遂宁市",
		'children' => [
	[
			'code' => "510903",
			'cn' => "船山区"
		],
		[
			'code' => "510904",
			'cn' => "安居区"
		],
		[
			'code' => "510921",
			'cn' => "蓬溪县"
		],
		[
			'code' => "510922",
			'cn' => "射洪县"
		],
		[
			'code' => "510923",
			'cn' => "大英县"
		],
		[
			'code' => "510924",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511000",
		'cn' => "内江市",
		'children' => [
	[
			'code' => "511002",
			'cn' => "市中区"
		],
		[
			'code' => "511011",
			'cn' => "东兴区"
		],
		[
			'code' => "511024",
			'cn' => "威远县"
		],
		[
			'code' => "511025",
			'cn' => "资中县"
		],
		[
			'code' => "511028",
			'cn' => "隆昌县"
		],
		[
			'code' => "511029",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511100",
		'cn' => "乐山市",
		'children' => [
	[
			'code' => "511102",
			'cn' => "市中区"
		],
		[
			'code' => "511111",
			'cn' => "沙湾区"
		],
		[
			'code' => "511112",
			'cn' => "五通桥区"
		],
		[
			'code' => "511113",
			'cn' => "金口河区"
		],
		[
			'code' => "511123",
			'cn' => "犍为县"
		],
		[
			'code' => "511124",
			'cn' => "井研县"
		],
		[
			'code' => "511126",
			'cn' => "夹江县"
		],
		[
			'code' => "511129",
			'cn' => "沐川县"
		],
		[
			'code' => "511132",
			'cn' => "峨边彝族自治县"
		],
		[
			'code' => "511133",
			'cn' => "马边彝族自治县"
		],
		[
			'code' => "511181",
			'cn' => "峨眉山市"
		],
		[
			'code' => "511182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511300",
		'cn' => "南充市",
		'children' => [
	[
			'code' => "511302",
			'cn' => "顺庆区"
		],
		[
			'code' => "511303",
			'cn' => "高坪区"
		],
		[
			'code' => "511304",
			'cn' => "嘉陵区"
		],
		[
			'code' => "511321",
			'cn' => "南部县"
		],
		[
			'code' => "511322",
			'cn' => "营山县"
		],
		[
			'code' => "511323",
			'cn' => "蓬安县"
		],
		[
			'code' => "511324",
			'cn' => "仪陇县"
		],
		[
			'code' => "511325",
			'cn' => "西充县"
		],
		[
			'code' => "511381",
			'cn' => "阆中市"
		],
		[
			'code' => "511382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511400",
		'cn' => "眉山市",
		'children' => [
	[
			'code' => "511402",
			'cn' => "东坡区"
		],
		[
			'code' => "511421",
			'cn' => "仁寿县"
		],
		[
			'code' => "511422",
			'cn' => "彭山县"
		],
		[
			'code' => "511423",
			'cn' => "洪雅县"
		],
		[
			'code' => "511424",
			'cn' => "丹棱县"
		],
		[
			'code' => "511425",
			'cn' => "青神县"
		],
		[
			'code' => "511426",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511500",
		'cn' => "宜宾市",
		'children' => [
	[
			'code' => "511502",
			'cn' => "翠屏区"
		],
		[
			'code' => "511521",
			'cn' => "宜宾县"
		],
		[
			'code' => "511522",
			'cn' => "南溪县"
		],
		[
			'code' => "511523",
			'cn' => "江安县"
		],
		[
			'code' => "511524",
			'cn' => "长宁县"
		],
		[
			'code' => "511525",
			'cn' => "高县"
		],
		[
			'code' => "511526",
			'cn' => "珙县"
		],
		[
			'code' => "511527",
			'cn' => "筠连县"
		],
		[
			'code' => "511528",
			'cn' => "兴文县"
		],
		[
			'code' => "511529",
			'cn' => "屏山县"
		],
		[
			'code' => "511530",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511600",
		'cn' => "广安市",
		'children' => [
	[
			'code' => "511602",
			'cn' => "广安区"
		],
		[
			'code' => "511621",
			'cn' => "岳池县"
		],
		[
			'code' => "511622",
			'cn' => "武胜县"
		],
		[
			'code' => "511623",
			'cn' => "邻水县"
		],
		[
			'code' => "511681",
			'cn' => "华蓥市"
		],
		[
			'code' => "511682",
			'cn' => "市辖区"
		],
		[
			'code' => "511683",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511700",
		'cn' => "达州市",
		'children' => [
	[
			'code' => "511702",
			'cn' => "通川区"
		],
		[
			'code' => "511721",
			'cn' => "达县"
		],
		[
			'code' => "511722",
			'cn' => "宣汉县"
		],
		[
			'code' => "511723",
			'cn' => "开江县"
		],
		[
			'code' => "511724",
			'cn' => "大竹县"
		],
		[
			'code' => "511725",
			'cn' => "渠县"
		],
		[
			'code' => "511781",
			'cn' => "万源市"
		],
		[
			'code' => "511782",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511800",
		'cn' => "雅安市",
		'children' => [
	[
			'code' => "511802",
			'cn' => "雨城区"
		],
		[
			'code' => "511821",
			'cn' => "名山县"
		],
		[
			'code' => "511822",
			'cn' => "荥经县"
		],
		[
			'code' => "511823",
			'cn' => "汉源县"
		],
		[
			'code' => "511824",
			'cn' => "石棉县"
		],
		[
			'code' => "511825",
			'cn' => "天全县"
		],
		[
			'code' => "511826",
			'cn' => "芦山县"
		],
		[
			'code' => "511827",
			'cn' => "宝兴县"
		],
		[
			'code' => "511828",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "511900",
		'cn' => "巴中市",
		'children' => [
	[
			'code' => "511902",
			'cn' => "巴州区"
		],
		[
			'code' => "511921",
			'cn' => "通江县"
		],
		[
			'code' => "511922",
			'cn' => "南江县"
		],
		[
			'code' => "511923",
			'cn' => "平昌县"
		],
		[
			'code' => "511924",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "512000",
		'cn' => "资阳市",
		'children' => [
	[
			'code' => "512002",
			'cn' => "雁江区"
		],
		[
			'code' => "512021",
			'cn' => "安岳县"
		],
		[
			'code' => "512022",
			'cn' => "乐至县"
		],
		[
			'code' => "512081",
			'cn' => "简阳市"
		],
		[
			'code' => "512082",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "513200",
		'cn' => "阿坝藏族羌族自治州",
		'children' => [
	[
			'code' => "513221",
			'cn' => "汶川县"
		],
		[
			'code' => "513222",
			'cn' => "理县"
		],
		[
			'code' => "513223",
			'cn' => "茂县"
		],
		[
			'code' => "513224",
			'cn' => "松潘县"
		],
		[
			'code' => "513225",
			'cn' => "九寨沟县"
		],
		[
			'code' => "513226",
			'cn' => "金川县"
		],
		[
			'code' => "513227",
			'cn' => "小金县"
		],
		[
			'code' => "513228",
			'cn' => "黑水县"
		],
		[
			'code' => "513229",
			'cn' => "马尔康县"
		],
		[
			'code' => "513230",
			'cn' => "壤塘县"
		],
		[
			'code' => "513231",
			'cn' => "阿坝县"
		],
		[
			'code' => "513232",
			'cn' => "若尔盖县"
		],
		[
			'code' => "513233",
			'cn' => "红原县"
		],
		[
			'code' => "513234",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "513300",
		'cn' => "甘孜藏族自治州",
		'children' => [
	[
			'code' => "513321",
			'cn' => "康定县"
		],
		[
			'code' => "513322",
			'cn' => "泸定县"
		],
		[
			'code' => "513323",
			'cn' => "丹巴县"
		],
		[
			'code' => "513324",
			'cn' => "九龙县"
		],
		[
			'code' => "513325",
			'cn' => "雅江县"
		],
		[
			'code' => "513326",
			'cn' => "道孚县"
		],
		[
			'code' => "513327",
			'cn' => "炉霍县"
		],
		[
			'code' => "513328",
			'cn' => "甘孜县"
		],
		[
			'code' => "513329",
			'cn' => "新龙县"
		],
		[
			'code' => "513330",
			'cn' => "德格县"
		],
		[
			'code' => "513331",
			'cn' => "白玉县"
		],
		[
			'code' => "513332",
			'cn' => "石渠县"
		],
		[
			'code' => "513333",
			'cn' => "色达县"
		],
		[
			'code' => "513334",
			'cn' => "理塘县"
		],
		[
			'code' => "513335",
			'cn' => "巴塘县"
		],
		[
			'code' => "513336",
			'cn' => "乡城县"
		],
		[
			'code' => "513337",
			'cn' => "稻城县"
		],
		[
			'code' => "513338",
			'cn' => "得荣县"
		],
		[
			'code' => "513339",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "513400",
		'cn' => "凉山彝族自治州",
		'children' => [
	[
			'code' => "513401",
			'cn' => "西昌市"
		],
		[
			'code' => "513422",
			'cn' => "木里藏族自治县"
		],
		[
			'code' => "513423",
			'cn' => "盐源县"
		],
		[
			'code' => "513424",
			'cn' => "德昌县"
		],
		[
			'code' => "513425",
			'cn' => "会理县"
		],
		[
			'code' => "513426",
			'cn' => "会东县"
		],
		[
			'code' => "513427",
			'cn' => "宁南县"
		],
		[
			'code' => "513428",
			'cn' => "普格县"
		],
		[
			'code' => "513429",
			'cn' => "布拖县"
		],
		[
			'code' => "513430",
			'cn' => "金阳县"
		],
		[
			'code' => "513431",
			'cn' => "昭觉县"
		],
		[
			'code' => "513432",
			'cn' => "喜德县"
		],
		[
			'code' => "513433",
			'cn' => "冕宁县"
		],
		[
			'code' => "513434",
			'cn' => "越西县"
		],
		[
			'code' => "513435",
			'cn' => "甘洛县"
		],
		[
			'code' => "513436",
			'cn' => "美姑县"
		],
		[
			'code' => "513437",
			'cn' => "雷波县"
		],
		[
			'code' => "513438",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '520000',
	'cn' => '贵州省',
	'children' => [
	[
		'code' => "520100",
		'cn' => "贵阳市",
		'children' => [
	[
			'code' => "520102",
			'cn' => "南明区"
		],
		[
			'code' => "520103",
			'cn' => "云岩区"
		],
		[
			'code' => "520111",
			'cn' => "花溪区"
		],
		[
			'code' => "520112",
			'cn' => "乌当区"
		],
		[
			'code' => "520113",
			'cn' => "白云区"
		],
		[
			'code' => "520114",
			'cn' => "小河区"
		],
		[
			'code' => "520121",
			'cn' => "开阳县"
		],
		[
			'code' => "520122",
			'cn' => "息烽县"
		],
		[
			'code' => "520123",
			'cn' => "修文县"
		],
		[
			'code' => "520151",
			'cn' => "金阳开发区"
		],
		[
			'code' => "520181",
			'cn' => "清镇市"
		],
		[
			'code' => "520182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "520200",
		'cn' => "六盘水市",
		'children' => [
	[
			'code' => "520201",
			'cn' => "钟山区"
		],
		[
			'code' => "520203",
			'cn' => "六枝特区"
		],
		[
			'code' => "520221",
			'cn' => "水城县"
		],
		[
			'code' => "520222",
			'cn' => "盘县"
		],
		[
			'code' => "520223",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "520300",
		'cn' => "遵义市",
		'children' => [
	[
			'code' => "520302",
			'cn' => "红花岗区"
		],
		[
			'code' => "520303",
			'cn' => "汇川区"
		],
		[
			'code' => "520321",
			'cn' => "遵义县"
		],
		[
			'code' => "520322",
			'cn' => "桐梓县"
		],
		[
			'code' => "520323",
			'cn' => "绥阳县"
		],
		[
			'code' => "520324",
			'cn' => "正安县"
		],
		[
			'code' => "520325",
			'cn' => "道真仡佬族苗族自治县"
		],
		[
			'code' => "520326",
			'cn' => "务川仡佬族苗族自治县"
		],
		[
			'code' => "520327",
			'cn' => "凤冈县"
		],
		[
			'code' => "520328",
			'cn' => "湄潭县"
		],
		[
			'code' => "520329",
			'cn' => "余庆县"
		],
		[
			'code' => "520330",
			'cn' => "习水县"
		],
		[
			'code' => "520381",
			'cn' => "赤水市"
		],
		[
			'code' => "520382",
			'cn' => "仁怀市"
		],
		[
			'code' => "520383",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "520400",
		'cn' => "安顺市",
		'children' => [
	[
			'code' => "520402",
			'cn' => "西秀区"
		],
		[
			'code' => "520421",
			'cn' => "平坝县"
		],
		[
			'code' => "520422",
			'cn' => "普定县"
		],
		[
			'code' => "520423",
			'cn' => "镇宁布依族苗族自治县"
		],
		[
			'code' => "520424",
			'cn' => "关岭布依族苗族自治县"
		],
		[
			'code' => "520425",
			'cn' => "紫云苗族布依族自治县"
		],
		[
			'code' => "520426",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "522200",
		'cn' => "铜仁地区",
		'children' => [
	[
			'code' => "522201",
			'cn' => "铜仁市"
		],
		[
			'code' => "522222",
			'cn' => "江口县"
		],
		[
			'code' => "522223",
			'cn' => "玉屏侗族自治县"
		],
		[
			'code' => "522224",
			'cn' => "石阡县"
		],
		[
			'code' => "522225",
			'cn' => "思南县"
		],
		[
			'code' => "522226",
			'cn' => "印江土家族苗族自治县"
		],
		[
			'code' => "522227",
			'cn' => "德江县"
		],
		[
			'code' => "522228",
			'cn' => "沿河土家族自治县"
		],
		[
			'code' => "522229",
			'cn' => "松桃苗族自治县"
		],
		[
			'code' => "522230",
			'cn' => "万山特区"
		],
		[
			'code' => "522231",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "522300",
		'cn' => "黔西南布依族苗族自治州",
		'children' => [
	[
			'code' => "522301",
			'cn' => "兴义市"
		],
		[
			'code' => "522322",
			'cn' => "兴仁县"
		],
		[
			'code' => "522323",
			'cn' => "普安县"
		],
		[
			'code' => "522324",
			'cn' => "晴隆县"
		],
		[
			'code' => "522325",
			'cn' => "贞丰县"
		],
		[
			'code' => "522326",
			'cn' => "望谟县"
		],
		[
			'code' => "522327",
			'cn' => "册亨县"
		],
		[
			'code' => "522328",
			'cn' => "安龙县"
		],
		[
			'code' => "522329",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "522400",
		'cn' => "毕节地区",
		'children' => [
	[
			'code' => "522401",
			'cn' => "毕节市"
		],
		[
			'code' => "522422",
			'cn' => "大方县"
		],
		[
			'code' => "522423",
			'cn' => "黔西县"
		],
		[
			'code' => "522424",
			'cn' => "金沙县"
		],
		[
			'code' => "522425",
			'cn' => "织金县"
		],
		[
			'code' => "522426",
			'cn' => "纳雍县"
		],
		[
			'code' => "522427",
			'cn' => "威宁彝族回族苗族自治县"
		],
		[
			'code' => "522428",
			'cn' => "赫章县"
		],
		[
			'code' => "522429",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "522600",
		'cn' => "黔东南苗族侗族自治州",
		'children' => [
	[
			'code' => "522601",
			'cn' => "凯里市"
		],
		[
			'code' => "522622",
			'cn' => "黄平县"
		],
		[
			'code' => "522623",
			'cn' => "施秉县"
		],
		[
			'code' => "522624",
			'cn' => "三穗县"
		],
		[
			'code' => "522625",
			'cn' => "镇远县"
		],
		[
			'code' => "522626",
			'cn' => "岑巩县"
		],
		[
			'code' => "522627",
			'cn' => "天柱县"
		],
		[
			'code' => "522628",
			'cn' => "锦屏县"
		],
		[
			'code' => "522629",
			'cn' => "剑河县"
		],
		[
			'code' => "522630",
			'cn' => "台江县"
		],
		[
			'code' => "522631",
			'cn' => "黎平县"
		],
		[
			'code' => "522632",
			'cn' => "榕江县"
		],
		[
			'code' => "522633",
			'cn' => "从江县"
		],
		[
			'code' => "522634",
			'cn' => "雷山县"
		],
		[
			'code' => "522635",
			'cn' => "麻江县"
		],
		[
			'code' => "522636",
			'cn' => "丹寨县"
		],
		[
			'code' => "522637",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "522700",
		'cn' => "黔南布依族苗族自治州",
		'children' => [
	[
			'code' => "522701",
			'cn' => "都匀市"
		],
		[
			'code' => "522702",
			'cn' => "福泉市"
		],
		[
			'code' => "522722",
			'cn' => "荔波县"
		],
		[
			'code' => "522723",
			'cn' => "贵定县"
		],
		[
			'code' => "522725",
			'cn' => "瓮安县"
		],
		[
			'code' => "522726",
			'cn' => "独山县"
		],
		[
			'code' => "522727",
			'cn' => "平塘县"
		],
		[
			'code' => "522728",
			'cn' => "罗甸县"
		],
		[
			'code' => "522729",
			'cn' => "长顺县"
		],
		[
			'code' => "522730",
			'cn' => "龙里县"
		],
		[
			'code' => "522731",
			'cn' => "惠水县"
		],
		[
			'code' => "522732",
			'cn' => "三都水族自治县"
		],
		[
			'code' => "522733",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '530000',
	'cn' => '云南省',
	'children' => [
	[
		'code' => "530100",
		'cn' => "昆明市",
		'children' => [
	[
			'code' => "530102",
			'cn' => "五华区"
		],
		[
			'code' => "530103",
			'cn' => "盘龙区"
		],
		[
			'code' => "530111",
			'cn' => "官渡区"
		],
		[
			'code' => "530112",
			'cn' => "西山区"
		],
		[
			'code' => "530113",
			'cn' => "东川区"
		],
		[
			'code' => "530121",
			'cn' => "呈贡县"
		],
		[
			'code' => "530122",
			'cn' => "晋宁县"
		],
		[
			'code' => "530124",
			'cn' => "富民县"
		],
		[
			'code' => "530125",
			'cn' => "宜良县"
		],
		[
			'code' => "530126",
			'cn' => "石林彝族自治县"
		],
		[
			'code' => "530127",
			'cn' => "嵩明县"
		],
		[
			'code' => "530128",
			'cn' => "禄劝彝族苗族自治县"
		],
		[
			'code' => "530129",
			'cn' => "寻甸回族彝族自治县"
		],
		[
			'code' => "530181",
			'cn' => "安宁市"
		],
		[
			'code' => "530182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530300",
		'cn' => "曲靖市",
		'children' => [
	[
			'code' => "530302",
			'cn' => "麒麟区"
		],
		[
			'code' => "530321",
			'cn' => "马龙县"
		],
		[
			'code' => "530322",
			'cn' => "陆良县"
		],
		[
			'code' => "530323",
			'cn' => "师宗县"
		],
		[
			'code' => "530324",
			'cn' => "罗平县"
		],
		[
			'code' => "530325",
			'cn' => "富源县"
		],
		[
			'code' => "530326",
			'cn' => "会泽县"
		],
		[
			'code' => "530328",
			'cn' => "沾益县"
		],
		[
			'code' => "530381",
			'cn' => "宣威市"
		],
		[
			'code' => "530382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530400",
		'cn' => "玉溪市",
		'children' => [
	[
			'code' => "530402",
			'cn' => "红塔区"
		],
		[
			'code' => "530421",
			'cn' => "江川县"
		],
		[
			'code' => "530422",
			'cn' => "澄江县"
		],
		[
			'code' => "530423",
			'cn' => "通海县"
		],
		[
			'code' => "530424",
			'cn' => "华宁县"
		],
		[
			'code' => "530425",
			'cn' => "易门县"
		],
		[
			'code' => "530426",
			'cn' => "峨山彝族自治县"
		],
		[
			'code' => "530427",
			'cn' => "新平彝族傣族自治县"
		],
		[
			'code' => "530428",
			'cn' => "元江哈尼族彝族傣族自治县"
		],
		[
			'code' => "530429",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530500",
		'cn' => "保山市",
		'children' => [
	[
			'code' => "530502",
			'cn' => "隆阳区"
		],
		[
			'code' => "530521",
			'cn' => "施甸县"
		],
		[
			'code' => "530522",
			'cn' => "腾冲县"
		],
		[
			'code' => "530523",
			'cn' => "龙陵县"
		],
		[
			'code' => "530524",
			'cn' => "昌宁县"
		],
		[
			'code' => "530525",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530600",
		'cn' => "昭通市",
		'children' => [
	[
			'code' => "530602",
			'cn' => "昭阳区"
		],
		[
			'code' => "530621",
			'cn' => "鲁甸县"
		],
		[
			'code' => "530622",
			'cn' => "巧家县"
		],
		[
			'code' => "530623",
			'cn' => "盐津县"
		],
		[
			'code' => "530624",
			'cn' => "大关县"
		],
		[
			'code' => "530625",
			'cn' => "永善县"
		],
		[
			'code' => "530626",
			'cn' => "绥江县"
		],
		[
			'code' => "530627",
			'cn' => "镇雄县"
		],
		[
			'code' => "530628",
			'cn' => "彝良县"
		],
		[
			'code' => "530629",
			'cn' => "威信县"
		],
		[
			'code' => "530630",
			'cn' => "水富县"
		],
		[
			'code' => "530631",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530700",
		'cn' => "丽江市",
		'children' => [
	[
			'code' => "530702",
			'cn' => "古城区"
		],
		[
			'code' => "530721",
			'cn' => "玉龙纳西族自治县"
		],
		[
			'code' => "530722",
			'cn' => "永胜县"
		],
		[
			'code' => "530723",
			'cn' => "华坪县"
		],
		[
			'code' => "530724",
			'cn' => "宁蒗彝族自治县"
		],
		[
			'code' => "530725",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530800",
		'cn' => "普洱市",
		'children' => [
	[
			'code' => "530802",
			'cn' => "思茅区"
		],
		[
			'code' => "530821",
			'cn' => "宁洱哈尼族彝族自治县"
		],
		[
			'code' => "530822",
			'cn' => "墨江哈尼族自治县"
		],
		[
			'code' => "530823",
			'cn' => "景东彝族自治县"
		],
		[
			'code' => "530824",
			'cn' => "景谷傣族彝族自治县"
		],
		[
			'code' => "530825",
			'cn' => "镇沅彝族哈尼族拉祜族自治县"
		],
		[
			'code' => "530826",
			'cn' => "江城哈尼族彝族自治县"
		],
		[
			'code' => "530827",
			'cn' => "孟连傣族拉祜族佤族自治县"
		],
		[
			'code' => "530828",
			'cn' => "澜沧拉祜族自治县"
		],
		[
			'code' => "530829",
			'cn' => "西盟佤族自治县"
		],
		[
			'code' => "530830",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "530900",
		'cn' => "临沧市",
		'children' => [
	[
			'code' => "530902",
			'cn' => "临翔区"
		],
		[
			'code' => "530921",
			'cn' => "凤庆县"
		],
		[
			'code' => "530922",
			'cn' => "云县"
		],
		[
			'code' => "530923",
			'cn' => "永德县"
		],
		[
			'code' => "530924",
			'cn' => "镇康县"
		],
		[
			'code' => "530925",
			'cn' => "双江拉祜族佤族布朗族傣族自治县"
		],
		[
			'code' => "530926",
			'cn' => "耿马傣族佤族自治县"
		],
		[
			'code' => "530927",
			'cn' => "沧源佤族自治县"
		],
		[
			'code' => "530928",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "532300",
		'cn' => "楚雄彝族自治州",
		'children' => [
	[
			'code' => "532301",
			'cn' => "楚雄市"
		],
		[
			'code' => "532322",
			'cn' => "双柏县"
		],
		[
			'code' => "532323",
			'cn' => "牟定县"
		],
		[
			'code' => "532324",
			'cn' => "南华县"
		],
		[
			'code' => "532325",
			'cn' => "姚安县"
		],
		[
			'code' => "532326",
			'cn' => "大姚县"
		],
		[
			'code' => "532327",
			'cn' => "永仁县"
		],
		[
			'code' => "532328",
			'cn' => "元谋县"
		],
		[
			'code' => "532329",
			'cn' => "武定县"
		],
		[
			'code' => "532331",
			'cn' => "禄丰县"
		],
		[
			'code' => "532332",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "532500",
		'cn' => "红河哈尼族彝族自治州",
		'children' => [
	[
			'code' => "532501",
			'cn' => "个旧市"
		],
		[
			'code' => "532502",
			'cn' => "开远市"
		],
		[
			'code' => "532522",
			'cn' => "蒙自县"
		],
		[
			'code' => "532523",
			'cn' => "屏边苗族自治县"
		],
		[
			'code' => "532524",
			'cn' => "建水县"
		],
		[
			'code' => "532525",
			'cn' => "石屏县"
		],
		[
			'code' => "532526",
			'cn' => "弥勒县"
		],
		[
			'code' => "532527",
			'cn' => "泸西县"
		],
		[
			'code' => "532528",
			'cn' => "元阳县"
		],
		[
			'code' => "532529",
			'cn' => "红河县"
		],
		[
			'code' => "532530",
			'cn' => "金平苗族瑶族傣族自治县"
		],
		[
			'code' => "532531",
			'cn' => "绿春县"
		],
		[
			'code' => "532532",
			'cn' => "河口瑶族自治县"
		],
		[
			'code' => "532533",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "532600",
		'cn' => "文山壮族苗族自治州",
		'children' => [
	[
			'code' => "532621",
			'cn' => "文山县"
		],
		[
			'code' => "532622",
			'cn' => "砚山县"
		],
		[
			'code' => "532623",
			'cn' => "西畴县"
		],
		[
			'code' => "532624",
			'cn' => "麻栗坡县"
		],
		[
			'code' => "532625",
			'cn' => "马关县"
		],
		[
			'code' => "532626",
			'cn' => "丘北县"
		],
		[
			'code' => "532627",
			'cn' => "广南县"
		],
		[
			'code' => "532628",
			'cn' => "富宁县"
		],
		[
			'code' => "532629",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "532800",
		'cn' => "西双版纳傣族自治州",
		'children' => [
	[
			'code' => "532801",
			'cn' => "景洪市"
		],
		[
			'code' => "532822",
			'cn' => "勐海县"
		],
		[
			'code' => "532823",
			'cn' => "勐腊县"
		],
		[
			'code' => "532824",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "532900",
		'cn' => "大理白族自治州",
		'children' => [
	[
			'code' => "532901",
			'cn' => "大理市"
		],
		[
			'code' => "532922",
			'cn' => "漾濞彝族自治县"
		],
		[
			'code' => "532923",
			'cn' => "祥云县"
		],
		[
			'code' => "532924",
			'cn' => "宾川县"
		],
		[
			'code' => "532925",
			'cn' => "弥渡县"
		],
		[
			'code' => "532926",
			'cn' => "南涧彝族自治县"
		],
		[
			'code' => "532927",
			'cn' => "巍山彝族回族自治县"
		],
		[
			'code' => "532928",
			'cn' => "永平县"
		],
		[
			'code' => "532929",
			'cn' => "云龙县"
		],
		[
			'code' => "532930",
			'cn' => "洱源县"
		],
		[
			'code' => "532931",
			'cn' => "剑川县"
		],
		[
			'code' => "532932",
			'cn' => "鹤庆县"
		],
		[
			'code' => "532933",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "533100",
		'cn' => "德宏傣族景颇族自治州",
		'children' => [
	[
			'code' => "533102",
			'cn' => "瑞丽市"
		],
		[
			'code' => "533103",
			'cn' => "潞西市"
		],
		[
			'code' => "533122",
			'cn' => "梁河县"
		],
		[
			'code' => "533123",
			'cn' => "盈江县"
		],
		[
			'code' => "533124",
			'cn' => "陇川县"
		],
		[
			'code' => "533125",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "533300",
		'cn' => "怒江傈僳族自治州",
		'children' => [
	[
			'code' => "533321",
			'cn' => "泸水县"
		],
		[
			'code' => "533323",
			'cn' => "福贡县"
		],
		[
			'code' => "533324",
			'cn' => "贡山独龙族怒族自治县"
		],
		[
			'code' => "533325",
			'cn' => "兰坪白族普米族自治县"
		],
		[
			'code' => "533326",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "533400",
		'cn' => "迪庆藏族自治州",
		'children' => [
	[
			'code' => "533421",
			'cn' => "香格里拉县"
		],
		[
			'code' => "533422",
			'cn' => "德钦县"
		],
		[
			'code' => "533423",
			'cn' => "维西傈僳族自治县"
		],
		[
			'code' => "533424",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '540000',
	'cn' => '西藏',
	'children' => [
	[
		'code' => "540100",
		'cn' => "拉萨市",
		'children' => [
	[
			'code' => "540102",
			'cn' => "城关区"
		],
		[
			'code' => "540121",
			'cn' => "林周县"
		],
		[
			'code' => "540122",
			'cn' => "当雄县"
		],
		[
			'code' => "540123",
			'cn' => "尼木县"
		],
		[
			'code' => "540124",
			'cn' => "曲水县"
		],
		[
			'code' => "540125",
			'cn' => "堆龙德庆县"
		],
		[
			'code' => "540126",
			'cn' => "达孜县"
		],
		[
			'code' => "540127",
			'cn' => "墨竹工卡县"
		],
		[
			'code' => "540128",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542100",
		'cn' => "昌都地区",
		'children' => [
	[
			'code' => "542121",
			'cn' => "昌都县"
		],
		[
			'code' => "542122",
			'cn' => "江达县"
		],
		[
			'code' => "542123",
			'cn' => "贡觉县"
		],
		[
			'code' => "542124",
			'cn' => "类乌齐县"
		],
		[
			'code' => "542125",
			'cn' => "丁青县"
		],
		[
			'code' => "542126",
			'cn' => "察雅县"
		],
		[
			'code' => "542127",
			'cn' => "八宿县"
		],
		[
			'code' => "542128",
			'cn' => "左贡县"
		],
		[
			'code' => "542129",
			'cn' => "芒康县"
		],
		[
			'code' => "542132",
			'cn' => "洛隆县"
		],
		[
			'code' => "542133",
			'cn' => "边坝县"
		],
		[
			'code' => "542134",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542200",
		'cn' => "山南地区",
		'children' => [
	[
			'code' => "542221",
			'cn' => "乃东县"
		],
		[
			'code' => "542222",
			'cn' => "扎囊县"
		],
		[
			'code' => "542223",
			'cn' => "贡嘎县"
		],
		[
			'code' => "542224",
			'cn' => "桑日县"
		],
		[
			'code' => "542225",
			'cn' => "琼结县"
		],
		[
			'code' => "542226",
			'cn' => "曲松县"
		],
		[
			'code' => "542227",
			'cn' => "措美县"
		],
		[
			'code' => "542228",
			'cn' => "洛扎县"
		],
		[
			'code' => "542229",
			'cn' => "加查县"
		],
		[
			'code' => "542231",
			'cn' => "隆子县"
		],
		[
			'code' => "542232",
			'cn' => "错那县"
		],
		[
			'code' => "542233",
			'cn' => "浪卡子县"
		],
		[
			'code' => "542234",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542300",
		'cn' => "日喀则地区",
		'children' => [
	[
			'code' => "542301",
			'cn' => "日喀则市"
		],
		[
			'code' => "542322",
			'cn' => "南木林县"
		],
		[
			'code' => "542323",
			'cn' => "江孜县"
		],
		[
			'code' => "542324",
			'cn' => "定日县"
		],
		[
			'code' => "542325",
			'cn' => "萨迦县"
		],
		[
			'code' => "542326",
			'cn' => "拉孜县"
		],
		[
			'code' => "542327",
			'cn' => "昂仁县"
		],
		[
			'code' => "542328",
			'cn' => "谢通门县"
		],
		[
			'code' => "542329",
			'cn' => "白朗县"
		],
		[
			'code' => "542330",
			'cn' => "仁布县"
		],
		[
			'code' => "542331",
			'cn' => "康马县"
		],
		[
			'code' => "542332",
			'cn' => "定结县"
		],
		[
			'code' => "542333",
			'cn' => "仲巴县"
		],
		[
			'code' => "542334",
			'cn' => "亚东县"
		],
		[
			'code' => "542335",
			'cn' => "吉隆县"
		],
		[
			'code' => "542336",
			'cn' => "聂拉木县"
		],
		[
			'code' => "542337",
			'cn' => "萨嘎县"
		],
		[
			'code' => "542338",
			'cn' => "岗巴县"
		],
		[
			'code' => "542339",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542400",
		'cn' => "那曲地区",
		'children' => [
	[
			'code' => "542421",
			'cn' => "那曲县"
		],
		[
			'code' => "542422",
			'cn' => "嘉黎县"
		],
		[
			'code' => "542423",
			'cn' => "比如县"
		],
		[
			'code' => "542424",
			'cn' => "聂荣县"
		],
		[
			'code' => "542425",
			'cn' => "安多县"
		],
		[
			'code' => "542426",
			'cn' => "申扎县"
		],
		[
			'code' => "542427",
			'cn' => "索县"
		],
		[
			'code' => "542428",
			'cn' => "班戈县"
		],
		[
			'code' => "542429",
			'cn' => "巴青县"
		],
		[
			'code' => "542430",
			'cn' => "尼玛县"
		],
		[
			'code' => "542431",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542500",
		'cn' => "阿里地区",
		'children' => [
	[
			'code' => "542521",
			'cn' => "普兰县"
		],
		[
			'code' => "542522",
			'cn' => "札达县"
		],
		[
			'code' => "542523",
			'cn' => "噶尔县"
		],
		[
			'code' => "542524",
			'cn' => "日土县"
		],
		[
			'code' => "542525",
			'cn' => "革吉县"
		],
		[
			'code' => "542526",
			'cn' => "改则县"
		],
		[
			'code' => "542527",
			'cn' => "措勤县"
		],
		[
			'code' => "542528",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "542600",
		'cn' => "林芝地区",
		'children' => [
	[
			'code' => "542621",
			'cn' => "林芝县"
		],
		[
			'code' => "542622",
			'cn' => "工布江达县"
		],
		[
			'code' => "542623",
			'cn' => "米林县"
		],
		[
			'code' => "542624",
			'cn' => "墨脱县"
		],
		[
			'code' => "542625",
			'cn' => "波密县"
		],
		[
			'code' => "542626",
			'cn' => "察隅县"
		],
		[
			'code' => "542627",
			'cn' => "朗县"
		],
		[
			'code' => "542628",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '610000',
	'cn' => '陕西省',
	'children' => [
	[
		'code' => "610100",
		'cn' => "西安市",
		'children' => [
	[
			'code' => "610102",
			'cn' => "新城区"
		],
		[
			'code' => "610103",
			'cn' => "碑林区"
		],
		[
			'code' => "610104",
			'cn' => "莲湖区"
		],
		[
			'code' => "610111",
			'cn' => "灞桥区"
		],
		[
			'code' => "610112",
			'cn' => "未央区"
		],
		[
			'code' => "610113",
			'cn' => "雁塔区"
		],
		[
			'code' => "610114",
			'cn' => "阎良区"
		],
		[
			'code' => "610115",
			'cn' => "临潼区"
		],
		[
			'code' => "610116",
			'cn' => "长安区"
		],
		[
			'code' => "610122",
			'cn' => "蓝田县"
		],
		[
			'code' => "610124",
			'cn' => "周至县"
		],
		[
			'code' => "610125",
			'cn' => "户县"
		],
		[
			'code' => "610126",
			'cn' => "高陵县"
		],
		[
			'code' => "610127",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610200",
		'cn' => "铜川市",
		'children' => [
	[
			'code' => "610202",
			'cn' => "王益区"
		],
		[
			'code' => "610203",
			'cn' => "印台区"
		],
		[
			'code' => "610204",
			'cn' => "耀州区"
		],
		[
			'code' => "610222",
			'cn' => "宜君县"
		],
		[
			'code' => "610223",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610300",
		'cn' => "宝鸡市",
		'children' => [
	[
			'code' => "610302",
			'cn' => "渭滨区"
		],
		[
			'code' => "610303",
			'cn' => "金台区"
		],
		[
			'code' => "610304",
			'cn' => "陈仓区"
		],
		[
			'code' => "610322",
			'cn' => "凤翔县"
		],
		[
			'code' => "610323",
			'cn' => "岐山县"
		],
		[
			'code' => "610324",
			'cn' => "扶风县"
		],
		[
			'code' => "610326",
			'cn' => "眉县"
		],
		[
			'code' => "610327",
			'cn' => "陇县"
		],
		[
			'code' => "610328",
			'cn' => "千阳县"
		],
		[
			'code' => "610329",
			'cn' => "麟游县"
		],
		[
			'code' => "610330",
			'cn' => "凤县"
		],
		[
			'code' => "610331",
			'cn' => "太白县"
		],
		[
			'code' => "610332",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610400",
		'cn' => "咸阳市",
		'children' => [
	[
			'code' => "610402",
			'cn' => "秦都区"
		],
		[
			'code' => "610403",
			'cn' => "杨陵区"
		],
		[
			'code' => "610404",
			'cn' => "渭城区"
		],
		[
			'code' => "610422",
			'cn' => "三原县"
		],
		[
			'code' => "610423",
			'cn' => "泾阳县"
		],
		[
			'code' => "610424",
			'cn' => "乾县"
		],
		[
			'code' => "610425",
			'cn' => "礼泉县"
		],
		[
			'code' => "610426",
			'cn' => "永寿县"
		],
		[
			'code' => "610427",
			'cn' => "彬县"
		],
		[
			'code' => "610428",
			'cn' => "长武县"
		],
		[
			'code' => "610429",
			'cn' => "旬邑县"
		],
		[
			'code' => "610430",
			'cn' => "淳化县"
		],
		[
			'code' => "610431",
			'cn' => "武功县"
		],
		[
			'code' => "610481",
			'cn' => "兴平市"
		],
		[
			'code' => "610482",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610500",
		'cn' => "渭南市",
		'children' => [
	[
			'code' => "610502",
			'cn' => "临渭区"
		],
		[
			'code' => "610521",
			'cn' => "华县"
		],
		[
			'code' => "610522",
			'cn' => "潼关县"
		],
		[
			'code' => "610523",
			'cn' => "大荔县"
		],
		[
			'code' => "610524",
			'cn' => "合阳县"
		],
		[
			'code' => "610525",
			'cn' => "澄城县"
		],
		[
			'code' => "610526",
			'cn' => "蒲城县"
		],
		[
			'code' => "610527",
			'cn' => "白水县"
		],
		[
			'code' => "610528",
			'cn' => "富平县"
		],
		[
			'code' => "610581",
			'cn' => "韩城市"
		],
		[
			'code' => "610582",
			'cn' => "华阴市"
		],
		[
			'code' => "610583",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610600",
		'cn' => "延安市",
		'children' => [
	[
			'code' => "610602",
			'cn' => "宝塔区"
		],
		[
			'code' => "610621",
			'cn' => "延长县"
		],
		[
			'code' => "610622",
			'cn' => "延川县"
		],
		[
			'code' => "610623",
			'cn' => "子长县"
		],
		[
			'code' => "610624",
			'cn' => "安塞县"
		],
		[
			'code' => "610625",
			'cn' => "志丹县"
		],
		[
			'code' => "610626",
			'cn' => "吴起县"
		],
		[
			'code' => "610627",
			'cn' => "甘泉县"
		],
		[
			'code' => "610628",
			'cn' => "富县"
		],
		[
			'code' => "610629",
			'cn' => "洛川县"
		],
		[
			'code' => "610630",
			'cn' => "宜川县"
		],
		[
			'code' => "610631",
			'cn' => "黄龙县"
		],
		[
			'code' => "610632",
			'cn' => "黄陵县"
		],
		[
			'code' => "610633",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610700",
		'cn' => "汉中市",
		'children' => [
	[
			'code' => "610702",
			'cn' => "汉台区"
		],
		[
			'code' => "610721",
			'cn' => "南郑县"
		],
		[
			'code' => "610722",
			'cn' => "城固县"
		],
		[
			'code' => "610723",
			'cn' => "洋县"
		],
		[
			'code' => "610724",
			'cn' => "西乡县"
		],
		[
			'code' => "610725",
			'cn' => "勉县"
		],
		[
			'code' => "610726",
			'cn' => "宁强县"
		],
		[
			'code' => "610727",
			'cn' => "略阳县"
		],
		[
			'code' => "610728",
			'cn' => "镇巴县"
		],
		[
			'code' => "610729",
			'cn' => "留坝县"
		],
		[
			'code' => "610730",
			'cn' => "佛坪县"
		],
		[
			'code' => "610731",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610800",
		'cn' => "榆林市",
		'children' => [
	[
			'code' => "610802",
			'cn' => "榆阳区"
		],
		[
			'code' => "610821",
			'cn' => "神木县"
		],
		[
			'code' => "610822",
			'cn' => "府谷县"
		],
		[
			'code' => "610823",
			'cn' => "横山县"
		],
		[
			'code' => "610824",
			'cn' => "靖边县"
		],
		[
			'code' => "610825",
			'cn' => "定边县"
		],
		[
			'code' => "610826",
			'cn' => "绥德县"
		],
		[
			'code' => "610827",
			'cn' => "米脂县"
		],
		[
			'code' => "610828",
			'cn' => "佳县"
		],
		[
			'code' => "610829",
			'cn' => "吴堡县"
		],
		[
			'code' => "610830",
			'cn' => "清涧县"
		],
		[
			'code' => "610831",
			'cn' => "子洲县"
		],
		[
			'code' => "610832",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "610900",
		'cn' => "安康市",
		'children' => [
	[
			'code' => "610902",
			'cn' => "汉滨区"
		],
		[
			'code' => "610921",
			'cn' => "汉阴县"
		],
		[
			'code' => "610922",
			'cn' => "石泉县"
		],
		[
			'code' => "610923",
			'cn' => "宁陕县"
		],
		[
			'code' => "610924",
			'cn' => "紫阳县"
		],
		[
			'code' => "610925",
			'cn' => "岚皋县"
		],
		[
			'code' => "610926",
			'cn' => "平利县"
		],
		[
			'code' => "610927",
			'cn' => "镇坪县"
		],
		[
			'code' => "610928",
			'cn' => "旬阳县"
		],
		[
			'code' => "610929",
			'cn' => "白河县"
		],
		[
			'code' => "610930",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "611000",
		'cn' => "商洛市",
		'children' => [
	[
			'code' => "611002",
			'cn' => "商州区"
		],
		[
			'code' => "611021",
			'cn' => "洛南县"
		],
		[
			'code' => "611022",
			'cn' => "丹凤县"
		],
		[
			'code' => "611023",
			'cn' => "商南县"
		],
		[
			'code' => "611024",
			'cn' => "山阳县"
		],
		[
			'code' => "611025",
			'cn' => "镇安县"
		],
		[
			'code' => "611026",
			'cn' => "柞水县"
		],
		[
			'code' => "611027",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '620000',
	'cn' => '甘肃省',
	'children' => [
	[
		'code' => "620100",
		'cn' => "兰州市",
		'children' => [
	[
			'code' => "620102",
			'cn' => "城关区"
		],
		[
			'code' => "620103",
			'cn' => "七里河区"
		],
		[
			'code' => "620104",
			'cn' => "西固区"
		],
		[
			'code' => "620105",
			'cn' => "安宁区"
		],
		[
			'code' => "620111",
			'cn' => "红古区"
		],
		[
			'code' => "620121",
			'cn' => "永登县"
		],
		[
			'code' => "620122",
			'cn' => "皋兰县"
		],
		[
			'code' => "620123",
			'cn' => "榆中县"
		],
		[
			'code' => "620124",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620200",
		'cn' => "嘉峪关市",
		'children' => [
	[
			'code' => "620302",
			'cn' => "金川区"
		],
		[
			'code' => "620321",
			'cn' => "永昌县"
		],
		[
			'code' => "620322",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620300",
		'cn' => "金昌市",
		'children' => [
	[
			'code' => "620302",
			'cn' => "金川区"
		],
		[
			'code' => "620321",
			'cn' => "永昌县"
		],
		[
			'code' => "620322",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620400",
		'cn' => "白银市",
		'children' => [
	[
			'code' => "620402",
			'cn' => "白银区"
		],
		[
			'code' => "620403",
			'cn' => "平川区"
		],
		[
			'code' => "620421",
			'cn' => "靖远县"
		],
		[
			'code' => "620422",
			'cn' => "会宁县"
		],
		[
			'code' => "620423",
			'cn' => "景泰县"
		],
		[
			'code' => "620424",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620500",
		'cn' => "天水市",
		'children' => [
	[
			'code' => "620502",
			'cn' => "秦州区"
		],
		[
			'code' => "620503",
			'cn' => "麦积区"
		],
		[
			'code' => "620521",
			'cn' => "清水县"
		],
		[
			'code' => "620522",
			'cn' => "秦安县"
		],
		[
			'code' => "620523",
			'cn' => "甘谷县"
		],
		[
			'code' => "620524",
			'cn' => "武山县"
		],
		[
			'code' => "620525",
			'cn' => "张家川回族自治县"
		],
		[
			'code' => "620526",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620600",
		'cn' => "武威市",
		'children' => [
	[
			'code' => "620602",
			'cn' => "凉州区"
		],
		[
			'code' => "620621",
			'cn' => "民勤县"
		],
		[
			'code' => "620622",
			'cn' => "古浪县"
		],
		[
			'code' => "620623",
			'cn' => "天祝藏族自治县"
		],
		[
			'code' => "620624",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620700",
		'cn' => "张掖市",
		'children' => [
	[
			'code' => "620702",
			'cn' => "甘州区"
		],
		[
			'code' => "620721",
			'cn' => "肃南裕固族自治县"
		],
		[
			'code' => "620722",
			'cn' => "民乐县"
		],
		[
			'code' => "620723",
			'cn' => "临泽县"
		],
		[
			'code' => "620724",
			'cn' => "高台县"
		],
		[
			'code' => "620725",
			'cn' => "山丹县"
		],
		[
			'code' => "620726",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620800",
		'cn' => "平凉市",
		'children' => [
	[
			'code' => "620802",
			'cn' => "崆峒区"
		],
		[
			'code' => "620821",
			'cn' => "泾川县"
		],
		[
			'code' => "620822",
			'cn' => "灵台县"
		],
		[
			'code' => "620823",
			'cn' => "崇信县"
		],
		[
			'code' => "620824",
			'cn' => "华亭县"
		],
		[
			'code' => "620825",
			'cn' => "庄浪县"
		],
		[
			'code' => "620826",
			'cn' => "静宁县"
		],
		[
			'code' => "620827",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "620900",
		'cn' => "酒泉市",
		'children' => [
	[
			'code' => "620902",
			'cn' => "肃州区"
		],
		[
			'code' => "620921",
			'cn' => "金塔县"
		],
		[
			'code' => "620922",
			'cn' => "安西县"
		],
		[
			'code' => "620923",
			'cn' => "肃北蒙古族自治县"
		],
		[
			'code' => "620924",
			'cn' => "阿克塞哈萨克族自治县"
		],
		[
			'code' => "620981",
			'cn' => "玉门市"
		],
		[
			'code' => "620982",
			'cn' => "敦煌市"
		],
		[
			'code' => "620983",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "621000",
		'cn' => "庆阳市",
		'children' => [
	[
			'code' => "621002",
			'cn' => "西峰区"
		],
		[
			'code' => "621021",
			'cn' => "庆城县"
		],
		[
			'code' => "621022",
			'cn' => "环县"
		],
		[
			'code' => "621023",
			'cn' => "华池县"
		],
		[
			'code' => "621024",
			'cn' => "合水县"
		],
		[
			'code' => "621025",
			'cn' => "正宁县"
		],
		[
			'code' => "621026",
			'cn' => "宁县"
		],
		[
			'code' => "621027",
			'cn' => "镇原县"
		],
		[
			'code' => "621028",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "621100",
		'cn' => "定西市",
		'children' => [
	[
			'code' => "621102",
			'cn' => "安定区"
		],
		[
			'code' => "621121",
			'cn' => "通渭县"
		],
		[
			'code' => "621122",
			'cn' => "陇西县"
		],
		[
			'code' => "621123",
			'cn' => "渭源县"
		],
		[
			'code' => "621124",
			'cn' => "临洮县"
		],
		[
			'code' => "621125",
			'cn' => "漳县"
		],
		[
			'code' => "621126",
			'cn' => "岷县"
		],
		[
			'code' => "621127",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "621200",
		'cn' => "陇南市",
		'children' => [
	[
			'code' => "621202",
			'cn' => "武都区"
		],
		[
			'code' => "621221",
			'cn' => "成县"
		],
		[
			'code' => "621222",
			'cn' => "文县"
		],
		[
			'code' => "621223",
			'cn' => "宕昌县"
		],
		[
			'code' => "621224",
			'cn' => "康县"
		],
		[
			'code' => "621225",
			'cn' => "西和县"
		],
		[
			'code' => "621226",
			'cn' => "礼县"
		],
		[
			'code' => "621227",
			'cn' => "徽县"
		],
		[
			'code' => "621228",
			'cn' => "两当县"
		],
		[
			'code' => "621229",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "622900",
		'cn' => "临夏回族自治州",
		'children' => [
	[
			'code' => "622901",
			'cn' => "临夏市"
		],
		[
			'code' => "622921",
			'cn' => "临夏县"
		],
		[
			'code' => "622922",
			'cn' => "康乐县"
		],
		[
			'code' => "622923",
			'cn' => "永靖县"
		],
		[
			'code' => "622924",
			'cn' => "广河县"
		],
		[
			'code' => "622925",
			'cn' => "和政县"
		],
		[
			'code' => "622926",
			'cn' => "东乡族自治县"
		],
		[
			'code' => "622927",
			'cn' => "积石山保安族东乡族撒拉族自治县"
		],
		[
			'code' => "622928",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "623000",
		'cn' => "甘南藏族自治州",
		'children' => [
	[
			'code' => "623001",
			'cn' => "合作市"
		],
		[
			'code' => "623021",
			'cn' => "临潭县"
		],
		[
			'code' => "623022",
			'cn' => "卓尼县"
		],
		[
			'code' => "623023",
			'cn' => "舟曲县"
		],
		[
			'code' => "623024",
			'cn' => "迭部县"
		],
		[
			'code' => "623025",
			'cn' => "玛曲县"
		],
		[
			'code' => "623026",
			'cn' => "碌曲县"
		],
		[
			'code' => "623027",
			'cn' => "夏河县"
		],
		[
			'code' => "623028",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '630000',
	'cn' => '青海省',
	'children' => [
	[
		'code' => "630100",
		'cn' => "西宁市",
		'children' => [
	[
			'code' => "630102",
			'cn' => "城东区"
		],
		[
			'code' => "630103",
			'cn' => "城中区"
		],
		[
			'code' => "630104",
			'cn' => "城西区"
		],
		[
			'code' => "630105",
			'cn' => "城北区"
		],
		[
			'code' => "630121",
			'cn' => "大通回族土族自治县"
		],
		[
			'code' => "630122",
			'cn' => "湟中县"
		],
		[
			'code' => "630123",
			'cn' => "湟源县"
		],
		[
			'code' => "630124",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632100",
		'cn' => "海东地区",
		'children' => [
	[
			'code' => "632121",
			'cn' => "平安县"
		],
		[
			'code' => "632122",
			'cn' => "民和回族土族自治县"
		],
		[
			'code' => "632123",
			'cn' => "乐都县"
		],
		[
			'code' => "632126",
			'cn' => "互助土族自治县"
		],
		[
			'code' => "632127",
			'cn' => "化隆回族自治县"
		],
		[
			'code' => "632128",
			'cn' => "循化撒拉族自治县"
		],
		[
			'code' => "632129",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632200",
		'cn' => "海北藏族自治州",
		'children' => [
	[
			'code' => "632221",
			'cn' => "门源回族自治县"
		],
		[
			'code' => "632222",
			'cn' => "祁连县"
		],
		[
			'code' => "632223",
			'cn' => "海晏县"
		],
		[
			'code' => "632224",
			'cn' => "刚察县"
		],
		[
			'code' => "632225",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632300",
		'cn' => "黄南藏族自治州",
		'children' => [
	[
			'code' => "632321",
			'cn' => "同仁县"
		],
		[
			'code' => "632322",
			'cn' => "尖扎县"
		],
		[
			'code' => "632323",
			'cn' => "泽库县"
		],
		[
			'code' => "632324",
			'cn' => "河南蒙古族自治县"
		],
		[
			'code' => "632325",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632500",
		'cn' => "海南藏族自治州",
		'children' => [
	[
			'code' => "632521",
			'cn' => "共和县"
		],
		[
			'code' => "632522",
			'cn' => "同德县"
		],
		[
			'code' => "632523",
			'cn' => "贵德县"
		],
		[
			'code' => "632524",
			'cn' => "兴海县"
		],
		[
			'code' => "632525",
			'cn' => "贵南县"
		],
		[
			'code' => "632526",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632600",
		'cn' => "果洛藏族自治州",
		'children' => [
	[
			'code' => "632621",
			'cn' => "玛沁县"
		],
		[
			'code' => "632622",
			'cn' => "班玛县"
		],
		[
			'code' => "632623",
			'cn' => "甘德县"
		],
		[
			'code' => "632624",
			'cn' => "达日县"
		],
		[
			'code' => "632625",
			'cn' => "久治县"
		],
		[
			'code' => "632626",
			'cn' => "玛多县"
		],
		[
			'code' => "632627",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632700",
		'cn' => "玉树藏族自治州",
		'children' => [
	[
			'code' => "632721",
			'cn' => "玉树县"
		],
		[
			'code' => "632722",
			'cn' => "杂多县"
		],
		[
			'code' => "632723",
			'cn' => "称多县"
		],
		[
			'code' => "632724",
			'cn' => "治多县"
		],
		[
			'code' => "632725",
			'cn' => "囊谦县"
		],
		[
			'code' => "632726",
			'cn' => "曲麻莱县"
		],
		[
			'code' => "632727",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "632800",
		'cn' => "海西蒙古族藏族自治州",
		'children' => [
	[
			'code' => "632801",
			'cn' => "格尔木市"
		],
		[
			'code' => "632802",
			'cn' => "德令哈市"
		],
		[
			'code' => "632821",
			'cn' => "乌兰县"
		],
		[
			'code' => "632822",
			'cn' => "都兰县"
		],
		[
			'code' => "632823",
			'cn' => "天峻县"
		],
		[
			'code' => "632824",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '640000',
	'cn' => '宁夏',
	'children' => [
	[
		'code' => "640100",
		'cn' => "银川市",
		'children' => [
	[
			'code' => "640104",
			'cn' => "兴庆区"
		],
		[
			'code' => "640105",
			'cn' => "西夏区"
		],
		[
			'code' => "640106",
			'cn' => "金凤区"
		],
		[
			'code' => "640121",
			'cn' => "永宁县"
		],
		[
			'code' => "640122",
			'cn' => "贺兰县"
		],
		[
			'code' => "640181",
			'cn' => "灵武市"
		],
		[
			'code' => "640182",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "640200",
		'cn' => "石嘴山市",
		'children' => [
	[
			'code' => "640202",
			'cn' => "大武口区"
		],
		[
			'code' => "640205",
			'cn' => "惠农区"
		],
		[
			'code' => "640221",
			'cn' => "平罗县"
		],
		[
			'code' => "640222",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "640300",
		'cn' => "吴忠市",
		'children' => [
	[
			'code' => "640302",
			'cn' => "利通区"
		],
		[
			'code' => "640303",
			'cn' => "红寺堡区"
		],
		[
			'code' => "640323",
			'cn' => "盐池县"
		],
		[
			'code' => "640324",
			'cn' => "同心县"
		],
		[
			'code' => "640381",
			'cn' => "青铜峡市"
		],
		[
			'code' => "640382",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "640400",
		'cn' => "固原市",
		'children' => [
	[
			'code' => "640402",
			'cn' => "原州区"
		],
		[
			'code' => "640422",
			'cn' => "西吉县"
		],
		[
			'code' => "640423",
			'cn' => "隆德县"
		],
		[
			'code' => "640424",
			'cn' => "泾源县"
		],
		[
			'code' => "640425",
			'cn' => "彭阳县"
		],
		[
			'code' => "640426",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "640500",
		'cn' => "中卫市",
		'children' => [
	[
			'code' => "640502",
			'cn' => "沙坡头区"
		],
		[
			'code' => "640521",
			'cn' => "中宁县"
		],
		[
			'code' => "640522",
			'cn' => "海原县"
		],
		[
			'code' => "640523",
			'cn' => "其它区"
		]
		]
	]
		]
],
		[
	'code' => '650000',
	'cn' => '新疆',
	'children' => [
	[
		'code' => "650100",
		'cn' => "乌鲁木齐市",
		'children' => [
	[
			'code' => "650102",
			'cn' => "天山区"
		],
		[
			'code' => "650103",
			'cn' => "沙依巴克区"
		],
		[
			'code' => "650104",
			'cn' => "新市区"
		],
		[
			'code' => "650105",
			'cn' => "水磨沟区"
		],
		[
			'code' => "650106",
			'cn' => "头屯河区"
		],
		[
			'code' => "650107",
			'cn' => "达坂城区"
		],
		[
			'code' => "650108",
			'cn' => "东山区"
		],
		[
			'code' => "650109",
			'cn' => "米东区"
		],
		[
			'code' => "650121",
			'cn' => "乌鲁木齐县"
		],
		[
			'code' => "650122",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "650200",
		'cn' => "克拉玛依市",
		'children' => [
	[
			'code' => "650202",
			'cn' => "独山子区"
		],
		[
			'code' => "650203",
			'cn' => "克拉玛依区"
		],
		[
			'code' => "650204",
			'cn' => "白碱滩区"
		],
		[
			'code' => "650205",
			'cn' => "乌尔禾区"
		],
		[
			'code' => "650206",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652100",
		'cn' => "吐鲁番地区",
		'children' => [
	[
			'code' => "652101",
			'cn' => "吐鲁番市"
		],
		[
			'code' => "652122",
			'cn' => "鄯善县"
		],
		[
			'code' => "652123",
			'cn' => "托克逊县"
		],
		[
			'code' => "652124",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652200",
		'cn' => "哈密地区",
		'children' => [
	[
			'code' => "652201",
			'cn' => "哈密市"
		],
		[
			'code' => "652222",
			'cn' => "巴里坤哈萨克自治县"
		],
		[
			'code' => "652223",
			'cn' => "伊吾县"
		],
		[
			'code' => "652224",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652300",
		'cn' => "昌吉回族自治州",
		'children' => [
	[
			'code' => "652301",
			'cn' => "昌吉市"
		],
		[
			'code' => "652302",
			'cn' => "阜康市"
		],
		[
			'code' => "652303",
			'cn' => "米泉市"
		],
		[
			'code' => "652323",
			'cn' => "呼图壁县"
		],
		[
			'code' => "652324",
			'cn' => "玛纳斯县"
		],
		[
			'code' => "652325",
			'cn' => "奇台县"
		],
		[
			'code' => "652327",
			'cn' => "吉木萨尔县"
		],
		[
			'code' => "652328",
			'cn' => "木垒哈萨克自治县"
		],
		[
			'code' => "652329",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652700",
		'cn' => "博尔塔拉蒙古自治州",
		'children' => [
	[
			'code' => "652701",
			'cn' => "博乐市"
		],
		[
			'code' => "652722",
			'cn' => "精河县"
		],
		[
			'code' => "652723",
			'cn' => "温泉县"
		],
		[
			'code' => "652724",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652800",
		'cn' => "巴音郭楞蒙古自治州",
		'children' => [
	[
			'code' => "652801",
			'cn' => "库尔勒市"
		],
		[
			'code' => "652822",
			'cn' => "轮台县"
		],
		[
			'code' => "652823",
			'cn' => "尉犁县"
		],
		[
			'code' => "652824",
			'cn' => "若羌县"
		],
		[
			'code' => "652825",
			'cn' => "且末县"
		],
		[
			'code' => "652826",
			'cn' => "焉耆回族自治县"
		],
		[
			'code' => "652827",
			'cn' => "和静县"
		],
		[
			'code' => "652828",
			'cn' => "和硕县"
		],
		[
			'code' => "652829",
			'cn' => "博湖县"
		],
		[
			'code' => "652830",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "652900",
		'cn' => "阿克苏地区",
		'children' => [
	[
			'code' => "652901",
			'cn' => "阿克苏市"
		],
		[
			'code' => "652922",
			'cn' => "温宿县"
		],
		[
			'code' => "652923",
			'cn' => "库车县"
		],
		[
			'code' => "652924",
			'cn' => "沙雅县"
		],
		[
			'code' => "652925",
			'cn' => "新和县"
		],
		[
			'code' => "652926",
			'cn' => "拜城县"
		],
		[
			'code' => "652927",
			'cn' => "乌什县"
		],
		[
			'code' => "652928",
			'cn' => "阿瓦提县"
		],
		[
			'code' => "652929",
			'cn' => "柯坪县"
		],
		[
			'code' => "652930",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "653000",
		'cn' => "克孜勒苏柯尔克孜自治州",
		'children' => [
	[
			'code' => "653001",
			'cn' => "阿图什市"
		],
		[
			'code' => "653022",
			'cn' => "阿克陶县"
		],
		[
			'code' => "653023",
			'cn' => "阿合奇县"
		],
		[
			'code' => "653024",
			'cn' => "乌恰县"
		],
		[
			'code' => "653025",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "653100",
		'cn' => "喀什地区",
		'children' => [
	[
			'code' => "653101",
			'cn' => "喀什市"
		],
		[
			'code' => "653121",
			'cn' => "疏附县"
		],
		[
			'code' => "653122",
			'cn' => "疏勒县"
		],
		[
			'code' => "653123",
			'cn' => "英吉沙县"
		],
		[
			'code' => "653124",
			'cn' => "泽普县"
		],
		[
			'code' => "653125",
			'cn' => "莎车县"
		],
		[
			'code' => "653126",
			'cn' => "叶城县"
		],
		[
			'code' => "653127",
			'cn' => "麦盖提县"
		],
		[
			'code' => "653128",
			'cn' => "岳普湖县"
		],
		[
			'code' => "653129",
			'cn' => "伽师县"
		],
		[
			'code' => "653130",
			'cn' => "巴楚县"
		],
		[
			'code' => "653131",
			'cn' => "塔什库尔干塔吉克自治县"
		],
		[
			'code' => "653132",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "653200",
		'cn' => "和田地区",
		'children' => [
	[
			'code' => "653201",
			'cn' => "和田市"
		],
		[
			'code' => "653221",
			'cn' => "和田县"
		],
		[
			'code' => "653222",
			'cn' => "墨玉县"
		],
		[
			'code' => "653223",
			'cn' => "皮山县"
		],
		[
			'code' => "653224",
			'cn' => "洛浦县"
		],
		[
			'code' => "653225",
			'cn' => "策勒县"
		],
		[
			'code' => "653226",
			'cn' => "于田县"
		],
		[
			'code' => "653227",
			'cn' => "民丰县"
		],
		[
			'code' => "653228",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "654000",
		'cn' => "伊犁哈萨克自治州",
		'children' => [
	[
			'code' => "654002",
			'cn' => "伊宁市"
		],
		[
			'code' => "654003",
			'cn' => "奎屯市"
		],
		[
			'code' => "654021",
			'cn' => "伊宁县"
		],
		[
			'code' => "654022",
			'cn' => "察布查尔锡伯自治县"
		],
		[
			'code' => "654023",
			'cn' => "霍城县"
		],
		[
			'code' => "654024",
			'cn' => "巩留县"
		],
		[
			'code' => "654025",
			'cn' => "新源县"
		],
		[
			'code' => "654026",
			'cn' => "昭苏县"
		],
		[
			'code' => "654027",
			'cn' => "特克斯县"
		],
		[
			'code' => "654028",
			'cn' => "尼勒克县"
		],
		[
			'code' => "654029",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "654200",
		'cn' => "塔城地区",
		'children' => [
	[
			'code' => "654201",
			'cn' => "塔城市"
		],
		[
			'code' => "654202",
			'cn' => "乌苏市"
		],
		[
			'code' => "654221",
			'cn' => "额敏县"
		],
		[
			'code' => "654223",
			'cn' => "沙湾县"
		],
		[
			'code' => "654224",
			'cn' => "托里县"
		],
		[
			'code' => "654225",
			'cn' => "裕民县"
		],
		[
			'code' => "654226",
			'cn' => "和布克赛尔蒙古自治县"
		],
		[
			'code' => "654227",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "654300",
		'cn' => "阿勒泰地区",
		'children' => [
	[
			'code' => "654301",
			'cn' => "阿勒泰市"
		],
		[
			'code' => "654321",
			'cn' => "布尔津县"
		],
		[
			'code' => "654322",
			'cn' => "富蕴县"
		],
		[
			'code' => "654323",
			'cn' => "福海县"
		],
		[
			'code' => "654324",
			'cn' => "哈巴河县"
		],
		[
			'code' => "654325",
			'cn' => "青河县"
		],
		[
			'code' => "654326",
			'cn' => "吉木乃县"
		],
		[
			'code' => "654327",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "659001",
		'cn' => "石河子市"
	],
		[
		'code' => "659002",
		'cn' => "阿拉尔市"
	],
		[
		'code' => "659003",
		'cn' => "图木舒克市"
	],
		[
		'code' => "659004",
		'cn' => "五家渠市"
	]
		]
],
		[
	'code' => '710000',
	'cn' => '台湾省',
	'children' => [
	[
		'code' => "710100",
		'cn' => "台北市",
		'children' => [
	[
			'code' => "710101",
			'cn' => "中正区"
		],
		[
			'code' => "710102",
			'cn' => "大同区"
		],
		[
			'code' => "710103",
			'cn' => "中山区"
		],
		[
			'code' => "710104",
			'cn' => "松山区"
		],
		[
			'code' => "710105",
			'cn' => "大安区"
		],
		[
			'code' => "710106",
			'cn' => "万华区"
		],
		[
			'code' => "710107",
			'cn' => "信义区"
		],
		[
			'code' => "710108",
			'cn' => "士林区"
		],
		[
			'code' => "710109",
			'cn' => "北投区"
		],
		[
			'code' => "710110",
			'cn' => "内湖区"
		],
		[
			'code' => "710111",
			'cn' => "南港区"
		],
		[
			'code' => "710112",
			'cn' => "文山区"
		],
		[
			'code' => "710113",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710200",
		'cn' => "高雄市",
		'children' => [
	[
			'code' => "710201",
			'cn' => "新兴区"
		],
		[
			'code' => "710202",
			'cn' => "前金区"
		],
		[
			'code' => "710203",
			'cn' => "芩雅区"
		],
		[
			'code' => "710204",
			'cn' => "盐埕区"
		],
		[
			'code' => "710205",
			'cn' => "鼓山区"
		],
		[
			'code' => "710206",
			'cn' => "旗津区"
		],
		[
			'code' => "710207",
			'cn' => "前镇区"
		],
		[
			'code' => "710208",
			'cn' => "三民区"
		],
		[
			'code' => "710209",
			'cn' => "左营区"
		],
		[
			'code' => "710210",
			'cn' => "楠梓区"
		],
		[
			'code' => "710211",
			'cn' => "小港区"
		],
		[
			'code' => "710212",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710300",
		'cn' => "台南市",
		'children' => [
	[
			'code' => "710301",
			'cn' => "中西区"
		],
		[
			'code' => "710302",
			'cn' => "东区"
		],
		[
			'code' => "710303",
			'cn' => "南区"
		],
		[
			'code' => "710304",
			'cn' => "北区"
		],
		[
			'code' => "710305",
			'cn' => "安平区"
		],
		[
			'code' => "710306",
			'cn' => "安南区"
		],
		[
			'code' => "710307",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710400",
		'cn' => "台中市",
		'children' => [
	[
			'code' => "710401",
			'cn' => "中区"
		],
		[
			'code' => "710402",
			'cn' => "东区"
		],
		[
			'code' => "710403",
			'cn' => "南区"
		],
		[
			'code' => "710404",
			'cn' => "西区"
		],
		[
			'code' => "710405",
			'cn' => "北区"
		],
		[
			'code' => "710406",
			'cn' => "北屯区"
		],
		[
			'code' => "710407",
			'cn' => "西屯区"
		],
		[
			'code' => "710408",
			'cn' => "南屯区"
		],
		[
			'code' => "710409",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710500",
		'cn' => "金门县"
	],
		[
		'code' => "710600",
		'cn' => "南投县"
	],
		[
		'code' => "710700",
		'cn' => "基隆市",
		'children' => [
	[
			'code' => "710701",
			'cn' => "仁爱区"
		],
		[
			'code' => "710702",
			'cn' => "信义区"
		],
		[
			'code' => "710703",
			'cn' => "中正区"
		],
		[
			'code' => "710704",
			'cn' => "中山区"
		],
		[
			'code' => "710705",
			'cn' => "安乐区"
		],
		[
			'code' => "710706",
			'cn' => "暖暖区"
		],
		[
			'code' => "710707",
			'cn' => "七堵区"
		],
		[
			'code' => "710708",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710800",
		'cn' => "新竹市",
		'children' => [
	[
			'code' => "710801",
			'cn' => "东区"
		],
		[
			'code' => "710802",
			'cn' => "北区"
		],
		[
			'code' => "710803",
			'cn' => "香山区"
		],
		[
			'code' => "710804",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "710900",
		'cn' => "嘉义市",
		'children' => [
	[
			'code' => "710901",
			'cn' => "东区"
		],
		[
			'code' => "710902",
			'cn' => "西区"
		],
		[
			'code' => "710903",
			'cn' => "其它区"
		]
		]
	],
		[
		'code' => "711100",
		'cn' => "新北市"
	],
		[
		'code' => "711200",
		'cn' => "宜兰县"
	],
		[
		'code' => "711300",
		'cn' => "新竹县"
	],
		[
		'code' => "711400",
		'cn' => "桃园县"
	],
		[
		'code' => "711500",
		'cn' => "苗栗县"
	],
		[
		'code' => "711700",
		'cn' => "彰化县"
	],
		[
		'code' => "711900",
		'cn' => "嘉义县"
	],
		[
		'code' => "712100",
		'cn' => "云林县"
	],
		[
		'code' => "712400",
		'cn' => "屏东县"
	],
		[
		'code' => "712500",
		'cn' => "台东县"
	],
		[
		'code' => "712600",
		'cn' => "花莲县"
	],
		[
		'code' => "712700",
		'cn' => "澎湖县"
	]
		]
],
		[
	'code' => '810000',
	'cn' => '香港',
	'children' => [
	[
		'code' => "810100",
		'cn' => "香港岛",
		'children' => [
	[
			'code' => "810101",
			'cn' => "中西区"
		],
		[
			'code' => "810102",
			'cn' => "湾仔"
		],
		[
			'code' => "810103",
			'cn' => "东区"
		],
		[
			'code' => "810104",
			'cn' => "南区"
		]
		]
	],
		[
		'code' => "810200",
		'cn' => "九龙",
		'children' => [
	[
			'code' => "810201",
			'cn' => "九龙城区"
		],
		[
			'code' => "810202",
			'cn' => "油尖旺区"
		],
		[
			'code' => "810203",
			'cn' => "深水埗区"
		],
		[
			'code' => "810204",
			'cn' => "黄大仙区"
		],
		[
			'code' => "810205",
			'cn' => "观塘区"
		]
		]
	],
		[
		'code' => "810300",
		'cn' => "新界",
		'children' => [
	[
			'code' => "810301",
			'cn' => "北区"
		],
		[
			'code' => "810302",
			'cn' => "大埔区"
		],
		[
			'code' => "810303",
			'cn' => "沙田区"
		],
		[
			'code' => "810304",
			'cn' => "西贡区"
		],
		[
			'code' => "810305",
			'cn' => "元朗区"
		],
		[
			'code' => "810306",
			'cn' => "屯门区"
		],
		[
			'code' => "810307",
			'cn' => "荃湾区"
		],
		[
			'code' => "810308",
			'cn' => "葵青区"
		],
		[
			'code' => "810309",
			'cn' => "离岛区"
		]
		]
	]
		]
],
		[
	'code' => '820000',
	'cn' => '澳门',
	'children' => [
	[
		'code' => "820100",
		'cn' => "澳门半岛"
	],
		[
		'code' => "820200",
		'cn' => "离岛"
	]
		]
],
		[
	'code' => '990000',
	'cn' => '海外',
	'children' => [
	[
		'code' => "990100",
		'cn' => "海外"
	]
		]
]
		]

?>
